{
  "1": {
    "number": 1,
    "name": "乾",
    "code": "111111",
    "卦解": "你現在處在一個相當穩定的狀態，內在力量充沛，各方面的條件都算不錯。雖然你感覺自己很有能量，但整體進展卻顯得平穩緩慢，沒有什麼劇烈的起伏變化。你的內心世界和外在環境達到了一種微妙的平衡，不會有太大的波動或衝突。這段時間裡，你可能會覺得一切都在按部就班地進行，雖然沒有突破性的進展，但每一步都很紮實，正在為未來的發展積蓄更深厚的底蘊。",
    "六階段": {
      "1": "你內在的根基正在穩固建立，就像種子剛破土而出的那股堅定力量。你會發現自己做事特別有章法，每個步驟都踩得很準，心裡有種踏實的安全感。周圍的環境也配合得不錯，該來的資源都按時到位，讓你能順著既定的節奏往前推進。雖然進展還不算大，但你能清楚感受到那股向上的動能正在積蓄。",
      "2": "你的表現開始有了起伏，像是在學習如何掌控自己的節奏。有時候幹勁十足，有時候又覺得力不從心，這種忽高忽低的狀態讓你心情也跟著波動。不過別擔心，這是成長必經的過程。外在環境也呈現類似的律動，一週內會有明顯的高峰和低谷，但整體趨勢仍然是向上的，你正在學會如何在變動中保持前進。",
      "3": "你開始找到自己的主軸了，內心越來越清楚什麼是重要的，什麼可以放下。你會發現各種細節開始自然而然地串聯起來，做事效率明顯提升，心裡也更有底氣。周圍的環境變得穩定許多，各種條件都開始配合你的節奏，讓你能專注於把事情做得更好。這時候你會感到一種深層的滿足感，知道自己走在對的路上。",
      "4": "環境開始出現一些變化，外界的回應變慢了，合作夥伴們也調整成比較穩定的步調。你可能會感到有點受限，想要大展身手卻發現空間有限。不過這也帶來了好處，就是波動減少了，你可以在相對平穩的環境中穩紮穩打。心情上可能會有些悶悶的，但這正是在為下一波突破做準備，學會在約束中找到發展的空間。",
      "5": "環境現況對你非常有利，你處在一個關鍵的位置上，各方面的配合度都很高。你會發現自己的節奏感越來越好，能夠帶動周圍的人事物一起向前。內心充滿了穩定的力量，不急不躁，但每一步都很紮實。外在環境呈現平穩上升的趨勢，給你足夠的空間和支持去實現想法，這是一個收穫期，也是展現領導力的時候。",
      "6": "你來到了這個階段的尾聲，能感受到一種圓滿的完成感。雖然新的突破不多了，但你開始專注於整理和定型，把之前的努力做個完美的收束。環境趨勢也在為下一輪做準備，給你預留了思考和調整的空間。內心很平靜，有種智者的從容，知道什麼時候該收，什麼時候該放。這不是結束，而是為了更好的開始。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力雖有波動，但正是調整根基的好時機，順應變化重新審視自己的底子，修正不足之處，為未來發展奠定更穩固的根基。",
        "7": "你的根基實力正值成長期，天時地利人和都在你這邊，持續精進基礎能力，維持這股向上的動能，穩步建構你的核心競争力。",
        "8": "你的基礎能力已陷入僵化狀態，積習難改的問題需要正視，認清現實限制，避免硬撐，重新思考根基重建的可能性。",
        "9": "你的基礎能力已達顛峰但開始走下坡，順應自然規律接受轉變，將累積的底子轉化為新的發展方向，為下一階段做好準備。"
      },
      "2": {
        "6": "你當前的外在表現還不夠穩定，容易給人搖擺不定的印象。這時應該順應情勢調整自己的展現方式，找到更適合的表達風格，讓他人看見你的真實實力。",
        "7": "你展現出來的形象正合時宜，散發著積極向上的能量。繼續保持這種外在表現，讓自己的專業能力和人格魅力自然流露，這將為你帶來更多機會。",
        "8": "你在他人眼中的形象已經固化，想要改變別人的既定印象並不容易。與其勉強扭轉外界看法，不如先認清現實，專注於內在修為的提升。",
        "9": "你過度展現自己的強勢和能力，反而給人咄咄逼人的感覺。現在該學會收斂鋒芒，以更謙和的姿態示人，讓外在表現回歸自然平和的狀態。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，此時最適合靈活調整發展方向，不要固執於原有計畫，順應內心真實想法來修正目標，這樣才能開創更好的未來。",
        "7": "你具備穩定的成長動能，現在正是持續精進的黃金時期，保持當前的努力方向和學習節奏，堅定地朝既定目標前進，成果將會逐步顯現。",
        "8": "你需要正視自己在某些領域已達瓶頸的現實，與其勉強突破不如暫時避開這些限制，將精力轉向其他更有潜力的成長空間，重新找到發展契機。",
        "9": "你在某些方面的能力已趨成熟，是時候順應自然規律進行轉型，將累積的經驗智慧轉化為新的成長模式，讓潛力在轉變中獲得新的釋放。"
      },
      "4": {
        "6": "你需要密切觀察外在環境的細微變化，當發現市場或情勢出現不利苗頭時，應立即調整策略方向，保持靈活應變的態度。",
        "7": "你所面對的外在環境正處於上升趨勢，各項條件都相對有利，此時應把握時機持續推進計畫，順應大勢而行。",
        "8": "你必須認清外在環境已形成不利的固化格局，各種阻力根深蒂固，現在應避免正面衝突，尋找其他發展方向。",
        "9": "你看到的外在榮景可能已達頂峰，各種有利條件開始轉弱，應提前準備順應即將到來的環境轉變。"
      },
      "5": {
        "6": "你面對的外在環境正處於微妙變化中，市場或局勢的不穩定性正在顯現，此時應該敏銳觀察這些變化信號，適時調整你的策略方向。",
        "7": "你所處的外在環境正呈現良好的發展趨勢，各方面條件都在朝有利方向發展，你應該把握這個時機，堅定地推進既定計畫。",
        "8": "你面對的外在環境已經形成固化的不利格局，既有的阻力和限制難以輕易改變，你需要認清這個現實，避免硬碰硬的做法。",
        "9": "你所處的外在環境雖然表面看似強勢，但其實已達到轉折點，盛極將衰的跡象正在浮現，你應該順應這個轉變做好準備。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動階段，趨勢尚未明朗，此時應保持靈活應變的心態，隨時準備調整策略方向，切勿固執己見。",
        "7": "你看見外在大勢正朝有利方向發展，天時地利人和皆具備，應堅定信心持續前進，順應這股正向趨勢創造更大成果。",
        "8": "你察覺外在環境已形成強大阻力，既定趨勢難以撼動，明智之舉是認清現實暫時退守，避開正面衝突尋找其他出路。",
        "9": "你發現外在強勢已達頂峰開始轉弱，舊有趨勢即將改變，應順應這個轉折點及早調整布局，迎接新局面的到來。"
      }
    }
  },
  "2": {
    "number": 2,
    "name": "坤",
    "code": "000000",
    "卦解": "你現在處在一個相對安靜的狀態裡，就像冬日裡的大地，表面看似平靜無波，但內在蘊含著深厚的潛力。你的內心和外在環境都顯得比較溫和，沒有太多激烈的變動或衝突。這段時間感覺像是在積蓄能量，雖然進展緩慢，但每一步都很扎實。你可能會感到有些沉悶或缺乏動力，但這種平穩的節奏正在為未來的發展打下基礎，就像種子在土壤中悄悄發芽一樣。",
    "六階段": {
      "1": "你正處在打基礎的階段，許多事情都需要從頭開始準備。內心可能會感到有些焦慮，擔心進度太慢，但這種穩扎穩打的節奏其實是必要的。周遭環境也比較安靜，沒有太多外在壓力催促你，正好給你足夠的時間來鋪陳。雖然看起來成果不多，但每一個小小的準備都在為後續發展奠定堅實的根基。",
      "2": "你開始找到自己的節奏，各種細節逐漸串連起來，工作或生活變得更有規律。內心感受到一種踏實的滿足感，不需要太張揚，但能清楚感覺到自己在穩定前進。外在環境也給你正面的回應，雖然不是轟轟烈烈的成功，卻是持續而穩定的肯定。這種低調而確實的表現，讓你更有信心繼續下去。",
      "3": "你發現事情變得比預期複雜，需要不斷地修正和調整。內心可能會有些挫折感，覺得怎麼老是要重來，但這其實是在挖掘更深層的潛力。外在環境也呈現多變的狀態，各種細節問題浮現，需要你更仔細地處理。雖然成形速度慢了些，但這個反覆琢磨的過程，正在培養你更全面的能力和更深刻的理解。",
      "4": "你與外界的互動開始變得順暢，溝通更加容易，合作關係也逐漸建立。內心感到一種輕鬆感，不再是孤軍奮戰，而是有了更多支持和理解。周遭環境變得更加友善，各種資源和機會開始浮現，整個局面按照預期的方向發展。你感覺自己終於不只是在做準備，而是真正開始與世界產生有意義的連結。",
      "5": "你在整個局面中找到了穩定的位置，主要目標變得清晰明確，不再容易被外界干擾。內心感到前所未有的安定感，知道自己在做什麼，也知道要往哪裡去。外在環境相對穩定，波動減少，給你一個相對可預測的發展空間。這種穩定讓你能夠更專注於核心事務，不用再為各種變數分心。",
      "6": "你即將完成一個階段的任務，新的投入變少，重點轉為整理和保存已有的成果。內心有種完成感，但同時也帶著一點不捨和期待。外在環境暗示著變化即將來臨，舊的模式將要結束，新的可能性正在醞釀。你需要好好安排現有的資源和經驗，為下一個階段的開始做好準備，這是收穫也是新起點的前奏。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚有不穩之處，但這正是調整的良機。順應當下情況，主動修正根基中的薄弱環節，將變動視為重新打底的契機。",
        "7": "你的底子扎實且方向正確，這是持續前進的好時機。保持現有的學習節奏與能力建構，順應天地自然的成長規律穩步提升。",
        "8": "你的基礎能力已形成固定模式，難以快速改變。認清現實中的局限性，避免強求突破，轉而在既有框架內尋求最佳發揮空間。",
        "9": "你的基礎能力已達顛峰但開始顯露疲態。順應自然轉變的時機，主動調整過度用力的狀態，為下一階段的發展保存實力。"
      },
      "2": {
        "6": "你的外在形象容易因小事而搖擺不定，此時應該順應環境變化適時調整表現方式，保持謙遜柔順的姿態，避免過度堅持而失去彈性。",
        "7": "你展現出的穩重踏實正合天時地利，應該繼續保持這種可靠的外在形象，以一貫的誠懇態度面對眾人，堅持正道前行。",
        "8": "你長期累積的沉重包袱已經影響到外在表現，現在需要認清現實，暫時收斂鋒芒，以低調務實的方式避開不必要的關注和壓力。",
        "9": "你過往強勢的外在表現已到轉折點，應該順應時勢變化，主動調整為更加柔和包容的姿態，以退為進重新蓄積能量。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該順應環境變化靈活調整自己的能力發展方向，不要固守舊有模式，在變化中尋找新的突破點。",
        "7": "你具備良好的成長基礎，應該保持現有的學習節奏和努力方向，順應自然發展趨勢，持續累積實力為未來奠定堅實根基。",
        "8": "你需要認清自己在某些方面已經形成固化思維，應該避免在這些領域過度投入，轉而開發其他更有潛力的成長空間。",
        "9": "你在某個領域的發展已達高峰，應該順應轉換期的到來，將accumulated的經驗轉化為新領域的成長動能，開啟下一階段發展。"
      },
      "4": {
        "6": "你需要密切關注外在環境的微妙變化，當發現條件開始轉向不利時，要靈活調整策略，避免固守原有做法而錯失修正時機。",
        "7": "你所面對的外在環境正處於有利階段，應該把握天時地利，堅定地按既定方向前進，不要被小的波動干擾判斷。",
        "8": "你必須正視外在環境已經惡化的現實，不要抱持不切實際的期望，應該收斂行動，等待更好的時機再出手。",
        "9": "你要認清外在的強勢環境即將轉弱，提前做好應對準備，順應即將到來的變化，而非繼續依賴現有的有利條件。"
      },
      "5": {
        "6": "你觀察到外在環境正處於變動期，市場情緒或政策方向尚未明朗，此時應保持彈性，隨時準備根據新的訊息調整策略，避免過度堅持原有判斷。",
        "7": "你看見外在大環境正朝著有利方向發展，各種客觀條件都在支持你的目標，現在正是堅定信念、持續推進計畫的最佳時機，順勢而為必有所成。",
        "8": "你面對的外在現實已經形成強大阻力，既有的困難局面短期內難以扭轉，與其硬碰硬消耗實力，不如暫時迴避鋒芒，等待更好的時機再出手。",
        "9": "你察覺外在的強勢力量已到達頂峰開始轉弱，舊秩序即將改變，明智的做法是順應這股轉換的潮流，提前布局迎接新局面的到來。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動期，各種趨勢尚未明朗，此時應保持敏銳觸覺，隨時準備根據新出現的訊號調整你的策略方向。",
        "7": "你看見外在大環境正朝著有利的方向發展，各種正面趨勢逐漸成形，現在正是順應這股潮流，堅定地朝既定目標持續前進的時機。",
        "8": "你面對的外在環境已形成固化的不利局面，種種負面趨勢根深蒂固難以撼動，你需要認清現實，避開正面衝突，另尋出路。",
        "9": "你發現外在環境的強勢趨勢已達頂點，即將出現轉折，你應當順應這個必然的變化，提前為新的環境週期做好準備。"
      }
    }
  },
  "3": {
    "number": 3,
    "name": "屯",
    "code": "100010",
    "卦解": "你現在就像站在一片新開墾的土地上，四周雖然充滿可能性，但眼前確實有不少障礙需要克服。你的內心想法和外在環境還算平衡，沒有太大的衝突，但整體推進的速度比較緩慢，好像每走一步都要多花些力氣。這種狀態讓你感覺有點卡住了，但並不是完全停滯，而是需要更多耐心和時間來累積能量。你能感受到變化正在醞釀中，只是還沒到爆發的時刻。",
    "六階段": {
      "1": "你正處在一個全新開始的起點，內心充滿各種想法和可能性，但同時也感到困惑和不確定。就像站在迷霧中的十字路口，你能感受到機會的存在，卻看不清楚具體的方向。周圍的環境也處於變動狀態，資訊零散、資源分散，你需要在多個選項中不斷試探。這個階段的焦慮是正常的，因為你正在為未來的發展奠定基礎，雖然看似混亂，但每一次嘗試都是必要的探索。",
      "2": "經過初期的摸索，你開始在混沌中看見一些清晰的輪廓。內心的直覺變得敏銳，你能夠更準確地感知什麼是重要的、什麼是次要的。周圍開始出現一些有用的線索和關鍵資訊，讓你對整個情況有了基本的理解。雖然還不能完全掌控局面，但你已經能夠用語言描述自己想要的方向。這種逐漸明朗的感覺帶來內心的安定，你知道自己正在正確的軌道上。",
      "3": "你發現事情比想像中複雜，前進的道路依然充滿阻礙。內心開始感到挫折，因為嘗試了很多方法，但成果都很零散，無法形成有效的突破。環境似乎在考驗你的耐心，你發現自己花更多時間在整理和反思，而不是向前推進。這個階段讓你學會謙遜，明白有些事情急不得。雖然表面上進展緩慢，但這些看似繁瑣的整理工作，正在為後續的發展積累必要的養分。",
      "4": "外在環境開始對你釋出善意，一些重要的支援和資源逐漸到位。你感受到周圍人的支持，或是找到了關鍵的合作夥伴。雖然進展仍然緩慢，但每一步都很扎實，你能感覺到自己正在建立穩固的基礎。內心的焦慮開始緩解，取而代之的是踏實的安全感。環境條件變得更加友善，阻力減少了，你開始相信這個方向是對的，只需要時間來讓一切慢慢成形。",
      "5": "你找到了核心的突破點，事情開始順暢地發展。內心充滿成就感和信心，因為你看見了努力的成果正在一個個地實現。環境現況對你很有利，各種機會和資源都在適當的時機出現。你能清楚地看見整個藍圖，知道每個環節如何串連。這個階段讓你體驗到流暢感，彷彿一切都在按照計畫進行，你只需要保持專注，繼續沿著這條已經打通的道路前進。",
      "6": "你已經建立起一個基本的架構，但深知這還是一個稚嫩的開始。內心充滿期待但也保持謹慎，你明白現在的成果需要細心呵護才能茁壯。外在環境呈現出向上的趨勢，但變化仍在進行中。你學會保持彈性，不把事情做得太滿太僵硬，而是留下調整的空間。這種智慧讓你能夠從容地迎接下一個階段的挑戰，知道更大的成熟期即將到來。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚不穩固，容易因外在變化而動搖，此時應順應環境調整學習方向，持續修煉內功，將變動視為成長機會。",
        "7": "你具備扎實的根基與潛力，正是順天時而動的好時機，應保持現有的努力方向，穩健前進累積實力，莫急躁求成。",
        "8": "你的基礎能力已形成固化模式，難以輕易改變，應認清自身局限，避免勉強突破，善用既有優勢尋找適合發展道路。",
        "9": "你的基礎能力已達高峰但開始顯疲態，應順應時勢轉變，將豐富經驗傳承他人，同時為下一階段的轉型做好準備。"
      },
      "2": {
        "6": "你的外在表現還不夠穩定，容易給人搖擺不定的印象，此時應該順勢調整自己的言行舉止，讓別人看到你更加成熟可靠的一面。",
        "7": "你展現出的積極進取精神正符合時勢所需，繼續保持這種向上的外在形象，讓周圍的人都能感受到你堅定前行的決心與活力。",
        "8": "你長期養成的外在形象已經根深蒂固，要改變別人對你的既定印象並不容易，不如認清現實，先從內在修養開始慢慢調整。",
        "9": "你過去強勢的外在表現已經到了該轉變的時候，順應形勢變化，展現更加柔和包容的一面，才能獲得他人更多的認同與支持。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，此時應該靈活調整自己的發展方向，不要固執於原有計畫，順應環境變化來修正你的能力培養重點。",
        "7": "你具備良好的成長基礎和發展動能，應該堅持當前的努力方向，持續投入時間和精力來強化自己的核心能力，前進的路徑是正確的。",
        "8": "你過去的習慣或思維模式已成為成長的阻礙，需要認清這個現實並主動迴避那些限制你發展的因素，重新尋找突破的可能。",
        "9": "你某些方面的能力已達到階段性高點，應該順應自然規律準備轉換跑道，將過往累積的經驗轉化為新領域的成長動力。"
      },
      "4": {
        "6": "你察覺到外在環境正在微妙變化，此時應靈活調整策略方向，不要固執於原有計畫，順應這些變化來修正你的行動路線。",
        "7": "你發現外在條件正朝有利方向發展，天時地利都在支持你前進，此時應堅定維持既定方向，持續推動計畫執行。",
        "8": "你面對的外在環境已形成不利的固化格局，各種阻礙根深蒂固難以撼動，你需要認清現實並暫時避開正面衝突。",
        "9": "你看到原本強勢的外在條件開始走向轉折點，舊有優勢即將消退，你要順應這個大趨勢的轉變來調整定位。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些波動雖然讓人不安，但正是調整策略的良機，順應這些變化修正你的方向，將能化險為夷。",
        "7": "你看見外在形勢正朝著有利的方向發展，天時地利都在你這邊，堅持既定的路線繼續前進，順勢而為將會收穫豐碩成果。",
        "8": "你面對的外在困境已經根深蒂固，強行突破只會徒勞無功，認清現實狀況選擇暫時迴避，等待更好的時機再出手。",
        "9": "你感受到外在環境的強勢已接近尾聲，舊有的格局即將轉變，順應這股轉換的力量調整自己的立場，將能掌握新機遇。"
      },
      "6": {
        "6": "你察覺到外在環境正在微妙變化，趨勢尚未明朗，此時應保持敏銳觀察力，隨時準備調整策略方向，不要固守既有做法。",
        "7": "你看見大環境正朝有利方向發展，天時地利皆備，應該堅定信心持續推進計畫，順應這股向上的趨勢力量前行。",
        "8": "你面對的外在局勢已然僵化難變，舊有模式積習深重，明智之舉是避開正面衝突，另尋突破點或暫時退守觀望。",
        "9": "你所處的環境正從高峰轉向衰退，原有的推動力量已近尾聲，應順應這個轉換期，及早佈局下一個發展階段。"
      }
    }
  },
  "4": {
    "number": 4,
    "name": "蒙",
    "code": "010001",
    "卦解": "你現在就像剛開始學習新事物的狀態，雖然基礎還不夠扎實，但內心很平靜，沒有太多雜念干擾。整個過程進展得還算順利，不會有太大的阻礙，只是步伐比較緩慢穩重。你的內在和外在環境都保持著不錯的平衡，沒有明顯的衝突或壓力。短時間內可能看不出什麼明顯變化，但隨著時間推移，各種條件會慢慢整合得更好，力量也會一點一滴地累積起來。",
    "六階段": {
      "1": "你正處在學習的最初階段，腦海中充滿零散的資訊片段，像拼圖還沒找到邊框。你對許多基本概念還模糊不清，常常搞不懂專業術語的真正意思。內心既興奮又焦慮，渴望快速掌握卻又感到無從下手。周遭的學習環境資源豐富但雜亂，你需要耐心地從最基礎開始，不要急於求成。",
      "2": "你開始能夠準確說出關鍵概念的名稱，基本方法也能照著步驟重述出來。學習曲線明顯上升，你感受到進步的成就感，內心的信心開始建立。你能夠在簡單的情境中應用所學，雖然還不夠熟練。環境對你越來越友善，老師和同伴開始認可你的努力，學習氛圍變得更加積極正面。",
      "3": "你發現自己的盲點開始浮現，經常出現理解錯誤需要反覆修正。有些概念掌握得很好，有些卻還是一知半解，這種不均衡讓你感到挫折和困惑。內心時而自信時而懷疑，情緒起伏較大。周圍的挑戰變得更複雜，需要更深入的思考才能解決問題。這個階段雖然辛苦，但正是突破的關鍵時期。",
      "4": "你開始從其他成功案例中學習，能夠進行類比和比較，整體的理解框架逐漸清晰。透過觀察別人的做法，你找到了新的學習路徑。內心變得更加開放和好奇，願意嘗試不同的方法。外在環境提供了豐富的實例和參考資料，你能夠有效利用這些資源來強化自己的認知結構。",
      "5": "你終於打通了核心原理，能夠自我檢查並主動修正錯誤。理解有了真正的深度，可以靈活運用到不同情境中。內心充滿成就感和自信，你知道自己已經真正掌握了精髓。周圍的人開始向你請教問題，環境對你的期待也提高了。你能夠獨當一面處理大部分的挑戰，學習進入了相對穩定的狀態。",
      "6": "你已經能夠活用所學，但仍發現有許多未知領域等待探索。知識版圖持續擴大，你開始挑戰更高難度的任務。內心既滿足於已有成就，又對未來充滿期待。外在環境變化快速，需要你不斷更新和拓展知識邊界。你意識到學習是終生的旅程，保持謙遜和好奇心將是持續成長的關鍵。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚在變化中，別急於定型，順應當下的學習機會，靈活調整自己的知識結構和技能方向，為未來發展奠定更扎實的根基。",
        "7": "你的基礎能力正處於上升期，保持現有的學習節奏和方向，持續精進核心技能，這份穩定的積累將成為你長期發展的重要底蘊。",
        "8": "你需要正視基礎能力的不足或固化問題，避免硬撐或自欺，重新審視自己的底子，選擇更適合現況的發展路徑，務實為上。",
        "9": "你過往累積的基礎能力已達高峰，是時候順應轉變，將豐富經驗轉化為指導他人的智慧，或開拓新領域來延續價值發揮。"
      },
      "2": {
        "6": "你目前的外在表現容易讓人產生誤解，應該主動調整展現方式，以更謙遜的姿態學習，這樣的修正將幫助你建立更好的形象。",
        "7": "你展現出的學習態度正符合時勢所需，繼續保持這種積極求知的外在表現，堅定地在成長道路上前進，必能獲得他人認同。",
        "8": "你長期養成的外在習慣已經根深蒂固，與其勉強改變不如認清現實，暫時避免在公開場合過度表現，給自己沉潛的空間。",
        "9": "你過去強勢的外在表現已到了該轉換的時候，主動順應環境變化，以更柔軟的方式展現自己，才能開創新的局面。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，當發現學習方向或發展策略不適合時，要勇於調整路線，靈活修正才能找到真正適合的成長道路。",
        "7": "你的成長軌道正順應天時地利，現在是穩定前進的最佳時機，持續投入努力深耕專業，未來發展潛力將水到渠成。",
        "8": "你過去的學習模式已經根深蒂固難以改變，與其勉強突破舊框架，不如認清現實選擇更適合的成長領域重新出發。",
        "9": "你在某些領域的成長已達高峰開始走下坡，是時候順應變化轉向新的發展方向，讓過往經驗成為下個階段的養分。"
      },
      "4": {
        "6": "你面對的外在環境正在波動變化，這些不穩定因素雖然帶來挑戰，但也創造了調整的機會，及時順應這些變化來修正你的方向。",
        "7": "你所處的外在條件正朝著有利的方向發展，天時地利都在支持你前進，堅持既定的正確路線，持續推進你的計畫。",
        "8": "你面臨的外在環境已經形成固化的不利格局，這些根深蒂固的阻礙難以撼動，認清現實後選擇暫時迴避或另尋出路。",
        "9": "你依賴的外在優勢已達頂峰開始轉弱，過往的有利條件正在消退，順應這個轉變趨勢，提前為新局面做好準備。"
      },
      "5": {
        "6": "你觀察到外在環境充滿變數，民心浮動不安，此時應順勢調整教育方針，以柔克剛，用包容理解取代嚴厲管教，才能化解當前的不穩定局面。",
        "7": "你看見外在條件正朝有利方向發展，學習氛圍日漸濃厚，應維持現有的教導方式，堅持循序漸進的啟發原則，順應這股向上提升的良好趨勢。",
        "8": "你發現外在環境已形成根深蒂固的惡習慣，積弊難改，應認清現實避免硬碰硬，暫時收斂鋒芒，等待更合適的時機再進行根本性的教化工作。",
        "9": "你察覺外在的舊秩序已達極限開始衰退，應順應這個轉變趨勢，放下過往的執著，以更開放包容的心態迎接新的教育模式和學習方法的到來。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，這些不穩定的趨勢提醒你要保持敏銳觀察力，適時調整自己的策略方向，才能在變動中找到新的機會。",
        "7": "你看見外在大環境正朝著有利的方向發展，這股順暢的趨勢值得你持續關注並跟隨，保持現有的前進步調將能獲得良好成果。",
        "8": "你面對的外在環境已形成難以撼動的固化趨勢，認清這個現實並避開正面衝突，尋找其他突破口或等待時機成熟再行動。",
        "9": "你察覺外在強勢趨勢已接近轉折點，舊的格局即將改變，順應這個自然轉換過程，準備迎接新環境帶來的不同可能性。"
      }
    }
  },
  "5": {
    "number": 5,
    "name": "需",
    "code": "111010",
    "卦解": "你現在處在一個蓄勢待發的狀態，內在的能量和準備都相當充足，但外在環境還沒完全配合。就像站在起跑線上，肌肉已經繃緊、心理準備就緒，卻還在等待發令槍響起。你的步調和時機掌握得很穩，不急不徐，整個氛圍是沉穩而有力的。雖然眼前看不到太多明顯的變化，但你能感受到底下正在醞釀著什麼，各種條件正在慢慢對齊，推進的力量正在一點一滴地累積。",
    "六階段": {
      "1": "你現在感覺像在收集拼圖的碎片，很多想法和資源都還在萌芽階段。內心有種蓄勢待發的期待感，但也帶著些許不安，因為你知道時機還沒到。周圍的人事物似乎都在各自準備著什麼，空氣中瀰漫著一種「即將開始」的氛圍。你學會了在這種不確定中保持耐心，默默地為即將到來的機會做好基礎建設。",
      "2": "你開始看到希望的曙光，重要的人脈和資源逐漸聚攏到你身邊。內心的焦慮減少了，取而代之的是一種踏實的信心，你知道自己已經具備了基本的實力。環境中出現了更多支持你的聲音，合作夥伴也展現出更積極的態度。雖然還在等待最佳時機，但你已經能感受到成功的輪廓越來越清晰。",
      "3": "你遇到了一些小波折，進展時快時慢，偶爾需要繞道而行。內心有時會感到挫折，懷疑是否走對了方向，但理智告訴你這些都是成長必經的過程。外在環境變化多端，有時順風有時逆風，讓你學會了靈活應變。儘管路途崎嶇，你發現自己的韌性比想像中更強，每次挫折都讓你更接近目標。",
      "4": "你感受到了明顯的轉機，外界開始對你的努力給予正面回應。內心的興奮難以掩飾，那種「終於等到了」的喜悅讓你充滿動力。周圍的環境變得更加友善，原本困難的事情突然變得順手，各種機會之門開始為你敞開。你發現自己不再是在等待，而是可以主動出擊，把握這難得的時間窗口。",
      "5": "你找到了屬於自己的節奏，工作和生活都進入了穩定的軌道。內心充滿了成就感和滿足感，那種掌控感讓你更加自信。外在環境與你形成了良好的互動循環，你的付出得到應有的回報，你的需求也能被適當滿足。這種平衡狀態讓你既能享受當下的成果，又能持續地向前邁進。",
      "6": "你完成了這個階段的目標，內心帶著完成使命的滿足感，同時也開始思考下一步的方向。你學會了不把所有資源都耗盡，而是保留一些能量為未來做準備。周圍的環境也在悄悄醞釀新的變化，你敏銳地察覺到下一個週期即將開始。這種結束與開始並存的狀態，讓你既能享受成功的喜悅，又能保持前進的動力。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖根本。此時應該順應當下情況，靈活調整自己的能力建構方向，不要固執於原有的學習模式。",
        "7": "你的根基正在順應天時地利而茁壯成長，這是打造實力的絕佳時機。繼續保持現在的努力方向，穩步累積你的核心競爭力，不要輕易改變。",
        "8": "你過往累積的能力模式已經僵化，難以適應新的挑戰要求。認清現實中自己的局限性，避免用舊有思維硬碰硬，重新審視能力的根本問題。",
        "9": "你長期建立的優勢能力已到轉換期，強行維持反而會消耗過多能量。順應時勢變化，讓既有的深厚根基自然轉向新的發展可能性。"
      },
      "2": {
        "6": "你目前的外在表現容易招致他人誤解或批評，應當及時調整自己的言行舉止，以更謙遜包容的態度面對他人，避免因小節而影響大局。",
        "7": "你展現出的穩健形象正符合當前形勢所需，應當繼續保持這種可靠的外在表現，讓他人看到你的誠信與能力，這將為你帶來更多機會。",
        "8": "你長期以來形成的外在形象已難以改變，與其勉強扭轉他人印象，不如認清現實狀況，暫時收斂鋒芒，等待更適合的時機再行動。",
        "9": "你過於強勢的外在表現已達極限，應當順應變化調整姿態，以更柔和的方式與他人互動，才能在轉變中保持良好的人際關係。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該靈活調整學習方向和發展策略，不要固守原有模式，順應內在變化來修正自己的能力提升路徑。",
        "7": "你具備良好的成長基礎和發展動能，應該持續在既定方向上努力精進，保持學習熱忱，讓自己的潛力在穩定前進中逐步綻放。",
        "8": "你需要認清當前能力的真實狀況，避免盲目追求過高目標，先鞏固基礎能力，從實際可達成的小目標開始重新建立成長動力。",
        "9": "你已達到某個成長階段的高峰，應該順應轉換期的到來，放下過往的成功模式，開放心胸迎接新的學習領域和發展可能性。"
      },
      "4": {
        "6": "你觀察到外在環境出現微妙變化，這些訊號提醒你需要靈活調整策略，不要固守原有做法，順應環境波動來修正你的行動方向。",
        "7": "你發現外在條件正朝有利方向發展，天時地利皆備，此時應該堅定信心持續前進，把握這個順勢而為的絕佳時機。",
        "8": "你面對的外在環境已形成不利格局，積累的阻礙難以撼動，現在需要認清現實，避開正面衝突，尋找其他突破口。",
        "9": "你察覺外在優勢已達頂峰開始轉向，強勢局面即將改變，此時要順應大勢轉換，提前為新的環境變化做好準備。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，此時應該靈活調整自己的策略和節奏，不要固執於原有計畫，順應這些變化來修正方向。",
        "7": "你看見外在情勢正朝有利方向發展，天時地利皆順，此刻應該保持現有步調繼續前進，堅持正道不偏離既定目標。",
        "8": "你面對的外在環境已經積累太多阻礙和困難，認清現實後應該暫時避開正面衝突，等待更好的時機再行動。",
        "9": "你感受到外在力量已達頂峰開始轉弱，舊有格局即將改變，此時應該順應這個轉變趨勢，準備迎接新的局面。"
      },
      "6": {
        "6": "你觀察到外在環境正在醞釀變化，此時應保持靈活應變的心態，隨時準備調整策略方向，不要固守原有計畫而錯失轉機。",
        "7": "你發現外在趨勢正朝有利方向發展，應該堅定信心持續推進既定目標，順應天時地利的大勢，穩步向前不要躁進。",
        "8": "你面對的外在環境已形成難以撼動的格局，應當認清現實避開正面衝突，暫時退守觀望，等待更合適的時機再行動。",
        "9": "你察覺外在強勢已到達頂峰將要轉向，此時要順應即將到來的變化，適時調整立場，準備迎接新的局面發展。"
      }
    }
  },
  "6": {
    "number": 6,
    "name": "訟",
    "code": "010111",
    "卦解": "你現在處在一個有些矛盾的狀態裡。表面上看起來條件還不錯，外在環境給你的支持也比內在的力量來得強一些，但整個過程卻不是那麼順暢。就像走在一條時寬時窄的路上，有時候步調對了，有時候又卡住了。你會感覺到一種緩慢的推進感，不是停滯不前，但也不是快速前進。這種狀態讓人有點焦躁，因為明明感覺有能力做更多，卻總是受到某種無形的阻礙。",
    "六階段": {
      "1": "你開始察覺到某些地方不太對勁，原本以為大家都有共識的事情，現在發現每個人的理解都不一樣。內心有點困惑和不安，覺得是不是自己搞錯了什麼。周圍的氛圍還算平靜，但你能感受到一股微妙的張力在醞釀，就像暴風雨前的寧靜。這時候最需要的是保持冷靜，先搞清楚到底哪裡出了分歧。",
      "2": "你發現問題比想像中複雜，各方都拿出了自己的證據和理由，桌面上擺滿了需要釐清的資料。內心既想找出真相，又擔心事情越挖越深。身邊的人開始選邊站，原本單純的問題變得政治化。你感受到一種責任感，必須認真對待這些浮現的爭議點，同時也意識到簡單的解決方案可能不存在了。",
      "3": "爭執進入白熱化階段，你發現自己被捲入無止境的辯論中，每天都在處理各種攻防和反駁。內心感到疲憊和挫折，覺得事情怎麼變得這麼複雜。周圍的效率明顯下降，原本的工作節奏被打亂，每個人都把時間花在爭論上。你開始懷疑這樣下去有沒有意義，但又不能輕易放棄自己的立場。",
      "4": "事情終於有了轉機，開始進入正式的處理程序。你感到一絲安慰，因為混亂的局面有了框架和規則來約束。內心雖然還有些緊張，但至少知道接下來會怎麼發展。外在環境變得更有秩序，有專門的機制來處理這類爭議，時間表和流程都變得可以預測。你開始適應這種節奏，準備在制度框架內解決問題。",
      "5": "局勢漸趨明朗，各方的核心立場和責任範圍都比較清楚了。你內心踏實了很多，知道自己該承擔什麼、該爭取什麼。環境氛圍回歸務實，大家開始專注於解決實際問題，而不是情緒化的爭執。你發現自己能夠更冷靜地處理各種細節，也更有信心面對最終的結果。整個過程變得更加理性和建設性。",
      "6": "爭議即將塵埃落定，正式的結果就要出來了。你內心五味雜陳，既期待終於能結束這場拉鋸戰，又對未知的結果感到些許忐忑。周圍的噪音和情緒化討論明顯減少，大家都在等待最終的定論。你發現自己已經學會接受，無論結果如何，至少整個過程是公正透明的。這段經歷讓你更成熟，也更懂得如何處理類似的情況。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，面對爭訟時容易動搖。此時應順勢調整自己的根基，補強不足之處，避免因底子薄弱而在衝突中處於劣勢。",
        "7": "你具備紮實的基本功底，在爭議中能站穩腳跟。繼續維持這份根基優勢，堅持正道前進，讓扎實的能力成為你化解爭端的最強支撐。",
        "8": "你的根基已經僵化，舊有的能力模式難以應對新的爭訟局面。認清現實，避免固守過時的底子，才不會在衝突中越陷越深。",
        "9": "你過往累積的基礎能力已達極限，強撐只會適得其反。順應時勢轉變，放下舊有的根基包袱，以柔軟姿態面對爭訟挑戰。"
      },
      "2": {
        "6": "你在爭端中展現的態度還有調整空間，當發現自己的立場或表達方式可能有誤時，要勇於修正外在形象，適時軟化強硬姿態。",
        "7": "你應該在爭議中展現出堂堂正正的態度，保持理性和原則性的外在形象，讓人看到你是為了正義而非私利在據理力爭。",
        "8": "你目前展現出來的對立姿態已經積重難返，應該認清現實避免繼續強硬表態，收斂鋒芒以免讓爭端更加惡化難收拾。",
        "9": "你過於強勢的外在表現已達極限，應該順應情勢轉變展現出更包容和解的姿態，讓對方看到你願意化解爭端的誠意。"
      },
      "3": {
        "6": "你的成長潛力在於學會適時調整爭執策略，當發現自己立場搖擺不定時，主動修正方向比固執己見更能開拓未來發展空間。",
        "7": "你具備在爭議中穩步前進的潛力，順應正當趨勢持續努力，這種堅持正道的能力將成為你最大的成長優勢。",
        "8": "你需認清在爭訟中積怨已深的現實，成長潛力在於學會適時退讓避爭，將精力轉向其他更有建設性的發展方向。",
        "9": "你的成長空間在於學會在爭執激烈時順勢轉變，當強勢作風已達極限時，主動調整為柔和姿態反而能開創新局面。"
      },
      "4": {
        "6": "你面對的外在爭訟環境正在變化，此時應當靈活調整策略，不要固執己見，順應環境變化修正你的立場和做法。",
        "7": "你所處的外在環境趨勢明朗，堅持正道前進是明智之舉，保持現有的正確方向，時機正在朝有利於你的方向發展。",
        "8": "你面臨的外在爭訟環境已經僵化難解，認清現實避免硬碰硬，暫時退讓保存實力比強行突破更為明智。",
        "9": "你察覺外在爭訟環境的強勢已到盛極而衰的轉折點，順應這個轉變趨勢，適時調整你的應對策略迎接新局面。"
      },
      "5": {
        "6": "你觀察到外在爭訟環境正在微妙變化，各方立場開始鬆動，此時應順勢調整自己的策略和態度，靈活回應這些變化以化解紛爭。",
        "7": "你看見外在情勢朝著有利於正義的方向發展，天時地利皆在支持公正一方，你應該維持正確立場繼續前進，不要輕易妥協退讓。",
        "8": "你面對的外在爭訟局面已經積怨太深，各方立場固化難以撼動，你必須認清這個現實，避免硬碰硬只會讓情況更加惡化。",
        "9": "你察覺外在的強勢壓迫已到強弩之末，看似強大的對手實則力量衰竭，你應該順應這個轉變趨勢，準備迎接局勢的根本改變。"
      },
      "6": {
        "6": "你觀察到外在爭訟環境開始出現變化跡象，應順應這些微妙轉折及時調整策略，避免固守原有立場而錯失化解紛爭的良機。",
        "7": "你發現外在環境正朝向有利於解決爭端的方向發展，應維持當前正確方針繼續前進，讓時間和趨勢成為化解訟爭的助力。",
        "8": "你面對的外在爭訟環境已形成難以扭轉的僵局，應認清現實選擇適時退讓或避開鋒芒，勉強硬撐只會徒增損失。",
        "9": "你察覺外在爭訟勢頭已達頂峰即將轉向，應順應這個重大轉變放下執著，讓紛爭在自然消解中找到新的平衡點。"
      }
    }
  },
  "7": {
    "number": 7,
    "name": "師",
    "code": "010000",
    "卦解": "你現在就像是一支正在重整旗鼓的隊伍，雖然整體實力還不算強大，但內在的凝聚力和決心卻很扎實。周圍的環境變化不大，給你一種穩定中帶點停滯的感覺。你能感受到事情正朝著對的方向緩慢前進，雖然步調不算快，但每一步都踏得很穩。內心深處有股堅定的力量在支撐著你，讓你即使面對外在條件不夠理想的情況，依然保持著信心和耐心。整個氛圍就像黎明前的靜謐，蓄積著即將爆發的能量。",
    "六階段": {
      "1": "你正處在重新整合的起點，內心有種既期待又不安的複雜情緒。周圍的人事物還很分散，每個人都有自己的想法和做法，你感到有點混亂但也充滿可能性。就像剛開始組建團隊時，大家都在摸索彼此的底線和風格，雖然目標明確，但執行的方式還在磨合中，需要你保持耐心和開放的心態。",
      "2": "你開始找到自己的節奏，內心逐漸篤定起來。基本的架構和規則已經建立，你能感受到團隊開始有了共同的步調，這讓你更有信心面對挑戰。環境也變得相對穩定，大家開始按照既定的方式運作，雖然還不算完美，但至少有了可以依循的模式，你的表現也因此更加穩健有力。",
      "3": "你察覺到自己還有更多未發揮的能力，內心既興奮又有些焦慮。團隊進入磨合期，配合度忽好忽壞，有時效率很高，有時又卡在細節上。你發現自己的角色定位需要更清楚，潛在的才能正在等待適當時機展現。環境充滿變數，但這些挑戰正是你成長和突破的機會。",
      "4": "外在環境開始為你提供更好的支持，你感到一種踏實的安全感。後勤資源變得充足，各種合作管道也更加暢通，讓你能專心發揮所長。周圍的條件趨於平衡，不再有太多突發狀況干擾你的計畫。這種穩定的基礎讓你內心更加從容，知道自己有了可靠的後盾來實現目標。",
      "5": "環境現況對你非常有利，你感受到一種勢如破竹的順暢感。資源調度井然有序，團隊配合度達到高峰，整體戰力明顯提升。你內心充滿自信和成就感，知道這是發揮影響力的最佳時機。周圍的人都能跟上你的節奏，執行效率前所未有地高，讓你有種一切盡在掌握的暢快感覺。",
      "6": "大局已定，你內心有種圓滿完成使命的滿足感，但也開始思考下一步。環境進入維持和交接的階段，不再需要你全力衝刺，而是要保持戰備狀態並培養接班人。你感到一種智慧的沉澱，知道何時該進，何時該退。周圍的氛圍從激烈轉為平和，讓你有機會休養生息，為未來的挑戰做準備。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外界變化而動搖，此時應謙虛學習，順應環境調整自己的根基，不要急於展現實力。",
        "7": "你具備良好的基礎能力，正處於成長的黃金時期，應該持續精進核心技能，穩步建立更深厚的實力根基。",
        "8": "你的基礎能力已形成固化模式，難以快速改變，應認清現有底子的局限性，避免勉強挑戰超出能力範圍的任務。",
        "9": "你的基礎能力雖然深厚，但已達巔峰狀態，應順應時代變化轉換跑道，將既有底子轉化為新領域的優勢。"
      },
      "2": {
        "6": "你展現的領導風格容易搖擺不定，此時應該順應團隊反饋，適時調整你的指揮方式和決策節奏，讓外在表現更加穩重可靠。",
        "7": "你在團隊中展現出堅定的領導氣質，這正符合當前局勢需要，繼續保持這種果斷指揮的外在形象，帶領眾人向前推進。",
        "8": "你過往建立的權威形象已經僵化難改，認清這個現實後應該避免強硬展現控制欲，改以低調內斂的方式處理團隊事務。",
        "9": "你展現的強勢領導風格已達極限，順應時勢轉變，讓外在表現從剛猛轉向柔和，以更包容的姿態面對團隊挑戰。"
      },
      "3": {
        "6": "你的成長路上容易因小挫折而動搖，此時應順勢調整學習方法，將每次的失敗轉化為下次進步的養分，靈活修正才能持續向上。",
        "7": "你正處於能力提升的黃金期，應該堅持既定的學習計劃，順應自然成長規律穩步前進，保持這份積極向上的動能不要中斷。",
        "8": "你過去養成的某些習慣已成為成長阻礙，必須認清這個現實，暫時避開舒適圈的誘惑，重新建立有利於進步的新模式。",
        "9": "你在某個領域的發展已接近瓶頸，不必強求突破，應該順應轉變的時機，將過往累積的經驗轉移到新的成長方向上發展。"
      },
      "4": {
        "6": "你面對的外在環境變化頻繁，容易出現反覆，此時應靈活調整策略，順應環境的微妙變化，避免固執己見而錯失良機。",
        "7": "你所處的外在條件正順應天地大勢，環境基本面有利，應該堅持既定方向繼續前進，把握這個難得的有利時機。",
        "8": "你面臨的外在環境已經積弊深重，結構性問題難以扭轉，應該認清現實，避免硬碰硬的對抗，尋求其他出路。",
        "9": "你所依賴的外在優勢已達頂峰開始轉弱，環境即將變化，應該順應這個轉變趨勢，提前做好應對準備。"
      },
      "5": {
        "6": "你觀察到外在局勢變化不定，敵我態勢尚未明朗，此時應靈活調整戰略部署，順應環境變化修正行動方針，避免僵化思維導致失誤。",
        "7": "你看見外在環境正朝有利方向發展，天時地利漸趨成熟，應堅持既定戰略方向，保持前進動能，把握大勢所趨的良好時機。",
        "8": "你面對的外在阻力已根深蒂固，敵方勢力盤根錯節難以撼動，必須認清現實避其鋒芒，另尋突破口或暫時保存實力。",
        "9": "你察覺外在強勢已達頂峰開始衰退，舊有格局即將轉變，應順應這股轉換之勢，準備迎接新局面的到來而非硬碰硬。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動期，各種力量尚未定型，此時應靈活調整策略，順應環境變化修正方向，避免固守既定計畫而錯失良機。",
        "7": "你看見外在趨勢正朝有利方向發展，天時地利皆順，應堅定維持當前的前進步調，持續推動既定目標，切勿因小波動而改弦更張。",
        "8": "你面對的外在環境已形成難以撼動的強大阻力，積重難返的局面需要你認清現實，暫時避開正面衝突，等待更好的時機再出手。",
        "9": "你察覺外在強勢力量已達頂峰開始轉弱，舊秩序即將變化，應順應這股轉變的趨勢，準備迎接新局面而非對抗即將到來的改變。"
      }
    }
  },
  "8": {
    "number": 8,
    "name": "比",
    "code": "000010",
    "卦解": "你現在處在一個需要依靠他人、尋求合作的階段。雖然自身條件稍顯不足，但周圍的環境和人際關係相對穩定，給你帶來一定的支撐力量。整體氛圍是溫和的，變化不會太劇烈，就像溪水緩緩流淌。你會發現，隨著時間推移，各種關係和連結會變得更加緊密，這些點點滴滴的累積，最終會為你帶來向前的動力。現在是個適合耐心等待、慢慢經營的時期。",
    "六階段": {
      "1": "你內心開始渴望找到歸屬感，像是剛搬到新環境的人，既期待又緊張地觀察周圍。你會主動釋出善意，試著與他人建立初步連結，但仍保持著謹慎的距離。這個階段充滿可能性，你的心情像春天般充滿希望，周圍的人也在評估彼此，大家都在尋找合適的夥伴。雖然關係還很表面，但這份互相試探的過程，正在為未來的深度合作奠定基礎。",
      "2": "你發現了與他人的共同語言和價值觀，內心感到踏實和興奮。就像找到知音般，你們開始分享更多想法，協作變得自然流暢。你會主動配合他人的節奏，也感受到對方的回應和支持。周圍的氛圍變得溫暖融洽，大家開始建立起默契，工作或生活中的配合度明顯提升。這種相互理解讓你感到被接納，也更願意投入時間和精力來維護這些珍貴的關係。",
      "3": "你開始面對合作中的現實挑戰，內心可能感到些許挫折和困惑。小小的意見分歧或習慣差異浮現，讓你需要花更多心力來溝通協調。你會發現理想與現實之間的落差，但這也是關係成熟的必經過程。周圍的氛圍可能偶有緊張，但大家都在學習如何處理分歧。你的耐心和包容度接受考驗，這個階段雖然辛苦，卻是建立真正信任的關鍵時刻。",
      "4": "外在環境開始形成穩定的合作框架，你感到工作或生活變得更有秩序。大家已經摸索出一套彼此都能接受的運作方式，不再需要事事討論協商。你會發現自己在這個體系中找到了合適的位置，既有安全感又能發揮所長。周圍的制度和規範逐漸完善，團隊效率明顯提升。你開始依賴這個環境帶來的支持，也更願意為共同目標貢獻自己的力量。",
      "5": "外在環境呈現出成熟穩定的合作狀態，你內心充滿信心和成就感。核心團隊的關係已經非常牢固，大家彼此信任，能夠處理更大的挑戰。你發現自己的影響力在擴大，能夠帶動更多人加入這個良性循環。周圍的人都能感受到這個群體的凝聚力和正能量，新的合作機會不斷湧現。你感到自己正處在一個理想的環境中，既有歸屬感又充滿發展潛力。",
      "6": "外在環境已經形成了相對固定的結構，你內心既有滿足感也有些許擔憂。這個體系運作得很好，但也變得較難接納新的變化或成員。你會發現維持現狀比追求擴張更重要，重心轉向深化既有關係的品質。周圍的氛圍趨於保守穩定，新鮮感可能不如從前，但安全感和可預期性大幅提升。你開始思考如何在穩定中保持活力，讓這個美好的合作關係能夠長久延續下去。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖，此時應主動檢視自己的不足，順應時勢調整學習方向，重新打造更扎實的根基。",
        "7": "你的基本功底正處於良好發展階段，應持續深耕專業能力，順應天地自然規律穩步前進，讓根基在正確方向上持續茁壯。",
        "8": "你長期累積的能力模式已難以適應現況，需要認清現實避免固執己見，暫時放下過往經驗，為重建基礎能力做好心理準備。",
        "9": "你的既有能力雖然深厚但已到轉換期，應順應時代變遷主動轉型，將過往根基作為養分，培育符合新局勢的核心競爭力。"
      },
      "2": {
        "6": "你的外在表現容易搖擺不定，此時應順應內心真實想法適時調整展現方式，不必強求一致性，靈活修正自己的形象更能贏得他人信任。",
        "7": "你展現出來的親和力正合時宜，這份真誠的外在表現順應了當下的人際趨勢，繼續保持這種開放包容的姿態，必能深化彼此的連結。",
        "8": "你長期養成的外在形象已經定型難改，與其勉強改變不如認清現實，避免做出與既有形象衝突的表現，專注發揮自己的既定優勢。",
        "9": "你過於強勢的外在表現已達極限，是時候順應變化展現更柔和的一面，放下控制欲讓others看見你溫和包容的另一面，關係將更加和諧。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，此時應順應內心的直覺調整發展方向，不要固執於原有計劃，靈活修正才能開創新的成長空間。",
        "7": "你的成長動能正順應天時地利，應該堅持既定的發展軌道持續前進，保持積極態度並維持當前的努力方向不懈怠。",
        "8": "你需要認清當前成長模式已經僵化的現實，與其勉強突破不如暫時避開，重新審視自己的能力基礎再做規劃會更明智。",
        "9": "你過往積累的成長優勢已達高峰開始轉折，應該順應這個轉變趨勢，適時收斂鋒芒並為下一階段的發展蓄積新能量。"
      },
      "4": {
        "6": "你觀察到外在環境正在微妙變化，這些變動雖然帶來不確定性，但也創造了調整合作策略的機會，及時修正方向能讓你在變局中保持優勢地位。",
        "7": "你發現外在條件正朝著有利方向發展，天時地利人和皆備，這是深化合作關係的絕佳時機，堅持既定路線並積極推進計畫將獲得豐碩成果。",
        "8": "你面對的外在環境已趨於固化，既有的不利因素短期內難以改變，與其強行突破不如暫時避開鋒芒，等待更合適的時機再重新布局。",
        "9": "你察覺外在優勢已達巔峰開始轉弱，過度依賴現有條件將面臨風險，主動順應環境轉變並提前調整合作模式，才能避免被動局面的出現。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，合作關係出現不穩定因素，此時應靈活調整策略，順應變化修正原有計畫，避免固執己見錯失良機。",
        "7": "你看見外在形勢朝著有利方向發展，各方合作意願增強，現在正是維持既定路線的好時機，持續推進既有的合作計畫會有豐碩成果。",
        "8": "你面對的外在環境已形成固化格局，既有的合作模式難以撼動，與其強求改變不如認清現實，暫時避開正面衝突尋找其他突破點。",
        "9": "你察覺外在強勢力量已達頂峰開始轉弱，原本的合作優勢正在消退，此時應順應這個轉變趨勢，準備迎接新的合作機會和模式。"
      },
      "6": {
        "6": "你觀察到外在環境正在醞釀變化，趨勢尚未明朗，此時應保持敏銳觀察力，隨時準備根據環境走向調整自己的策略和行動方針。",
        "7": "你看見外在趨勢正朝著有利方向發展，天時地利皆順，應該堅定信心持續前進，把握這波良好的環境動能推動計畫實現。",
        "8": "你面對的外在環境已形成強大阻力，舊有模式積重難返，必須認清現實狀況，避開正面衝突，尋找其他可行的發展路徑。",
        "9": "你察覺外在環境的強勢已達頂峰開始轉弱，舊秩序即將變遷，應順應這股轉變之勢，提前布局迎接新的環境格局到來。"
      }
    }
  },
  "9": {
    "number": 9,
    "name": "小畜",
    "code": "111011",
    "卦解": "你現在就像是積蓄能量的階段，內在的力量其實挺充足的，但外在環境還沒完全配合上你的節奏。感覺有點像是雲層正在聚集，但還沒到下雨的時候。你的步調跟周遭環境有些合拍，但不是完全同步，所以進展會比較緩慢穩定，不會有太大的突破或變化。整個氛圍是蓄勢待發的，你有足夠的實力和準備，只是時機還在醞釀中，一切都在慢慢累積當中。",
    "六階段": {
      "1": "你感受到內心深處某種不安的騷動，像是暴風雨前的寧靜。過往習以為常的生活節奏開始出現裂縫，你知道必須做出重要決定了。這種壓迫感讓你既緊張又興奮，因為你明白改變的時刻已經到來。周圍的人事物似乎都在等待你的表態，空氣中瀰漫著一種「山雨欲來風滿樓」的氛圍。",
      "2": "你開始看清楚前方的道路，原本混沌不明的選項逐漸變得具體可行。內心的焦慮轉為專注的思考，你一步步釐清每個環節該如何處理。身邊的阻礙開始鬆動，原本卡住的地方出現突破口。你感到踏實許多，因為終於可以具體規劃下一步，不再只是漫無目的地等待。",
      "3": "你遭遇一些意想不到的阻力，原本以為已經確定的事情又開始搖擺。這讓你感到挫折，但也激發了你的鬥志。你發現自己比想像中更有韌性，能夠在壓力下保持彈性。周遭的情況變化很快，就像拼圖被重新洗牌，你需要迅速調整策略來應對這些變化。",
      "4": "外在環境開始對你釋出善意，各種正面的訊號紛紛出現。你感到如釋重負，彷彿終於得到了宇宙的支持。之前那些限制你的條件逐漸鬆綁，你發現自己有了更多選擇和行動的自由。這種順風順水的感覺讓你充滿信心，準備大展身手。",
      "5": "你清楚地看見了目標的輪廓，內心的方向感前所未有地明確。周圍的人開始與你同頻共振，大家朝著相同的目標努力。你感到一種領導者的責任感，也享受著團隊合作的和諧氛圍。整個環境都在支持你的決定，讓你更加確信自己走在正確的道路上。",
      "6": "經過一番努力後，你感到一種平靜的滿足感。激烈的行動階段告一段落，現在需要的是耐心等待結果發酵。你的內心變得沉穩，不再急躁。周遭的環境也回歸穩定，像是風暴過後的寧靜。你知道這只是一個循環的結束，同時也是下一個開始的準備期。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚在變動中，此時應順勢調整學習方向，不要固執於既有技能，靈活修正才能建立更穩固的根基。",
        "7": "你的基本功底正朝良好方向發展，應持續精進核心技能，維持當前的學習節奏，讓根基在穩定中逐步深化。",
        "8": "你過往累積的基礎已顯僵化，需認清現實避免過度依賴舊有技能，重新審視自己的能力結構才能突破現況。",
        "9": "你的基礎能力已達高峰但開始轉變，應順應時代潮流調整專長重心，讓豐富經驗成為新發展的踏腳石。"
      },
      "2": {
        "6": "你目前的外在形象容易讓人產生誤解，不必過於堅持既有的表現方式，適時調整你展現給他人的面貌，更能獲得理解與支持。",
        "7": "你現在展現出來的樣子正合時宜，繼續保持這種穩健的外在表現，讓他人看見你的可靠與進取，這是你前進路上的最佳姿態。",
        "8": "你過往建立的外在形象已經固化，難以輕易改變他人對你的既定印象，與其勉強扭轉不如認清現實，暫時收斂鋒芒。",
        "9": "你一直以來強勢的外在表現已到了轉折點，是時候放下過於剛強的姿態，展現更柔和包容的一面，才能重新獲得人心。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，此時應順勢調整發展方向，不要固執於既定計劃，靈活修正策略才能把握住真正適合的成長機會。",
        "7": "你的成長動能正值上升趨勢，應該堅持當前的努力方向，持續投入學習與實踐，順應天地自然節奏來穩步提升自己的能力。",
        "8": "你過往的成長模式已經僵化，必須認清現實限制，避免繼續用舊方法強求突破，重新審視自己真正需要發展的核心能力。",
        "9": "你某些能力已達高峰開始轉折，應順應這個自然變化，將成熟的技能轉化為新的成長基礎，迎接下一個發展階段的到來。"
      },
      "4": {
        "6": "你需要敏銳觀察外在環境的細微變化，當發現不利因素時要及時調整策略，保持彈性應對，避免固執於原有計畫而錯失轉機。",
        "7": "你應該把握當前有利的外在條件，順應天時地利的大趨勢持續前進，堅持既定方向不動搖，讓自然的力量助你一臂之力。",
        "8": "你必須正視外在環境已經形成的不利局面，認清現實情況的嚴峻性，暫時避開正面衝突，等待更合適的時機再行動。",
        "9": "你要察覺外在環境的強勢已達頂峰即將轉變，順應這個自然的轉換過程，準備迎接新的局面，不要與即將消退的力量硬碰。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，雖然局勢尚未明朗，但這正是順勢調整策略的好時機，靈活應對比固守原計劃更能把握先機。",
        "7": "你看見外在大勢正朝有利方向發展，當前環境條件支持你的目標推進，應該堅持既定方向，順應天時地利繼續前行。",
        "8": "你面對的外在困境已經根深蒂固，現實環境的阻力超出個人能力所及，認清局限並暫時避開鋒芒，是明智的選擇。",
        "9": "你察覺外在強勢已到轉折點，過度的力量開始顯露疲態，順應這股轉變的趨勢，準備迎接新的環境格局。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動期，趨勢尚未明朗，此時應保持靈活態度，隨時準備根據新的市場信號或外部變化來調整你的策略方向。",
        "7": "你看見外在大勢正朝有利方向發展，天時地利皆順，這是持續推進既定計畫的好時機，保持現有節奏穩步前行即可收穫成果。",
        "8": "你面對的外在環境已形成固化格局，既有的不利趨勢難以扭轉，與其硬碰硬消耗資源，不如暫時避開主戰場，尋找其他突破口。",
        "9": "你察覺外在強勢已到頂峰開始轉折，舊有的主導力量將衰退，新的趨勢即將興起，順應這個轉換期的變化才能把握先機。"
      }
    }
  },
  "10": {
    "number": 10,
    "name": "履",
    "code": "110111",
    "卦解": "你現在處在一個相當不錯的狀態裡，整體條件偏向有利，就像走在一條還算平坦的路上。雖然內在可能還有些猶豫不定，但外在環境對你是比較友善的，給了你不少支撐。你會發現事情進展得不快不慢，沒有太大的起伏波動，一切都在穩定中緩慢推進著。這種感覺就像是在累積能量，每一步都在為後面更大的突破做準備，雖然當下看不出劇烈變化，但你能感受到一種踏實的進步感。",
    "六階段": {
      "1": "你的內在世界突然湧入一股全新的能量，像是沉靜的湖面投入石子般激起漣漪。這個陌生的動力讓你感到既興奮又不安，原本熟悉的內在節奏被打亂了。你開始質疑過往的信念與習慣，心中升起一種渴望改變的衝動。周遭的人可能還沒察覺你的變化，但你已經感受到內在根基的微妙鬆動，彷彿有什麼重要的東西正在重新組合。",
      "2": "你發現自己的表現方式開始出現新的可能性，像是找到了一條從未走過的小徑。內心充滿探索的好奇心，你願意嘗試不同的表達方式和行動模式。這種轉變讓你既興奮又謹慎，因為你知道這些新路徑可能隨時消失。身邊的朋友開始注意到你的不同，有些人投以好奇的眼光，有些人則保持觀望的態度。你感受到一種微妙的自由感。",
      "3": "你的潛能正在經歷快速的變化與調整，像是正在重新編程的電腦系統。每天都有新的想法和靈感湧現，讓你必須不斷地重新評估和修正原有的計畫。這個過程雖然充滿挑戰，但也讓你感到生命力的躍動。你發現自己能夠適應變化的能力比想像中更強，周圍的環境也開始回應你內在的轉變，提供更多成長的機會和資源。",
      "4": "你突然成為眾人關注的焦點，各種邀請和機會如潮水般湧來。這種密集的互動讓你既感到興奮又略顯疲憊，因為你需要在短時間內處理大量的溝通和交流。周圍的環境變得活躍而熱絡，每天都有新的人事物進入你的生活圈。雖然這些互動大多是友善的，但你也感受到一定的壓力，需要在保持真實自我與迎合他人期待之間找到平衡。",
      "5": "你發現自己在生活中的角色和地位正在重新洗牌，原本的主次關係開始調整。這個變化讓你重新思考什麼對你來說是最重要的，什麼可以退居次要地位。內心雖然有些不確定感，但也充滿了重新定義自己的期待。周圍的環境也在配合這個變化，給予你新的空間和責任。你感覺像是站在人生的十字路口，正在做出影響未來方向的重要選擇。",
      "6": "那股改變的浪潮漸漸平息，你開始整理這段時間的收穫。有些新的元素已經深深融入你的生活，成為你的一部分；有些則像退潮後的泡沫，自然地消散回歸平淡。你感到一種安定的滿足感，知道自己已經不是原來的那個人了。周圍的環境也回歸常態，但那些真正有價值的連結和機會依然存在。你帶著新的智慧和經驗，準備迎接下一個人生階段。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚不穩固，容易因外在變化而動搖，此時應主動檢視自己的不足，順應情勢調整學習方向，重新打造更堅實的根基。",
        "7": "你的基礎能力正值上升期，具備良好的成長動能，應該堅持當前的努力方向，持續精進專業技能，為未來發展奠定穩固基石。",
        "8": "你過去累積的基礎能力已顯僵化，難以適應新時代要求，應認清現實差距，避免固守舊有模式，重新審視核心競爭力的重建。",
        "9": "你的基礎能力雖然深厚但已接近轉換期，不宜過度依賴既有優勢，應順應時勢變化，主動融入新元素來更新你的知識結構。"
      },
      "2": {
        "6": "你在外人面前的表現容易搖擺不定，此時應該順應當下情況靈活調整自己的展現方式，不要固執己見，適時修正外在形象更能獲得他人認同。",
        "7": "你展現出來的樣子正合乎時勢所需，應該繼續保持這種外在表現，堅持當前的行為模式和處事風格，順天地之勢必能獲得更多支持與機會。",
        "8": "你長期以來的外在形象已經根深蒂固難以改變，與其勉強扭轉不如認清現實，暫時避免在公眾場合過度曝光，等待更合適的時機再行動。",
        "9": "你過往強勢的外在表現已達極限開始走下坡，應該順應這個轉變趨勢，主動收斂鋒芒，以更謙和低調的姿態與人互動，才能化解潛在衝突。"
      },
      "3": {
        "6": "你的成長潛力尚未穩固，容易因外在變化而動搖，此時應順勢調整學習方向，保持彈性思維，將變化視為探索自我能力邊界的機會。",
        "7": "你的成長軌跡正合天時地利，內在潛能正在穩步開發，應維持現有的努力方向持續前進，讓天賦與實力在正確道路上自然綻放。",
        "8": "你過往的成長模式已形成慣性包袱，難以突破既有框架，需認清現實局限，暫時避開強求突破，轉而鞏固基礎能力的深度。",
        "9": "你的某些能力已達顛峰狀態，繼續強推只會消耗能量，應順應自然轉變，將成熟技能轉化為培養新領域潛力的養分和基石。"
      },
      "4": {
        "6": "你面對的外在環境正在微妙變化，雖然目前條件不夠穩定，但這正是調整策略的好時機，順應環境的波動來修正你的行動方向。",
        "7": "你所處的外在環境呈現良好趨勢，各種條件都在朝有利方向發展，此時應該堅持既定路線，維持穩健前進的步調。",
        "8": "你面臨的外在環境已經形成不利格局，各種阻礙因素根深蒂固，現在需要認清現實，避開正面衝突，尋找其他出路。",
        "9": "你所依賴的外在優勢已達巔峰開始轉弱，環境正在發生根本性轉變，此時應該順應這個轉變趨勢，提前做好應對準備。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，此時應保持敏銳度，隨時準備調整策略，不要固執於原有計畫，靈活應對才能化解潛在風險。",
        "7": "你看見外在情勢正朝有利方向發展，這是天時地利的好時機，應該堅定信念繼續前行，把握當下優勢穩步推進目標。",
        "8": "你面對的外在環境已形成難以撼動的格局，與其硬碰硬徒耗心力，不如認清現實暫時迴避，另尋突破口或等待時機。",
        "9": "你察覺外在強勢已達頂點開始轉弱，此刻最需要順應這股轉變的趨勢，放下對抗心態，以柔克剛迎接新局面的到來。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，這些新趨勢雖然還不穩定，但正是調整策略的好時機，順應這些變化來修正你的方向。",
        "7": "你看見外在大勢正朝著有利方向發展，天時地利人和皆具備，保持現有路線穩步前進，這是順應天地自然趨勢的最佳時刻。",
        "8": "你面對的外在環境已經形成難以撼動的固化格局，與其硬碰硬消耗實力，不如認清現實選擇迴避，另尋突破口會更明智。",
        "9": "你察覺外在強勢已達頂峰開始轉弱，舊有的環境優勢即將消失，主動順應這個轉變趨勢，才能在新局面中保持優勢。"
      }
    }
  },
  "11": {
    "number": 11,
    "name": "泰",
    "code": "111000",
    "卦解": "你現在處在一個相當穩定的狀態中，就像站在平衡點上，既不會突然往上衝，也不會急速下滑。你的內在力量比外在環境來得充實，有種內心踏實但外表看起來波瀾不驚的感覺。周圍的事情進展得不快不慢，沒有什麼劇烈的變動，但你能感受到一些小小的正向累積正在發生。這種狀態讓人感到安心，像是暴風雨過後的寧靜，各種元素正在慢慢找到它們該有的位置。",
    "六階段": {
      "1": "你內在的能量正在強烈湧動，像是找到了人生的開關，一個接一個的機會自然浮現。你感到前所未有的清晰和動力，知道該往哪裡走，該做什麼決定。周圍的人開始注意到你的改變，原本看似困難的事情變得有跡可循。這種狀態讓你充滿信心，彷彿內在有股不可阻擋的力量在推動著你前進。",
      "2": "你的行動變得更加穩定有序，不再急躁冒進，而是以穩健的步調持續推進。內心感到踏實安定，知道自己走在正確的道路上。你發現做事的阻礙明顯減少，流程變得順暢，不再有太多意外的干擾。這種平穩的節奏讓你更有耐心，也讓周圍的人對你更有信任感，合作變得更加容易。",
      "3": "你感受到內在力量仍然強勁，各種資源和人脈開始主動向你聚攏。你的內心充滿建構的渴望，想要把事情做得更完整更完美。你發現自己的影響力在擴大，原本零散的元素開始形成一個有機的整體。這種聚合的感覺讓你既興奮又有責任感，知道自己正在建立一個更大的格局。",
      "4": "外在環境開始積極配合你的行動，原本需要費力協調的事情變得順手自然。你感到溝通變得容易，跨部門或跨領域的合作障礙被一一清除。周圍的人對你的想法更加開放，願意提供支持和協助。這種通暢的感覺讓你更有自信去嘗試更大的計畫，知道環境已經為你的成功做好了準備。",
      "5": "你在關鍵位置上發揮了穩定的作用，能夠清楚地安排優先順序和資源分配。內心感到從容不迫，既不會因為成功而得意忘形，也不會因為挑戰而慌張失措。整個環境呈現出有序而活躍的狀態，每個人都知道自己的角色和責任。這種和諧的氛圍讓你感到滿足，知道自己正在創造真正有價值的成果。",
      "6": "事情進入了收尾階段，你的重心轉向整理和交接工作。內心有種完成任務的平靜滿足，不再追求新的擴張，而是專注於鞏固既有的成果。外在環境也漸趨穩定，新的變化減少，大家都在為下一個階段做準備。你感到這個週期即將圓滿結束，心中已經在醞釀下一輪的可能性。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力雖有波動，但正是調整根基的好時機，順應當前情勢靈活修正自己的核心技能，將不穩定轉化為成長的動力。",
        "7": "你的根基扎實且符合時勢發展，應該堅持現有的能力建構方向，持續深耕基本功，讓穩固的底子成為未來躍升的基石。",
        "8": "你需要認清基礎能力的侷限性已然形成，與其勉強改變既有根基，不如避開需要全新技能的挑戰，善用現有底子求穩。",
        "9": "你的基礎能力已達巔峰但開始顯疲態，順應轉變的時機已到，主動讓出舞台或轉換跑道，為新的根基建立做準備。"
      },
      "2": {
        "6": "你的外在形象容易受到他人質疑，此時應該主動調整展現方式，放下固執的表達習慣，以更謙和的姿態與人互動，才能重新獲得信任。",
        "7": "你的外在表現正符合時勢所需，應該繼續保持現有的積極態度和專業形象，穩定地向前推進，讓別人看到你的可靠與能力。",
        "8": "你過去建立的形象已經僵化難改，與其強求改變外在印象，不如認清現實狀況，暫時收斂鋒芒，等待更好的時機再重新塑造。",
        "9": "你的強勢表現已達頂峰開始走下坡，應該主動軟化姿態，從高調轉為低調，順應環境變化調整自己的表達方式和行為風格。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該靈活調整發展方向，不要固執於既定計畫，順應環境變化來修正自己的能力提升路徑。",
        "7": "你具備良好的成長基礎和發展動能，應該堅持當前的努力方向，持續投入學習和自我提升，讓潛力在穩定中逐步展現。",
        "8": "你過去的習慣或思維模式已經限制了成長空間，需要認清現實並避開那些阻礙進步的因素，重新找尋突破的可能性。",
        "9": "你的某些優勢或強項已達顛峰狀態，應該順應轉變的時機，將重心轉向培養新的能力領域，為下一階段成長做準備。"
      },
      "4": {
        "6": "你觀察到外在環境出現微妙變化，這些波動正是調整策略的契機，順應這些變化修正你的方向，將能把握住環境轉換中的新機遇。",
        "7": "你看見外在條件正朝著有利方向發展，天時地利人和皆備，堅持既定路線持續前進，這股順勢將助你達成更大的成就目標。",
        "8": "你面對的外在環境已形成固化格局，強行突破只會徒勞無功，認清現實局限選擇迴避，保存實力等待更好的時機到來。",
        "9": "你感受到外在優勢已達頂峰開始轉弱，盛極而衰是自然規律，順應這個轉變趨勢調整策略，才能在變局中維持穩定。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變動雖然還不明顯，但已經開始影響整體局勢，你需要敏銳捕捉這些信號並及時調整策略。",
        "7": "你看見外在環境呈現穩定向上的發展趨勢，各種條件都在朝有利方向演進，你應該把握這個良好時機，堅定地推進既定計畫。",
        "8": "你面對的外在環境已經形成固化的不利格局，各種阻礙根深蒂固難以撼動，你必須承認現實限制，避免硬碰硬的無謂消耗。",
        "9": "你所處的外在環境已達到繁榮的頂峰，但盛極必衰的轉折點正在來臨，你要準備好迎接即將到來的變化，順應新的發展方向。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，這些新興趨勢雖然還不明朗，但值得你保持敏銳嗅覺，適時調整策略方向以順應即將到來的轉變。",
        "7": "你看見外在大勢正朝著有利方向發展，天時地利人和皆備，這是你堅持既定路線、持續推進計畫的最佳時機，順勢而為必有所成。",
        "8": "你面對的外在環境已形成難以撼動的固化格局，與其硬碰硬徒耗心力，不如認清現實限制，暫時迴避正面衝突，另尋突破契機。",
        "9": "你察覺外在盛勢已達頂峰開始轉向，舊有的成功模式即將失效，你需要順應這個轉變週期，提前佈局為下一個階段做好準備。"
      }
    }
  },
  "12": {
    "number": 12,
    "name": "否",
    "code": "000111",
    "卦解": "你現在處在一個有點尷尬的狀態，就像被困在一個進退兩難的局面裡。內心感到有些空虛或力不從心，但外在環境卻有不少壓力和阻力在推擠著你。整體來說，事情沒有明顯的好轉，也沒有急劇惡化，就是那種悶悶的、卡住的感覺。你可能會發現很多事情都在原地打轉，想要突破卻找不到出口，各種力量相互抵消，讓你感到既焦躁又無奈。",
    "六階段": {
      "1": "你現在感覺像是被困在起跑線上，明明準備充足卻遲遲無法開始行動。內心充滿焦慮和不安，看著別人似乎都在前進，自己卻只能原地等待。周圍的環境就像一道厚牆，把你和機會隔開。這種被動的狀態讓你感到挫折，但這其實是在為後續的突破積蓄能量。",
      "2": "你開始察覺到一些微妙的變化，偶爾會有小小的進展讓你振奮不已。雖然步調依然緩慢，但內心燃起希望的火苗。環境中出現了一些可以利用的小縫隙，讓你能夠稍微往前推進。這些小勝利雖然不起眼，卻給了你繼續堅持下去的動力和信心。",
      "3": "你發現事情變得更加複雜，剛有的進展又被拉回原點，內心開始產生疲憊感。就像在拔河一樣，你用力向前，阻力卻把你往後拖。環境變得更加不穩定，讓你感到困惑和無力。這種反覆的拉鋸讓你開始懷疑自己的判斷，但也讓你更加堅韌。",
      "4": "你意識到外界的回應變得遲鈍，合作夥伴或相關人員似乎都在觀望。內心感到孤立無援，溝通變得困難重重。環境就像一個狹窄的通道，每個人都在爭搶有限的資源和機會。你需要更多的耐心來處理這些外在的阻礙，學會在擁擠中找到自己的位置。",
      "5": "儘管外在環境依然嚴峻，你內心保持著基本的穩定和方向感。雖然進展緩慢，但你沒有迷失目標，仍能維持基本的運作。環境雖然不友善，卻也沒有完全崩潰，給了你一個相對安全的空間。你學會了在困境中保持冷靜，這是一種珍貴的能力。",
      "6": "你感覺到這個困頓的階段即將結束，內心開始為新的可能性做準備。雖然當下的選擇有限，但你已經學會了耐心等待。環境正在悄悄地發生變化，新的機會即將到來。你專注於把手邊的事情做完整，靜靜地等待時機的轉換，心中充滿對未來的期待。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力雖有不足，但正是調整的好時機，順勢檢視自己的根基問題，主動修正學習方向，將變化轉為成長契機。",
        "7": "你的底子紮實且方向正確，此時應維持既定的學習步調，持續深耕基礎能力，順應天地趨勢穩健前進。",
        "8": "你必須認清基礎能力已積弱難振的現實，與其勉強硬撐，不如暫時避開需要強基礎的挑戰，另尋出路。",
        "9": "你過度依賴既有的基礎能力已到極限，應順應時勢轉變，主動放下舊有的根基模式，為新的發展做準備。"
      },
      "2": {
        "6": "你目前的外在表現容易招致他人誤解，應該及時調整自己的言行舉止，讓外界看到你更真實穩重的一面，避免因形象不佳而錯失機會。",
        "7": "你展現出來的正面形象正在發揮作用，繼續保持目前的專業態度和積極表現，讓外界持續看到你的能力與誠意，時機將會轉向有利。",
        "8": "你長期累積的負面形象已經根深蒂固，現在急於改變反而會顯得做作，不如暫時保持低調，用實際行動慢慢重建他人對你的信任。",
        "9": "你過度強勢的外在表現已經到了極限，是時候展現更柔軟謙遜的態度，順應當下環境的變化，讓他人感受到你的包容與彈性。"
      },
      "3": {
        "6": "你的成長潛力正處於轉換期，內心的不安定反而是突破的契機，主動調整學習方向和能力發展重點，將為未來開創新的可能性。",
        "7": "你具備穩健的成長動能，持續在既定的能力提升路徑上前進，順應天時地利的發展趨勢，將逐步累積出紮實的競爭優勢。",
        "8": "你需要正視自己在成長上的固化模式已成包袱，與其強行突破不如先避開舊有框架，重新審視什麼才是真正值得培養的能力。",
        "9": "你過往的成長策略已達極限，主動順應環境變化調整發展方向，將舊有的強項轉化為新領域的基礎，開啟下一階段的蛻變。"
      },
      "4": {
        "6": "你察覺到外在環境出現鬆動跡象，這是調整策略的良機。靈活修正你的方向，順應這些微妙變化，為即將到來的轉機做好準備。",
        "7": "你發現外在條件正朝著有利方向發展，天時地利逐漸匯聚。堅持你的既定方針，持續推進計劃，順應這股正向的環境趨勢。",
        "8": "你面對的外在阻礙已經根深蒂固，短期內難有根本改變。認清這個嚴峻現實，暫時避開正面衝突，保存實力等待時機。",
        "9": "你觀察到阻塞的外在環境已達極限，轉變的契機正在醞釀。順應這個即將到來的大轉折，準備迎接環境的全面改善。"
      },
      "5": {
        "6": "你觀察到外在環境出現微妙變化，這些不穩定的訊號正是轉機的前兆，順應這些變動調整你的策略，靈活應對將為你帶來突破契機。",
        "7": "你看見外在大勢正朝有利方向發展，天時地利漸趨明朗，堅持既定方向繼續前進，順應這股正向趨勢將助你渡過困頓局面。",
        "8": "你面對的外在困局已根深蒂固難以撼動，認清現實環境的限制與阻礙，暫時避開正面衝突，保存實力等待更好的時機到來。",
        "9": "你察覺外在阻力已達極點開始鬆動，舊有的困頓格局即將轉變，順應這股即將來臨的轉換力量，準備迎接新局面的展開。"
      },
      "6": {
        "6": "你觀察到外在環境的阻塞狀況正在鬆動，雖然變化初現但仍不穩定，此時應順應這股轉機的趨勢，適時調整自己的策略和步調。",
        "7": "你看見天地運行的規律正朝向否極泰來的方向發展，外在趨勢明確向好，你應該堅持正道，維持積極前進的態度迎接轉機。",
        "8": "你面對的是長期累積的阻塞局面，外在環境的頑固阻力已成定勢，你需要認清這個現實，暫時避開正面衝突，等待時機。",
        "9": "你察覺到阻塞的力量已達頂峰開始衰退，外在環境即將出現根本性的轉變，你應該順應這個必然的變化，準備迎接新局面。"
      }
    }
  },
  "13": {
    "number": 13,
    "name": "同人",
    "code": "101111",
    "卦解": "你現在處在一個蠻有力量的狀態裡，內在雖然還在整理，但外在的表現和影響力都挺強的。不過你會發現很多事情推動起來有點卡卡的，像是齒輪還沒完全咬合，節奏時快時慢。你身邊的人際網絡和合作關係正在慢慢建立連結，雖然目前變化不大，但能感受到一股潛在的能量正在累積。整體氛圍就像是暴風雨前的寧靜，表面平穩但底下暗潮洶湧。",
    "六階段": {
      "1": "你內心對某個理念或目標有著強烈的認同感，開始主動尋找志同道合的人。這種渴望連結的衝動來自你最深層的價值觀，讓你願意踏出舒適圈去接觸陌生人。周圍開始出現一些微弱的回應，可能是網路上的留言、朋友的介紹，或是偶然的相遇，這些小小的火花讓你感到興奮和期待。",
      "2": "你發現自己在團體中找到了位置，開始展現出協調和配合的能力。內心感到一種歸屬感，不再是孤軍奮戰的感覺。你學會傾聽別人的想法，也能清楚表達自己的觀點。周圍的氣氛變得和諧而有序，大家開始建立起基本的互動模式，工作分配逐漸明確，每個人都能貢獻自己的專長。",
      "3": "你意識到自己具有化解衝突和整合差異的潛能，即使面對團體內的分歧也不會退縮。內心雖然有些緊張，但更多的是躍躍欲試的挑戰感。你開始學會在堅持原則和妥協之間找平衡。外在環境出現一些雜音和摩擦，不同意見開始浮現，但這些挑戰反而讓團體的邊界更加清晰。",
      "4": "你周圍的環境條件開始變得有利，各種資源和機會紛紛出現。不同的圈子開始產生連結，你發現原本分散的力量可以整合運用。人際網絡快速擴展，合作的可能性大幅增加。這個階段的外在條件非常活躍，各種跨界合作的機會不斷湧現，讓你感受到集體力量的強大威力。",
      "5": "環境中出現了強而有力的領導核心或共同目標，讓所有人都能朝著同一個方向前進。你感受到一種前所未有的團結力量，每個人都清楚自己的角色和責任。周圍的氛圍充滿效率和活力，各項計劃都能順利推進，成果明顯可見。這種集體行動的威力讓你深深震撼，也更加堅定了合作的信念。",
      "6": "外在環境趨於穩定成熟，快速擴張的階段已經過去，重心轉向維持和深化既有的關係。你感受到一種深層的滿足感，不再急於追求新的突破，而是珍惜已經建立的連結。周圍的氛圍變得沉穩而持久，大家更注重長期的承諾和可持續的合作模式。這是一個收穫和鞏固成果的時期。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚在變動中，此時應順應情勢調整自己的根基，不要固執於既有做法，靈活修正才能為未來的合作奠定穩固基石。",
        "7": "你的根基扎實且方向正確，應該堅持當前的能力建設路線，持續精進基本功，這些累積將成為與他人協作的最佳後盾。",
        "8": "你的基礎能力已形成固化模式難以改變，應認清現實不強求突破，專注發揮既有優勢，避免在根本弱項上浪費精力。",
        "9": "你的基礎能力已達頂峰開始轉弱，應順應這個轉變主動調整定位，將過往累積的經驗智慧轉化為指導他人的新價值。"
      },
      "2": {
        "6": "你在人際交往中展現的態度容易搖擺不定，此時應順應內心真實想法，適時調整自己的表達方式和社交姿態，讓外在形象更貼近內在本質。",
        "7": "你當前展現出的合群態度正合時宜，應持續保持這種開放包容的外在形象，順應團體和諧的大勢，讓自己成為連結他人的正面力量。",
        "8": "你長期形成的社交模式已顯僵化，難以真正融入團體，應認清自身在人際關係中的局限性，避免勉強迎合他人而失去真我。",
        "9": "你過度熱切的合群表現已達臨界點，應順應情勢轉變，適度收斂外在的積極姿態，讓人際關係回歸更自然平衡的狀態。"
      },
      "3": {
        "6": "你的成長潛力正在波動中，此時應順應內心的變化調整方向，不必堅持原有的合作模式，靈活修正能開啟新的發展空間。",
        "7": "你具備穩定向上的成長動能，應持續在團隊協作中發揮所長，保持現有的努力方向，時間會證明你的價值與潛力。",
        "8": "你需要認清當前成長受限的現實，避免在不適合的團隊關係中消耗能量，先退一步重新審視自己的定位與方向。",
        "9": "你過往的成長模式已達極限，應順應時勢轉變發展策略，放下舊有的合作框架，為下一階段的突破做好準備。"
      },
      "4": {
        "6": "你觀察到外在環境變化頻繁，合作夥伴態度搖擺不定，此時應順應這種不穩定性，靈活調整你的合作策略和期望值。",
        "7": "你發現外在條件正朝有利方向發展，眾人響應趨勢明確，應堅定維持現有的合作路線，持續推進團結大業。",
        "8": "你面對的外在阻力已根深蒂固，既有的對立格局難以撼動，應認清現實避開正面衝突，另尋合作突破口。",
        "9": "你察覺外在的強勢力量已達頂點開始轉弱，應順應這個轉變契機，重新整合資源建立新的合作關係。"
      },
      "5": {
        "6": "你觀察到外在環境中的合作關係出現微妙變化，人心浮動不安。此時應保持彈性，隨時準備調整策略，不要固執於原有的團隊配置。",
        "7": "你看見外在局勢正朝著有利於團結合作的方向發展，各方力量趨於和諧。繼續維持現有的合作模式，堅定地推進既定的共同目標。",
        "8": "你面對的外在環境已形成根深蒂固的對立格局，各方立場僵化難以調和。認清現實，暫時避開正面衝突，等待更好的時機再談合作。",
        "9": "你察覺外在的強勢聯盟已達頂峰開始鬆動，過度的團結反而產生內部矛盾。順應這個轉變趨勢，準備迎接新的合作格局重新洗牌。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動期，團體合作的氛圍尚未穩定，此時應保持彈性，隨時準備調整你的合作策略與人際關係定位。",
        "7": "你看見外在趨勢正朝向更廣泛的團結合作發展，這股潮流符合天地運行規律，你應堅持推動同心協力的理念，持續前進不懈。",
        "8": "你發現外在環境中的分裂對立已根深蒂固，強求團結只會徒勞無功，你需認清這個現實，暫時避開強推合作的行動。",
        "9": "你察覺外在的合作熱潮已達頂峰開始轉弱，過度的團結可能走向僵化，你應順應這個轉變，適度保持獨立思考的空間。"
      }
    }
  },
  "14": {
    "number": 14,
    "name": "大有",
    "code": "111101",
    "卦解": "你現在處在一個相當不錯的狀態，像是擁有豐厚資源的富足時光。你的內在力量比外在表現更強勁，就像是一個蓄積了能量但還沒完全展現的狀態。整體來說你的步調穩定，沒有太大的起伏波動，反而有種從容自在的感覺。雖然短期內不會有太劇烈的變化，但你能感受到各方面的條件正在慢慢串聯起來，有種蓄勢待發的氛圍，好像正在為更大的突破做準備。",
    "六階段": {
      "1": "你開始感受到各種機會和資源向你聚攏，就像原本平靜的池塘突然有了漣漪。內心既興奮又有點忙亂，因為需要處理的事情一下子多了起來。周圍的人開始注意到你，討論聲變多了，整個氛圍也跟著熱絡起來。雖然還在摸索階段，但你能明顯感覺到，某種轉變正在發生。",
      "2": "你逐漸找到了節奏，各方面的表現趨於穩定。內心踏實了許多，因為你發現自己真的有能力承接這些新的挑戰。工作效率明顯提升，團隊配合也越來越默契。外界對你的期待更加明確，你不再是那個需要別人協助的角色，而是能夠獨當一面，甚至帶領others向前的人。",
      "3": "你的潛能開始全面展現，各種想法和創意源源不絕地湧現。內心充滿創造力，有時甚至覺得自己快跟不上腦中的靈感。產出質量時好時壞，但整體數量明顯增加。周圍的環境變得更加多元，各種聲音和機會同時出現，你需要在這個豐富但略顯混亂的狀態中找到自己的方向。",
      "4": "外界開始真正認可你的實力，更大的合作機會主動找上門來。你內心感到振奮，但也意識到責任更重了。各種渠道為你打開，資源流動變得更加順暢，你發現自己能夠承接的項目規模比以前大了很多。環境對你越來越友善，仿佛有一股推力在背後支持著你前進。",
      "5": "你成為了眾人�矚目的焦點，需要統籌協調的事情很多。內心既有成就感，也感受到領導者的孤獨。你的名聲為你帶來了更多合作夥伴，工作效率因為團隊擴大而倍增。外在環境圍繞著你運轉，你的決定影響著很多人，這種中心位置讓你既有權力感，也承擔著相應的壓力。",
      "6": "你迎來了階段性的豐收時刻，重點從持續輸出轉向成果分配。內心滿足但也有些疲憊，開始思考如何讓這個成功模式更加穩固。外界環境趨於穩定，各種利益需要妥善安排，你發現自己正在建立一個可以長久運作的體系。整個局面正朝著制度化、規範化的方向發展。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力雖有不足，但正是調整的好時機。主動檢視自己的根基，找出薄弱環節並加以修補，這樣的順勢調整將為未來的豐收奠定更穩固的基石。",
        "7": "你的基礎能力正處於上升趨勢，應該持續投入心力強化根基。保持現有的學習節奏和努力方向，這份踏實的積累正是大有卦所需的根本力量。",
        "8": "你的基礎能力已經固化難以改變，與其勉強突破不如認清現實。將注意力轉向發揮既有優勢，在熟悉的領域中尋求大有的機會，避免無謂的根基重建。",
        "9": "你的基礎能力已達頂峰開始轉換，應該順應這個變化趨勢。主動將深厚的根基轉化為新的能力形式，讓過往的積累在新的方向上繼續發揮價值。"
      },
      "2": {
        "6": "你目前的外在形象還不夠穩定，容易給人搖擺不定的印象，應該根據環境變化適時調整自己的表現方式，讓別人看到你的彈性與適應力。",
        "7": "你展現出來的樣子正符合時勢所需，這種積極向上的外在形象能夠吸引更多機會，繼續保持這種狀態並穩步向前發展。",
        "8": "你長期積累的負面形象已經根深蒂固，很難在短時間內改變他人印象，不如暫時避開需要依賴形象的場合，等待時機成熟。",
        "9": "你過度強勢的外在表現已經到了極限，開始引起他人反感，是時候收斂鋒芒，以更謙和的姿態面對眾人，順應情勢變化。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該靈活調整發展方向，不要固執於原有計畫，順應時勢修正你的能力培養重點，這樣才能找到真正適合的成長道路。",
        "7": "你的成長勢頭正佳，應該持續在現有軌道上精進，堅定地投入時間和精力提升核心能力，保持這股向上的動能，未來必能有所大成。",
        "8": "你在某些方面已經形成固化思維，應該認清這些限制並主動避開，重新尋找其他領域的成長機會，不要在沒有潛力的地方繼續消耗精力。",
        "9": "你在某個領域已達高峰但後繼乏力，應該順應自然規律轉向新的成長方向，將過往經驗作為基礎，開拓不同領域的發展可能性。"
      },
      "4": {
        "6": "你當前面臨的外在環境變化莫測，市場或競爭態勢尚未明朗，此時應保持彈性思維，隨時準備調整策略方向，避免過度承諾或大幅投資。",
        "7": "你所處的外在環境正值有利時機，各方條件都在朝正面發展，應當把握這股順勢而為的機會，堅定地推進既定計畫，不要輕易改變方向。",
        "8": "你面對的外在環境已形成不利的固化格局，既有的阻礙因素根深蒂固難以撼動，應當務實地重新評估現況，暫時避開正面衝突尋找其他出路。",
        "9": "你眼前的有利外在條件已達到頂峰開始轉折，原本的優勢正在逐漸消退，應當順應這個自然轉變，提前為下一階段的挑戰做好準備。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，原本穩固的優勢地位出現鬆動跡象，此時應當靈活調整策略，順應這些變化趨勢，避免固守既有做法。",
        "7": "你看見外在形勢正朝著有利方向發展，各種資源和機會都在向你聚集，現在正是保持既定方針，穩步前進擴大成果的絕佳時機。",
        "8": "你面對的外在環境已經過度飽和，各種問題積累深重且難以根本改變，明智的做法是認清現實，避開這個領域尋找新的發展空間。",
        "9": "你察覺外在的繁榮盛況已達頂峰，開始出現由盛轉衰的徵兆，應當順應這個自然轉換，提前做好收斂和轉型的準備工作。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，趨勢尚未明朗，此時應保持敏銳觸覺，隨時準備調整策略方向，避免固守既有模式而錯失轉機。",
        "7": "你看見大環境正朝著有利方向發展，天時地利皆順，應該堅持既定路線持續前進，把握這波順勢而為的黃金時機。",
        "8": "你面對的外在趨勢已形成強大阻力，舊有格局根深蒂固難以撼動，應該認清現實選擇迴避，尋找其他突破點或時機。",
        "9": "你察覺盛極而衰的轉折點即將到來，外在環境的繁榮已達頂峰，應該順應自然規律準備轉型，避免逆勢而行的風險。"
      }
    }
  },
  "15": {
    "number": 15,
    "name": "謙",
    "code": "001000",
    "卦解": "你現在處在一種內斂而踏實的狀態中。雖然外在條件看起來不算特別強勢，但你的內在力量其實比表面顯現的更加充實。整個節奏感覺相當平穩，沒有太大的起伏波動，就像是在一條平緩的河流上緩緩前行。\n\n你會發現周圍的環境變化不大，一切都在可預期的範圍內慢慢發展。雖然進展的速度不算快，但每一步都很扎實，就像是在為更長遠的目標默默積蓄能量。這種狀態讓人感覺安穩，沒有急迫感，卻有種深層的充實感在心中慢慢醞釀著。",
    "六階段": {
      "1": "你正處在打基礎的階段，選擇默默耕耘而不急於展現。內心很清楚自己的不足，但也明白唯有踏實準備才能走得長遠。周圍的人可能還沒注意到你在做什麼，這反而給了你安靜成長的空間。你用謙遜的態度面對每個學習機會，把每個細節都做好，雖然進展看似緩慢，但根基正在悄悄變得更加穩固。",
      "2": "你的努力開始有了小小的成果，身邊的人漸漸看見你的能力。內心感到一絲欣慰，但你依然保持著謙虛的本色，不因為這些小成就而驕傲。環境對你越來越友善，機會也慢慢增加。你懂得在展現實力與保持低調之間找到平衡，這種穩健的表現讓周圍的人對你更有信心，也為接下來的發展奠定良好基礎。",
      "3": "面對複雜的局面，你選擇迂迴而非硬闖。內心很平和，知道有些時候繞遠路反而是最聰明的選擇。環境中雖然有些競爭和衝突，但你巧妙地避開了這些風波。你用柔軟的方式處理難題，雖然速度不快，卻能保持內心的寧靜。這種智慧的處事方式讓你在混亂中保持清醒，也減少了不必要的摩擦和阻力。",
      "4": "你與外界的互動變得更加和諧自然。內心感到輕鬆，因為你學會了在人際關係中保持適當的距離，既不過於疏遠也不會過度親密。周圍的環境變得更加友善，人們願意與你合作，也尊重你的想法。你用溫和的態度處理各種關係，給彼此都留下了舒適的空間，這種自然流暢的互動模式讓一切都變得更加順利。",
      "5": "你在團隊或群體中扮演著安靜但重要的角色。內心充滿了穩定感，知道自己的價值不需要大聲宣揚。環境對你非常信任，重要的決定往往會徵求你的意見。你用低調但堅定的方式提供支持和指導，這種不爭不搶的領導風格反而讓你獲得了更多的影響力。周圍的人都願意聽你的建議，因為他們知道你的出發點總是為大家好。",
      "6": "這個階段即將結束，你回到了最初的平常心。內心感到深深的滿足，不是因為獲得了什麼轟轟烈烈的成就，而是因為你保持了自己的本色。環境也變得更加平靜，各種關係都找到了最舒適的狀態。你沉澱著這段時間的經驗，發現自己的底盤比以前更穩了。這種樸實無華的結束方式，其實是為下一個開始做最好的準備。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖，此時應謙虛學習，順應環境調整自己的根基，將不穩定轉化為成長的動力。",
        "7": "你的基本功扎實且符合時代趨勢，應該謙遜地持續精進這些核心能力，保持學習的初心，讓穩固的根基成為長遠發展的基石。",
        "8": "你過於依賴舊有的技能模式，已難以適應新時代要求，應謙卑地認清現實差距，避免固守過時的基礎能力，重新審視自己的根基。",
        "9": "你的既有能力已達巔峰但開始顯露疲態，應謙遜地順應時代轉變，將豐富的經驗智慧轉化為指導後進的新價值，開創第二春。"
      },
      "2": {
        "6": "你在外表現出的謙遜態度還不夠穩定，容易因環境變化而搖擺不定，此時應該順勢調整自己的表達方式，讓謙虛成為你更自然的展現。",
        "7": "你展現出來的謙遜正合天地之道，這種內斂而不失自信的外在表現深得人心，你應該保持這種狀態，繼續以謙虛的姿態前進。",
        "8": "你過度的自我貶低已經形成習慣，這種過分謙卑的外在表現反而失去了真誠，你需要認清現實，避免過度謙遜而讓人覺得虛假。",
        "9": "你長期維持的謙虛形象已到轉變關頭，強硬地保持過去的表現方式只會顯得造作，你應該順應時勢，讓謙遜以更自然的方式呈現。"
      },
      "3": {
        "6": "你的成長潛力正處於變化階段，保持謙遜心態，隨時調整學習方向和方法，不要固執於舊有模式，靈活修正才能發揮真正實力。",
        "7": "你的成長軌道正順應天時，繼續以謙卑態度精進自己，持續在既定方向上努力，這股向上提升的動能將為你帶來長遠發展。",
        "8": "你需要認清當前成長受到的限制，不要急於求成或好高騖遠，先避開不必要的競爭，重新審視自己的能力基礎再做突破。",
        "9": "你過往的成長模式已到瓶頸，順應內心的轉變需求，謙遜地向他人學習新的思維方式，才能開啟下一階段的成長契機。"
      },
      "4": {
        "6": "你面對的外在環境正在微妙變化，保持謙遜態度密切觀察市場動向，適時調整策略以配合環境轉變，靈活應變才能把握機會。",
        "7": "你所處的外在條件正順應大勢發展，以謙卑之心持續推進既定方向，環境利好支持你的前進步伐，堅持正道必有所成。",
        "8": "你面臨的外在環境已形成固化格局難以撼動，謙遜接受現實限制，暫時避開正面衝突，等待更有利的時機再行動。",
        "9": "你觀察到外在強勢環境已達巔峰將現轉機，以謙遜姿態順應即將到來的變化，主動配合新趨勢的形成和發展方向。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，謙遜的態度讓你能敏銳察覺這些轉機，順應這些變化調整自己的策略，將為你帶來意想不到的收穫。",
        "7": "你所處的外在環境正值穩定上升期，保持謙卑不爭的姿態繼續前行，順應天地自然趨勢，你的影響力將在不知不覺中持續擴大。",
        "8": "你面對的外在局勢已形成固化格局難以撼動，認清現實保持謙退姿態是明智之舉，避開正面衝突等待時機自然轉換更為安全。",
        "9": "你看到外在強勢力量已達頂峰開始衰退，以謙遜包容的心態順應這個大轉變，反而能在新舊交替中找到自己的最佳位置。"
      },
      "6": {
        "6": "你觀察到外在環境正在醞釀變化，雖然趨勢尚未明朗，但要保持謙遜心態，隨時準備調整策略以順應即將到來的轉變。",
        "7": "你看見外在大勢正朝著有利方向發展，此時要維持謙虛低調的姿態，順應天地自然趨勢，持續穩健前進不躁進。",
        "8": "你面對的外在環境已形成難以撼動的格局，要認清現實力量的差距，以謙卑態度避開正面衝突，另尋發展空間。",
        "9": "你察覺外在強勢力量已達頂峰開始轉弱，要以謙遜智慧順應這個轉變時機，不與衰退勢力硬碰，靜待新局面。"
      }
    }
  },
  "16": {
    "number": 16,
    "name": "豫",
    "code": "000100",
    "卦解": "你現在處在一種微妙的狀態裡，整體能量不算強勁，做什麼事都感覺有點使不上力。雖然表面上看起來還算順遂，但內心深處總覺得缺少什麼動力，像是被一層薄霧籠罩著，看得見前方卻走得有些吃力。\n\n你會發現很多事情都卡在半路上，進展緩慢，需要更多時間來醞釀。外在環境對你還算友善，但你自己的步調似乎還沒完全調整好，有種想動卻動不起來的感覺。這是個需要耐心的時期，變化正在暗中進行。",
    "六階段": {
      "1": "你內心開始有股暖流湧動，像是沉睡已久的種子感受到春天的召喚。過去那些模糊的想法和計畫，現在開始有了具體的輪廓，你發現自己不自覺地在心中描繪著美好的藍圖。周圍的氛圍也漸漸變得積極，彷彿有一股無形的力量在匯聚。你的眼神變得明亮，步伐也輕快了些，內心深處那個「想要行動」的聲音越來越清晰。",
      "2": "你開始展現出更穩定、更有條理的一面，就像樂團在正式演出前的總彩排，每個細節都漸趨完美。你說話時帶著自信，做事時節奏明快，身邊的人也被你的這種從容感染。你發現自己能夠更好地掌控局面，內心那種「一切都在掌握中」的踏實感讓你格外安心。這份穩定的表現讓你在人群中散發出一種可靠的魅力。",
      "3": "你的情緒時而高漲時而平靜，像海浪般起伏不定，但整體方向依然堅定向前。有時你會感到興奮得想要立刻衝刺，有時又會冷靜下來重新審視。這種內在的波動並不讓你困擾，反而讓你更清楚自己的潛能有多大。你意識到自己擁有很強的適應力和調節能力，即使面對變化也能保持初心不變，朝著目標穩步前進。",
      "4": "外界突然變得熱鬧起來，各種機會和邀請接踵而至，你的行程表開始變得密密麻麻。周圍的人都很活躍，大家似乎都在為某些共同的目標而忙碌著。你發現自己被捲入了一個更大的浪潮中，參與度不斷提升。環境的變化讓你感到既興奮又忙碌，每天都有新的挑戰和機遇在等著你，生活的節奏明顯加快了。",
      "5": "你站在了一個關鍵的位置上，能夠統籌全局並協調各方資源。周圍的人都對你充滿信心，大家的士氣高漲，重要的計畫和安排正在一一落實。你感受到一種前所未有的影響力，彷彿自己就是這個團隊的核心引擎。環境完全配合你的節奏，所有的條件都已經成熟，你內心充滿了成就感和使命感，知道這是展現實力的最佳時機。",
      "6": "經過一番高峰期的忙碌，你開始感受到熱度逐漸回歸常態。你開始整理這段時間的收穫，檢視哪些目標已經達成，哪些還需要繼續努力。內心雖然有些疲憊，但更多的是滿足感。你開始為下一個階段做準備，預告新的計畫和目標。周圍的環境也趨於平靜，大家都在為即將到來的新挑戰蓄積力量，等待下一個機遇的到來。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚在變動中，容易因外界影響而動搖，此時應謙虛學習、靈活調整自己的根基，避免固執己見而錯失成長機會。",
        "7": "你的根基紮實且符合時勢發展，應該堅持既定方向持續精進，保持這份基礎實力的穩定成長，不輕易改變核心能力的培養路線。",
        "8": "你的基礎能力已形成固定模式，若與現實需求落差太大應勇於承認，重新評估自己的根基是否適合當前環境，避免硬撐。",
        "9": "你過往累積的基礎能力雖然豐富，但已到需要轉化的時候，應順應時代變遷調整自己的根基，讓經驗智慧以新形式發揮作用。"
      },
      "2": {
        "6": "你的外在表現容易搖擺不定，此時應順勢調整展現方式，不必堅持固定形象，靈活修正自己在他人面前的態度和行為。",
        "7": "你展現出的積極態度正合天時，應維持這種自信而有準備的外在形象，繼續以正面姿態面對眾人，保持前進動力。",
        "8": "你過度僵化的外在表現已難以改變，應認清這個現實，避免強行扭轉形象，接受他人對你既有的認知和期待。",
        "9": "你過於強勢的外在表現已達極限，應順應時勢轉變，放下強硬姿態，以更柔和謙遜的方式與他人互動交流。"
      },
      "3": {
        "6": "你的成長潛力正處於變化期，要靈活調整學習方向和發展策略，不要固守舊有模式，順應內在變化找到最適合的成長路徑。",
        "7": "你的成長動能正值上升期，應該持續投入努力強化核心能力，順應天時地利的大趨勢，穩步推進個人發展計畫不偏離正道。",
        "8": "你過往的成長模式已經僵化，要認清現實避免重複無效的努力，暫時停下來重新審視自己的發展瓶頸，尋找突破契機。",
        "9": "你的某些能力已達高峰難以再進，要順應自然轉變的規律，將重心轉向培養其他潛能，讓成長動力獲得新的延續空間。"
      },
      "4": {
        "6": "你面對的外在環境正在微妙變化，當前的有利條件可能不會持久，需要敏銳觀察市場動向，適時調整策略以維持優勢地位。",
        "7": "你所處的外在環境正值上升趨勢，各種有利條件匯聚，這是推進計畫的黃金時機，應該堅定信心持續前進不要猶豫。",
        "8": "你面臨的外在環境已經形成不利格局，阻礙重重且短期內難以改變，應該認清現實暫時收手，等待更好的時機再出發。",
        "9": "你眼前的有利環境已達頂峰開始轉向，過度依賴當前條件會陷入困境，應該順應變化主動調整以迎接新局面。"
      },
      "5": {
        "6": "你觀察到外在環境正處於變動期，各種機會與挑戰交替出現，此時應保持彈性思維，隨時準備調整策略以順應變化。",
        "7": "你看見外在趨勢明朗向上，各項條件都朝有利方向發展，此刻應堅定信念持續前進，把握這波順勢而為的良機。",
        "8": "你面對的外在環境已形成固化格局，既有的問題根深蒂固難以撼動，應認清現實避免硬碰硬，另尋突破之道。",
        "9": "你察覺外在強勢已達頂峰開始轉弱，舊有的優勢正在消失，應順應這個轉換時機，及早布局迎接新局面的到來。"
      },
      "6": {
        "6": "你觀察到外在環境開始出現變化跡象，這些微妙的轉折正是調整方向的良機，及時修正策略能讓你在新趨勢中占得先機。",
        "7": "你看見外在大勢正朝有利方向發展，天時地利人和俱備，堅持既定路線持續前進，順應這股強勁的環境推力。",
        "8": "你面對的外在環境已形成難以撼動的固化格局，與其硬碰硬徒耗資源，不如認清現實選擇迂迴或暫時避開。",
        "9": "你察覺外在強勢趨勢已到達顛峰開始轉弱，明智的做法是順應這個轉變節點，提前佈局下一階段的新方向。"
      }
    }
  },
  "17": {
    "number": 17,
    "name": "隨",
    "code": "100110",
    "卦解": "你現在處在一種需要配合別人節奏的狀態裡，就像跟著音樂搖擺，但節拍時快時慢，讓你有些跟不上。周圍的環境給你中等程度的支持，不算太順暢，感覺像在稍微擁擠的人流中前進。你會發現外在的聲音比內心的想法更響亮，好像被推著往某個方向走。整體氛圍有點像等紅綠燈的感覺，變化很緩慢，但你知道只要耐心地跟著大家的步調，慢慢地就會有所進展。",
    "六階段": {
      "1": "你內心開始感受到某種召喚，像是聽見遠方傳來的節拍聲。周圍的人似乎也察覺到了什麼，開始朝著相同的方向張望。你的心情既興奮又謹慎，知道這是個重要的轉折點。環境中瀰漫著一種「即將開始」的氛圍，各種訊息和機會正在匯聚。你意識到現在最重要的是先搞清楚方向，確認這真的是你想要跟隨的道路，然後才能安心地踏出第一步。",
      "2": "你感覺自己找到了節奏，就像學會了一首歌的旋律。內心有種安定感，因為你知道自己不是孤軍奮戰，而是有了明確的引導。你的行動變得更有章法，不再猶豫不決。周圍的氛圍變得協調起來，大家似乎都在同一個頻道上。你發現自己的配合度明顯提升，能夠很自然地跟上整體的步調，這種同步的感覺讓你覺得踏實又有力量。",
      "3": "你開始展現出更多的主動性，偶爾會想要嘗試不同的路線或方法。內心有點蠢蠢欲動，既想要跟隨主流，又忍不住想要探索其他可能性。你會發現自己時而靠近核心，時而稍微偏離，但總體來說還是在正軌上。環境允許這樣的彈性，給你一些試錯的空間。這種分分合合的過程讓你更了解自己的位置和能力，也讓整個跟隨的過程變得更加生動有趣。",
      "4": "你驚喜地發現外界對你們的態度開始轉變，原本冷淡或觀望的人現在變得友善起來。內心感到鼓舞，因為你看到了更多合作的可能性。各種資源和機會開始向你們敞開大門，合作的窗口一個接一個地打開。環境變得更加支持和包容，你感受到一種被接納的溫暖。這種外部的正向回應讓你更有信心繼續前進，也讓整個團隊的士氣大幅提升。",
      "5": "你感受到一種前所未有的向心力，就像所有的力量都在朝同一個方向聚集。內心充滿力量和使命感，覺得自己正在參與一件很有意義的事情。周圍的每個人都專注而投入，整體的推進效率達到了最高點。環境呈現出一種完美的和諧狀態，所有的元素都在為共同目標服務。你體驗到了真正的團結和力量，這種集體的能量讓你感到既渺小又偉大。",
      "6": "你察覺到這一輪的跟隨即將告一段落，周圍的節奏開始放緩。內心有種既滿足又不捨的複雜情感，知道美好的時光總是有限的。環境中開始出現觀望的氣氛，大家都在思考下一步該怎麼走。你感受到變化即將來臨，需要準備迎接新的主軸和方向。這種轉換期雖然帶來不確定感，但也讓你對未來充滿期待，準備好擁抱下一個階段的挑戰和機遇。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚在搖擺變化中，此時應順應情勢調整學習方向，不要固執己見，靈活修正根基建設的方式，才能為日後發展奠定穩固基石。",
        "7": "你的基本功底正值上升趨勢，應該堅持當前的努力方向持續精進，順應天時地利維持學習節奏，讓根基能力在正確軌道上穩步成長。",
        "8": "你的基礎能力已形成固化模式難以改變，必須認清現實避免強求突破，接受現有底子的限制，在既定框架內尋找適合的發展空間。",
        "9": "你的基礎能力雖然深厚但已到轉換期，應順應時勢調整底層思維模式，將過往累積的實力轉化為新階段的根基，迎接下一輪成長。"
      },
      "2": {
        "6": "你的外在表現容易搖擺不定，此時應該順應當下情況靈活調整自己的言行舉止，不要固執於既定的形象包袱。",
        "7": "你的外在展現正合乎時勢潮流，應該繼續保持這種積極正面的姿態，讓別人看到你穩定可靠的一面。",
        "8": "你長期養成的外在形象已經定型難改，與其勉強改變不如認清現實，避免做出與既有印象相衝突的表現。",
        "9": "你過度強勢的外在表現已到臨界點，應該順應情勢轉為謙和低調，讓剛強的形象適時軟化下來。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該靈活調整學習方向和發展策略，不要固執於原有計畫，順應環境變化來修正自己的能力提升路徑。",
        "7": "你具備良好的成長基礎和上升動能，應該持續在既定方向上努力精進，保持學習熱忱和進取心，讓天賦潛能自然展現和發揮。",
        "8": "你需要認清現有能力的局限性，避免好高騖遠的成長目標，先鞏固基礎技能，從根本處著手改善，才能突破長期累積的瓶頸。",
        "9": "你的某些優勢能力已達高峰，應該順應時勢轉換發展重點，將經驗智慧傳承給他人，在新的領域中尋找下一個成長契機。"
      },
      "4": {
        "6": "你需要密切觀察外在環境的微妙變化，當發現不利因素開始浮現時，及時調整策略方向，避免在變動的基本面中固執己見而錯失轉機。",
        "7": "你面對的外在條件正處於有利態勢，應該把握這個順風時機，堅定地維持既定方針前進，讓環境的正面力量成為你發展的助力。",
        "8": "你必須認清外在環境已經形成不利的固化格局，與其硬碰硬地對抗既定趨勢，不如暫時避開鋒芒，等待更合適的時機再行動。",
        "9": "你察覺外在的強勢環境已達頂峰開始轉弱，此時應順應這個轉變趨勢，準備迎接新的局面，而非依賴即將消退的舊有優勢。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，雖然局勢尚未明朗，但這正是調整策略的好時機，順應這些初期變化來修正你的方向。",
        "7": "你看到外在大勢正朝著有利方向發展，各種條件都在配合你的目標，此時應該堅持既定路線，維持前進的步調不要動搖。",
        "8": "你面對的外在環境已經形成強大阻力，各種不利因素根深蒂固難以撼動，你需要認清現實並考慮暫時迴避或轉換戰場。",
        "9": "你察覺外在的強勢局面已達頂峰開始轉弱，舊的格局即將改變，你應該順應這個轉變趨勢，準備迎接新的機會。"
      },
      "6": {
        "6": "你觀察到環境趨勢正在微妙變化，此時應保持敏銳洞察力，隨時準備調整策略方向，因為外在局勢尚未穩定，靈活應變是關鍵。",
        "7": "你看見大環境正朝著有利方向發展，這是順應天時的最佳時機，持續推進既定計畫，讓自己與外在趨勢保持一致的步調前行。",
        "8": "你面對的外在環境已形成難以撼動的格局，與其硬碰硬地對抗，不如認清現實狀況，暫時避開正面衝突，尋找其他出路。",
        "9": "你察覺外在強勢趨勢已接近轉折點，明智的做法是順應即將到來的變化，提前為新局面做好準備，避免被舊勢力拖累。"
      }
    }
  },
  "18": {
    "number": 18,
    "name": "蠱",
    "code": "011001",
    "卦解": "你現在處在一個需要整頓和修復的狀態裡。周圍的環境感覺有些混亂或停滯，就像房子裡積累了太多灰塵，需要好好清理一番。你內心其實很清楚問題所在，也有足夠的能量去處理，但外在的阻力讓進展顯得緩慢。\n\n這種感覺就像在收拾一個長期被忽略的空間 - 雖然工作量不小，但每一步都在朝好的方向前進。你的內在動力比外在條件更強，所以雖然改變需要時間，但整體的流動還算順暢，只是需要耐心等待累積的效果逐漸顯現。",
    "六階段": {
      "1": "你開始嗅到不對勁的味道，那些被掩蓋已久的問題正一一浮現。內心感到既焦慮又清醒，終於意識到必須面對這些積累的困擾。周圍的人可能還沒察覺嚴重性，但你已經開始默默盤點，哪些地方出了問題，影響範圍有多廣。這是個沉重卻必要的開始，你知道逃避只會讓情況更糟。",
      "2": "你開始動手整理，把混亂的狀況分門別類處理。內心逐漸感到踏實，因為終於在做點什麼了。你選擇從簡單的部分著手，一步步清理那些容易解決的問題。身邊的環境開始有了變化，雖然還很細微，但至少不再是一團亂。這種漸進式的改善讓你看見希望，也給了你繼續下去的動力。",
      "3": "越深入挖掘，你發現問題比想像中更嚴重。那些根深蒂固的瑕疵被一一翻出，讓你意識到某些部分必須徹底重來。內心五味雜陳，既沮喪於問題的複雜，又慶幸終於看清真相。周圍開始有人注意到你的行動，有些支持，有些質疑。你明白這是個關鍵時刻，不能半途而廢。",
      "4": "外界的力量開始介入，可能是專業人士的建議，或是新的規範要求。你感到既放鬆又緊張，放鬆是因為不再孤軍奮戰，緊張是因為要接受外部的檢視。環境中出現了新的標準和做法，那些原本失效的環節正在被替換。雖然調整過程有些不適應，但你知道這是走向正軌的必經之路。",
      "5": "核心的規則和秩序終於重新建立起來，你感到前所未有的安定感。內心的焦慮逐漸消散，取而代之的是對未來的信心。周圍的環境明顯改善了，新的運作方式開始展現效果。人們對這些改變的反應也越來越正面，你開始相信這次的整頓真的有用，後續的發展可以更穩健地進行下去。",
      "6": "你開始做最後的檢查和收尾工作，確保所有環節都已到位。內心既有成就感，也保持著警覺，不希望舊問題再度復發。你建立了監測機制，定期檢視各個面向的運作狀況。周圍的人已經適應了新的秩序，整個環境呈現出穩定而有序的狀態。你知道這不是結束，而是一個更好循環的開始。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚有不穩之處，此時正是修正根基的最佳時機，主動檢視自己的弱點並加以調整，將為未來發展奠定更堅實的底子。",
        "7": "你的根基與底子正處於良好狀態，順應當前的發展趨勢持續精進，維持學習與成長的步調，你的基礎能力將越來越扎實。",
        "8": "你過去累積的基礎問題已經根深蒂固，現在必須認清現實狀況，避免在既有框架中強求，不如重新思考能力建構的方向。",
        "9": "你的基礎能力雖然深厚但已到達瓶頸，順應時代變化的需求主動轉型，將舊有的根基轉化為新領域發展的養分才是明智之舉。"
      },
      "2": {
        "6": "你的外在形象容易因小事而動搖，此時應順應內心真實想法，適時調整展現給他人的面貌，不必強撐完美假象。",
        "7": "你展現出的積極態度正符合時勢所需，繼續保持這種向上的外在表現，讓他人看到你的穩定成長與可靠品格。",
        "8": "你長期累積的負面印象已根深蒂固難以扭轉，現在要認清現實，避免再做無效的形象包裝，先從內在真正改變做起。",
        "9": "你過度強勢的外在表現已到極限，應該順應變化展現更柔軟的一面，讓他人感受到你的謙和與包容態度。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，此時最宜順勢調整自己的發展方向，不要固守舊有模式，靈活修正才能開創新的成長空間。",
        "7": "你的成長動能正順應天時地利，應當堅持既定的提升路徑繼續前進，保持學習與精進的節奏，未來發展可期。",
        "8": "你需認清現有的成長障礙已根深蒂固，與其勉強突破不如暫時避開，另尋其他領域發展，重新找到適合的成長方向。",
        "9": "你過往的成長模式已達極限，應當順應時勢轉變發展策略，放下既有成就包袱，以開放心態迎接新的成長契機。"
      },
      "4": {
        "6": "你需要密切觀察外在環境的微妙變化，當發現不利因素開始浮現時，要靈活調整策略方向，不要固執於原有計畫。",
        "7": "你應該把握當前外在條件的有利趨勢，堅定地按既定方向前進，這是環境基本面支持你發展的黃金時機。",
        "8": "你必須認清外在環境已積累太多負面因素，現在不是強行推進的時候，應該保守觀望，避免捲入不利局面。",
        "9": "你要察覺外在條件的強勢即將轉弱，主動順應這個轉變趨勢，提前佈局下一階段的發展方向。"
      },
      "5": {
        "6": "你觀察到外在環境出現微妙變化，這些不穩定因素正是轉機的前兆，適時調整策略以順應這些變動，將能化解困局並開創新局面。",
        "7": "你看見外在大勢正朝有利方向發展，各種條件逐漸成熟，堅持既定方向持續推進，順應天時地利將帶來豐碩成果。",
        "8": "你面對的外在環境問題已根深蒂固難以撼動，認清現實狀況選擇暫時迴避，保存實力等待更合適的時機再行動。",
        "9": "你察覺外在強勢力量已達頂點開始轉弱，順應這股轉變趨勢調整自己的立場，將能在新的格局中找到更好的位置。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，舊有的問題開始鬆動，這是修正方向的好時機，順應這些變化調整你的策略，不要固守原有做法。",
        "7": "你看見外在趨勢正朝著有利的方向發展，腐敗的舊秩序正在被清理，堅持你當前的方向繼續前進，時勢會支持你的努力。",
        "8": "你面對的外在環境積弊已深，改革阻力極大，現實條件尚未成熟，暫時避開正面衝突，保存實力等待更好的時機。",
        "9": "你察覺外在的舊勢力雖然看似強大，但已是強弩之末，順應這個轉換期的來臨，準備迎接新秩序的建立，變革即將到來。"
      }
    }
  },
  "19": {
    "number": 19,
    "name": "臨",
    "code": "110000",
    "卦解": "你現在處在一個蓄勢待發的階段，雖然整體條件還不夠強勁，但內在的能量正在慢慢聚集。就像春天剛到時，地面下的生命力開始萌動，表面看起來變化不大，但你能感受到一股暗流在默默積累。你的步調和周圍環境大致同步，沒有太大的衝突或阻力，一切都在平穩中醞釀著。這是個需要耐心的時刻，變化雖然緩慢，但確實在發生，就像潮水漸漸上漲，每一次小小的推進都在為未來的突破做準備。",
    "六階段": {
      "1": "你正處在一個全新的開始，雖然起點看似平凡，但內心有種踏實的安全感。就像在平地上邁出第一步，雖然前方的路還很長，但你清楚知道自己要往哪裡去。周圍的環境相對單純，沒有太多干擾，讓你能專心打好基礎。這種從零開始的感覺雖然有些忐忑，但更多的是對未來的期待和信心。",
      "2": "你開始找到自己的節奏了，每一步都走得很穩當，內心也越來越有底氣。就像爬樓梯一樣，雖然需要一階一階慢慢來，但你能感受到自己確實在進步。周圍的人開始注意到你的表現，給你更多正面的回饋。這種穩定向上的感覺讓你覺得很舒服，既不會太急躁，也不會停滯不前。",
      "3": "你發現自己有能力處理更複雜的事情了，內心的自信明顯增強。就像在建築物上加裝防護措施一樣，你開始注重細節，讓自己的表現更加完善。周圍的環境變得更加穩定，失敗的風險明顯降低。這種逐漸成熟的感覺讓你既興奮又安心，知道自己已經不再是當初那個什麼都不懂的新手了。",
      "4": "外在的機會開始向你敞開，你能接觸到更多資源和可能性。內心雖然有些緊張，但更多的是躍躍欲試的興奮感。環境變得更加開放，原本封閉的門戶現在一扇扇為你打開。你感覺自己站在一個轉折點上，有機會接觸到更高層次的舞台，雖然挑戰增加了，但成長的空間也變得更大。",
      "5": "你現在站在一個相對重要的位置上，視野變得開闊許多，內心也更加從容。周圍的環境對你來說已經不再陌生，你能夠游刃有餘地處理各種狀況。這種掌控感讓你覺得很滿足，既能看清全局，也能靈活應對變化。你發現自己不僅個人成長了，連帶著整個環境的層次都提升了。",
      "6": "你已經達到了一個相當的高度，內心感到既滿足又平靜。雖然上升的速度放緩了，但這個位置讓你有了新的視角和思考空間。周圍的環境暗示著更大的變化即將到來，你需要為下一個階段做好準備。這種在高處等待的感覺有點像登山者在山頂休息，既享受當下的成就，也在醞釀下一次的出發。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖，此時應靈活調整學習方向，不要固執己見，順應當下情況來修正自己的根基。",
        "7": "你的基本功扎實且方向正確，正處於能力提升的良好時機，應該堅持當前的努力方向，持續累積實力，穩步向前發展。",
        "8": "你長期累積的舊習慣或技能已經不合時宜，要認清現實狀況，避免繼續依賴過時的能力，重新審視自己的根基需要哪些改變。",
        "9": "你過往建立的優勢已達極限，不宜再過度依賴舊有的能力模式，應順應時勢轉換跑道，讓基礎能力進行新的蛻變。"
      },
      "2": {
        "6": "你的外在形象還在塑造階段，容易因小事而改變他人印象，此時應順應環境回饋，適時調整展現方式，讓自己的表現更符合當下需要。",
        "7": "你展現出來的氣質正合時宜，這種自然流露的狀態能獲得他人認同，持續保持這樣的外在表現，讓正面形象穩定建立。",
        "8": "你過往累積的外在形象已經定型且難以改變，與其強求突破不如認清現實，避免做出與既有印象反差過大的表現。",
        "9": "你長期維持的強勢外在表現已到轉折點，再硬撐下去反而失真，順應內心真實狀態，讓外在展現回歸自然平和。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，容易受外界影響而搖擺不定。此時應順應內心真實感受，適時調整學習方向，將不確定性轉化為探索新領域的動力。",
        "7": "你具備穩健向上的成長動能，內在潛力正逐步顯現。保持當前的努力方向，持續精進既有技能，同時培養新的專業能力，前景可期。",
        "8": "你過往的成長模式已難以突破現況，固有思維成為進步阻礙。需要誠實面對自身局限，放下舊有包袱，重新審視真正適合的發展道路。",
        "9": "你過去積累的優勢已達高峰，若再強求突破恐適得其反。此時應順應自然轉換，將重心轉向培養他人，在傳承中發現新的成長意義。"
      },
      "4": {
        "6": "你面對的外在環境正在微妙變化，雖有不確定性但也蘊含機會，此時應靈活調整策略，順應環境波動來修正自己的行動方向。",
        "7": "你所處的外在條件正朝有利方向發展，大環境趨勢明朗且支持你的目標，應該堅定信念持續前進，把握這波順勢而為的良機。",
        "8": "你面臨的外在環境已形成不利的固化格局，既有的阻礙根深蒂固難以撼動，必須認清現實暫時避開鋒芒，等待時機再做打算。",
        "9": "你眼前看似強勢的外在條件其實已達頂點開始轉弱，舊有的優勢即將消失，應順應這個轉換期主動調整，迎接新局面的到來。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變化雖然還不穩定，但正是調整策略的好時機，順應這些新趨勢來修正你的方向。",
        "7": "你看見外在環境呈現良好的發展態勢，各種條件都朝著有利方向發展，現在應該保持既定路線，穩步向前推進。",
        "8": "你面對的外在環境已經形成固化的不利格局，各種阻力根深蒂固，此時需要認清現實，暫時迴避正面衝突。",
        "9": "你察覺外在環境的強勢已達頂峰開始轉弱，舊有的主導力量即將改變，準備好順應即將到來的新局面。"
      },
      "6": {
        "6": "你觀察到環境變化的微妙信號，應該靈活調整策略方向。外在趨勢尚未定型，正是修正路線的最佳時機，把握變化中的機會。",
        "7": "你看見大環境正朝有利方向發展，應該堅定信心持續前進。順應天地自然趨勢，保持現有策略的正確方向不偏離。",
        "8": "你面對的外在環境已形成強大阻力，應該務實評估現況。積累的困難難以逆轉，認清客觀限制並尋找迴避之道。",
        "9": "你察覺環境的強勢發展已達頂點，應該順應即將到來的轉折。舊有趨勢力量漸弱，準備迎接新的變化週期來臨。"
      }
    }
  },
  "20": {
    "number": 20,
    "name": "觀",
    "code": "000011",
    "卦解": "你現在處在一個觀察和等待的階段，內在力量還不夠充沛，但外在環境倒是給了你一些支持。整體節奏雖然不算完全順暢，卻也在慢慢找到方向。你會發現自己更多時候是在旁觀和思考，而不是積極行動。這種狀態讓你有機會看清楚周圍的變化，但同時也感受到一種微妙的不平衡感。雖然進展緩慢，但你能感覺到各種因素正在悄悄地串聯起來，為未來的推進做準備。",
    "六階段": {
      "1": "你正處在一個資訊快速匯聚的時刻，各種人事物都朝著某個核心集中。你的內心感到既興奮又有些不安，因為突然間要處理的訊息變多了，生活節奏明顯加快。周圍的環境變得熱鬧起來，原本平靜的日常開始出現各種新的動態，你發現自己需要更多專注力來應對這些變化。",
      "2": "你開始學會將事情分類處理，不再一件一件慢慢做，而是採用更有效率的批次方式。內心逐漸找到節奏感，從最初的忙亂中慢慢理出頭緒，感覺更有掌控力了。外在環境也呈現出某種規律性，相似的工作和安排開始出現群聚效應，讓你能夠更系統化地推進各項任務。",
      "3": "你發現自己在細節處理上越來越精準，與他人的配合也更加默契。內心感到踏實，因為那些原本容易出錯的地方現在都有了清楚的標準可循。周遭的協作環境變得更加穩定，大家對於品質要求和做事方式逐漸達成共識，誤差和摩擦明顯減少，整體運作更加順暢。",
      "4": "外部資源和機會開始主動向你靠攏，合作變得容易許多。你內心感到振奮，因為發現自己的影響力正在擴大，能夠接觸到更多元的人群和資源。環境條件明顯好轉，各種會面和溝通都進行得很順利，共享的平台和機會越來越多，為你創造了更寬廣的發展空間。",
      "5": "你已經成為一個穩定的中心點，周圍的人和事都能找到各自合適的位置。內心感到自信和平靜，因為你能夠有效地協調各方資源，讓每個人都能發揮所長。環境現況非常理想，發佈訊息和推動協作都變得輕鬆自然，整個局面呈現出良性運轉的狀態。",
      "6": "這一輪的集結活動即將告一段落，你開始整理所有的資料和成果。內心帶著滿足感，回顧這段時間的努力和收穫，同時也為下一階段做準備。外在環境正在從高度活躍轉向常態化運作，各種臨時性的安排逐漸結束，你需要將經驗和成果好好歸檔，為未來的發展奠定基礎。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚有不穩之處，容易因外界變化而動搖，此時應主動檢視自己的根基，及時調整學習方向，補強薄弱環節。",
        "7": "你的基本功扎實穩固，正順應時勢發展，應持續深耕既有專長，保持學習節奏，讓根基更加厚實，為未來發展奠定堅實底子。",
        "8": "你在某些基礎能力上已形成固化思維，難以改變既定模式，應認清現實限制，避免在弱項上過度消耗，轉而發揮其他優勢。",
        "9": "你過往累積的基礎能力已達顛峰狀態，繼續強化恐適得其反，應順應轉變時機，將扎實根基轉化為新領域的發展動能。"
      },
      "2": {
        "6": "你目前的外在形象容易被他人誤解或質疑，主動調整自己的表達方式和行為舉止，讓真實的內在品格能更清晰地展現給外界。",
        "7": "你的外在表現正符合時勢所需，繼續保持現在的風格與態度，讓自己成為他人學習觀摩的典範，穩步向前不要輕易改變。",
        "8": "你長期形成的外在印象已根深蒂固難以撼動，與其強求改變他人觀感，不如專注內在修養，避免在形象經營上徒費心力。",
        "9": "你過去建立的強勢形象已到轉換期，順應內心真實想法調整外在表現，讓自己展現更柔和包容的一面會更有說服力。"
      },
      "3": {
        "6": "你的成長路徑還在摸索階段，容易因外界反應而動搖方向，此時應該靈活調整學習策略，從每次的試錯中累積經驗，為未來發展奠定基礎。",
        "7": "你正處於能力提升的黃金期，各方面條件都在往好的方向發展，應該保持現有的努力節奏，持續投資自己，讓成長勢頭延續下去。",
        "8": "你在某些領域已經形成固化的思維模式，這限制了進一步突破的可能性，需要誠實面對自己的局限，重新審視哪些舊習慣該放下。",
        "9": "你過往的成功經驗可能已經不適用於當前環境，與其固守既有優勢，不如順應時代變化，將累積的智慧轉化為新的成長動能。"
      },
      "4": {
        "6": "你觀察到外在環境正在微妙變化，這些變動雖然還不穩定，但正是調整策略的良機，順應這些新趨勢來修正你的方向。",
        "7": "你看見外在條件正朝著有利方向發展，天時地利人和皆具備，這是維持現有策略並持續前進的絕佳時機。",
        "8": "你面對的外在環境已經僵化固結，既有的不利條件積重難返，認清這個現實並選擇迴避或另闢蹊徑才是明智之舉。",
        "9": "你察覺外在的強勢環境已達頂峰開始轉弱，舊有的優勢條件即將改變，順應這個轉折點來重新布局。"
      },
      "5": {
        "6": "你需要密切觀察外在環境的微妙變化，當發現情勢有所轉向時，要及時調整自己的應對策略，保持靈活彈性以順應變局。",
        "7": "你應該仔細觀察當前外在趨勢的發展方向，確認環境條件仍然有利後，堅定地維持既定路線繼續前進，把握順勢而為的時機。",
        "8": "你要清楚認知外在環境已經形成難以撼動的既定格局，與其強求改變不如務實地接受現狀，尋找在現有框架下的生存空間。",
        "9": "你需要敏銳察覺外在環境正處於高峰轉折的關鍵時刻，主動順應即將到來的變化趨勢，提前做好轉換方向的準備。"
      },
      "6": {
        "6": "你觀察到外在環境正在醞釀變化，趨勢尚未明朗，此時應保持敏銳觸覺，隨時準備調整策略，順應即將到來的新局面。",
        "7": "你看見外在大勢正朝有利方向發展，天時地利俱備，應堅定信心持續推進既定計劃，順應這股向上的時代潮流。",
        "8": "你面對的外在環境已形成難以撼動的固化格局，與其硬碰硬徒勞無功，不如認清現實另闢蹊徑，避開正面衝突。",
        "9": "你觀察到外在強勢已達頂峰開始轉弱，舊有格局即將鬆動，應順應這個轉折點，準備迎接新的發展機會。"
      }
    }
  },
  "21": {
    "number": 21,
    "name": "噬嗑",
    "code": "100101",
    "卦解": "你現在就像在咀嚼一塊有點韌的食物，需要用力但不會太費勁。周圍的環境對你來說算是友善的，外在條件比內在準備要好一些，但整體進展卡卡的，像是走走停停的感覺。你會發現自己的步調時而順暢時而受阻，好像有些看不見的障礙在那裡。不過這種狀態不會急劇改變，而是會慢慢地、一點一點地往前推進，就像慢慢把那塊食物嚼爛咽下去一樣。",
    "六階段": {
      "1": "你正處在起步階段，發現事情比想像中複雜，到處都是硬骨頭要啃。你內心有點焦慮，原本以為簡單的任務變得繁瑣，需要不斷釐清各種規格和邊界。周遭環境似乎也不太配合，處處都是未知的挑戰。但這正是建立根基的關鍵時刻，雖然進展緩慢，卻在為後續的突破做準備。",
      "2": "你找到了關鍵的突破點，事情開始有了轉機。內心的信心明顯提升，原本模糊的方向變得清晰起來。你開始感受到自己的能力正在發揮作用，每一步都更有把握。環境也開始回應你的努力，阻力減少了，配合度提高了。這種順暢的感覺讓你更有動力繼續前進。",
      "3": "你的潛力開始展現，但同時也面臨更多細節上的挑戰。內心情緒起伏較大，有時充滿鬥志，有時又感到疲憊。你需要不斷測試和調整策略，節奏變得不太穩定。外在環境也變得複雜，需要你展現更多的適應能力。這個階段考驗著你的韌性和學習能力。",
      "4": "外部環境的配合度一般般，你需要依靠現有的資源和管道來推進。內心可能有些無奈，因為進度受到外在因素限制，無法完全按照自己的節奏來。你必須學會在有限的條件下發揮，善用既有的通道和機會。雖然有些束縛感，但這也是現實環境的考驗。",
      "5": "你開始掌握環境的規則和節奏，整個局面變得可控。內心越來越篤定，知道該怎麼應對各種狀況。外在環境也更加友善，你的成功率明顯提升。這種掌控感讓你充滿自信，能夠更有效地運用周遭的資源。環境不再是阻礙，而是你發揮的舞台。",
      "6": "你已經接近目標，雖然還有一些零星的小問題需要處理，但整體趨勢已經很明朗。內心感到踏實和滿足，知道只要把剩餘的要件補齊就能順利過關。外在環境也呈現出積極的訊號，支持你完成最後的衝刺。這個階段充滿了即將成功的喜悅感。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚有不穩之處，此時正是調整根基的良機，主動檢視自己的底子，順勢修正缺失，為未來發展打下更堅實的基礎。",
        "7": "你的根基正值穩固成長期，應當保持現有的努力方向，持續累積基本功，順應天時地利，讓能力底子自然深厚起來。",
        "8": "你的基礎能力已形成固化模式難以改變，與其勉強突破不如認清現實，避開需要大幅改變底子的挑戰，另尋適合的發展方向。",
        "9": "你過往累積的基礎能力已到轉換期，不必執著於舊有底子，主動順應時勢變化，讓根基隨著新環境需求而自然轉型。"
      },
      "2": {
        "6": "你現在的外在表現容易引起他人誤解或反感，應該主動調整自己的言行舉止，以更溫和謙遜的方式與人互動，避免因衝動而破壞重要關係。",
        "7": "你目前展現出的積極態度和執行力正符合時勢需要，應該繼續保持這種外在形象，堅定地推進既定計劃，讓他人看到你的決心和能力。",
        "8": "你長期累積的負面形象已經根深蒂固，很難在短時間內改變他人對你的看法，應該認清現實，暫時收斂鋒芒，避免正面衝突。",
        "9": "你過於強勢的外在表現已經到了極限，容易招致反彈，應該主動軟化姿態，學會示弱和妥協，以更柔性的方式來處理人際關係。"
      },
      "3": {
        "6": "你的成長路上會遇到挫折和變數，但這正是調整方向的好時機，保持彈性思維，隨時修正策略，將阻礙轉化為突破的契機。",
        "7": "你正處於穩健成長的軌道上，順應自然發展的節奏，持續投入努力，堅持既定方向，潛力將在恰當時機充分展現。",
        "8": "你需要認清當前能力的真實界限，避免過度擴張或不切實際的期待，專注於鞏固基礎，等待更合適的成長時機。",
        "9": "你已達到某個成長階段的頂峰，是時候順應轉變的趨勢，放下舊有模式，以開放心態迎接下一個發展週期的到來。"
      },
      "4": {
        "6": "你面對的外在環境充滿變數，市場條件或合作關係可能隨時調整，保持彈性應變能力，適時修正策略方向，將不穩定因素轉化為機會。",
        "7": "你所處的外在環境正值有利時機，各項條件都在朝好的方向發展，把握這股順勢而為的力量，堅定地維持既定方針繼續前進。",
        "8": "你面臨的外在環境已形成難以撼動的不利局面，既定的市場格局或體制框架對你極為不利，務必認清現實，暫時避開正面衝突。",
        "9": "你觀察到外在環境的強勢態勢已達頂峰開始轉弱，原本的主導力量將面臨變化，順應這個轉變趨勢，準備迎接新的機會窗口。"
      },
      "5": {
        "6": "你觀察到外在環境變化頻繁，各種阻礙時有時無，此時應順勢調整策略，不要固執己見，靈活應對當下的不穩定局面。",
        "7": "你看見外在形勢正朝有利方向發展，各種障礙正在被逐步清除，應該維持現有方針繼續前進，把握這個順勢而為的時機。",
        "8": "你面對的外在阻礙已經根深蒂固難以撼動，必須認清現實接受這個困難局面，暫時避其鋒芒，等待更好的時機再行動。",
        "9": "你發現原本強勢的外在阻力已經到了極限開始轉弱，應該順應這個轉變趨勢，準備迎接即將到來的新局面和機會。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動期，各種趨勢尚未明朗，此時應保持彈性思維，隨時準備根據新的環境信號來調整你的策略方向。",
        "7": "你看見外在大環境正朝著有利的方向發展，天時地利皆順，此時應該堅定信心，維持既定路線繼續前進，不要被小波動干擾。",
        "8": "你面對的外在環境已形成固化的不利趨勢，積弊深重難以扭轉，此時需要認清現實，避開正面衝突，另尋突破的時機和路徑。",
        "9": "你察覺外在環境的強勢已達頂峰，即將出現轉折，此時應順應這個轉變趨勢，提前做好準備來迎接新局面的到來。"
      }
    }
  },
  "22": {
    "number": 22,
    "name": "賁",
    "code": "101001",
    "卦解": "你現在處在一個相當穩定的狀態裡，就像湖面上的微風輕撫，有著淡淡的波動但不會掀起大浪。你的內心比外在環境更有力量，有種內斂的充實感，好比一朵花正在慢慢綻放，美麗在悄悄醞釀著。周圍的步調和你大致合拍，沒有太多衝突或阻力。雖然表面上看起來變化不大，但你能感覺到一些微妙的連結正在形成，像拼圖的片段逐漸找到了彼此，一種美好正在你的生活中慢慢堆疊起來。",
    "六階段": {
      "1": "你正在為自己建立基本的形象框架，就像為房間選定主色調和基本擺設。內心雖然還有些不確定，但已經有了方向感，知道自己想要呈現什麼樣子。周圍的人開始注意到你的改變，雖然還不算突出，但至少有了清晰的輪廓。這是打地基的階段，需要耐心，因為後續所有的精彩都建立在這個基礎上。",
      "2": "你開始在細節上下功夫，每個小地方都經過精心調整，整體質感明顯提升。內心感到越來越有信心，因為看得出自己的用心和進步。身邊的人也給予正面回應，認同你的品味和努力。這個階段讓你體會到「魔鬼藏在細節裡」的道理，也享受著精雕細琢帶來的成就感。",
      "3": "你發現有些元素之間出現了不協調，原本以為完美的搭配出現了衝突點。內心有些挫折感，但也意識到這是成長必經的過程。外在環境開始出現不同聲音，有人質疑你的選擇。這時候需要冷靜重新檢視，調整那些不合適的部分，在堅持與妥協之間找到平衡點。",
      "4": "你的風格在更大的舞台上獲得認可，不同類型的人都能接受你的表現。內心充滿了被理解的喜悅，感覺自己找對了方向。外在環境變得友善，機會開始湧現，有更多平台願意給你展示的空間。這是一個重要的轉折點，證明你的努力已經得到市場和社會的驗證。",
      "5": "你建立了屬於自己的核心風格，簡潔而有力，內外表現完全一致。內心感到前所未有的篤定和自信，知道自己就是要走這條路。周圍環境高度配合，資源和支持自然匯聚過來。你不再需要刻意證明什麼，因為你就是那個標準的代表，散發出的氣質讓人一眼就能記住。",
      "6": "這一輪的形象建立已經圓滿完成，你開始整理這段時間累積的經驗和資源。內心帶著滿足感回顧來路，同時也在思考下一個階段的可能性。外在環境趨向穩定，你建立的模式開始被他人學習和複製。這些成功的範本將成為你未來發展的重要資產，也為新的突破奠定基礎。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚在變動期，不必急於定型，透過持續學習和實踐來調整自己的根基，讓底子在摸索中逐漸穩固。",
        "7": "你的根基正處於成長軌道上，繼續按照既定方向深耕基本功，這份紮實的底子將成為未來發展的重要支撐。",
        "8": "你必須正視基礎能力的不足已成既定事實，與其勉強補強不如發揮現有優勢，避開需要深厚底子的競爭領域。",
        "9": "你過往累積的基礎優勢已達頂峰開始轉折，主動調整心態接受新的學習模式，讓經驗成為轉型的助力而非阻力。"
      },
      "2": {
        "6": "你的外在形象容易因小事而動搖，此時應順應環境變化，適時調整自己的表現方式，不必固執於單一的展現風格，靈活修正更能贏得他人認同。",
        "7": "你的外在表現正符合當前趨勢，應該持續維持這種積極向上的形象，穩定地展現你的能力與魅力，這是建立良好聲譽的最佳時機。",
        "8": "你過往累積的形象包袱已成負擔，必須認清現實，避免繼續用舊有方式展現自己，暫時收斂鋒芒，重新思考如何塑造更合適的外在形象。",
        "9": "你強勢的外在表現已達極限，應該順應時勢轉變，從高調轉為低調，從主導轉為配合，適時示弱反而能為你帶來新的機會與支持。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該靈活調整自己的發展方向，順應內心真實需求來修正目標，不要固執於既定計畫。",
        "7": "你具備穩定的成長動能，應該堅持當前的努力方向，持續精進自己的能力，順應天時地利來實現潛力。",
        "8": "你需要認清自身成長的現實限制，避免過度勉強突破既有框架，接受當下能力範圍內的穩步提升。",
        "9": "你的某些成長模式已達極限，應該順應時勢轉換發展策略，以全新角度重新審視自己的潛力空間。"
      },
      "4": {
        "6": "你發現外在環境變化多端，市場或人際關係出現不穩定訊號，此時應靈活調整策略，不要固執己見，順應變化才能化危為機。",
        "7": "你觀察到外在條件正朝有利方向發展，天時地利人和皆具備，應堅持既定方針持續前進，把握這波良好趨勢創造佳績。",
        "8": "你面對的外在環境已形成難以撼動的困難局面，既有阻力根深蒂固，應認清現實避免硬碰硬，保存實力等待時機。",
        "9": "你察覺外在強勢局面已到達頂峰開始轉弱，舊有優勢條件正在消退，應順應這個轉變趨勢，提前佈局新的發展方向。"
      },
      "5": {
        "6": "你觀察到外在環境的文飾與表象正在鬆動變化，此時應順勢調整自己的應對策略，不要固守原有的包裝方式，靈活修正才能適應新局。",
        "7": "你看見外在環境中真正的美德與質樸正在顯現，這是天地自然的趨勢，你應該維持內在的真誠品格，持續朝著純樸本真的方向前進。",
        "8": "你面對的外在環境已經過度包裝粉飾，積重難返的虛華現象難以扭轉，你需要認清這個現實，避免被表面的繁華所迷惑而做出錯誤判斷。",
        "9": "你察覺外在的華麗裝飾已到了強弩之末的階段，過度的文飾即將轉向樸實，你應該順應這個轉變趨勢，提早回歸到簡約真實的本質。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，文飾與包裝的效果開始減弱，此時應順應趨勢調整策略，從華麗轉向質朴，讓真實內涵自然展現。",
        "7": "你看見環境正朝向去繁就簡的方向發展，這是天地自然的趨勢，堅持走向純樸本質的道路，不被外在浮華迷惑，持續前進必有所成。",
        "8": "你面對的是過度裝飾已成慣性的環境，華而不實的風氣積重難返，認清這個現實並避開虛浮的潮流，保持內在的真實與純淨。",
        "9": "你發現極致的文飾已達頂峰開始衰退，外在的華美風潮即將轉向，順應這個必然的轉變，及早回歸樸素本真才是明智之舉。"
      }
    }
  },
  "23": {
    "number": 23,
    "name": "剝",
    "code": "000001",
    "卦解": "你現在處於一種微妙的轉換期，內在感覺有些空虛無力，但外在環境反而顯得比較活躍。整體氛圍就像秋天落葉的季節，有種逐漸剝落、簡化的感覺。你的步調跟周圍的節奏時而合拍時而不同步，但大方向還算順暢。雖然當下的條件不算特別有利，變化也很緩慢，但你能感受到一種潛在的累積正在發生，就像水滴穿石那樣，慢慢地但持續地在推進著什麼。",
    "六階段": {
      "1": "你開始感受到一些不太重要的東西正在離開你的生活。也許是一些過去習慣的小事，或是不再那麼親近的朋友關係。你的內心並不太在意這些變化，因為你知道這些都不是真正重要的部分。周圍的環境也在悄悄調整，一些表面的繁華開始褪去，但整體架構依然穩固。你感到這是自然的淘汰過程。",
      "2": "你變得更加謹慎和保守，開始收縮一些不必要的開支和行動。內心有種需要守護重要事物的感覺，不再像以前那樣大手大腳或冒險。你開始專注於真正有價值的核心部分，放棄一些邊緣的追求。環境也變得更加現實，需要你做出更精明的選擇。你學會了什麼是真正值得保留的。",
      "3": "你發現維持現狀變得越來越困難，原本運作順暢的系統開始出現更多問題。內心感到一定的壓力，但你仍在努力維護最重要的核心關係和責任。你必須更加小心地處理每一個決定，因為錯誤的代價變得更高。環境的挑戰增加，但你依然堅持守住最關鍵的底線。",
      "4": "你感受到外界的支持和資源明顯減少，很多以前可以依賴的幫助不再出現。內心開始體會到一種孤獨感，但同時也激發了你的自立精神。你被迫學會只依靠最核心的能力和資源來運作。環境變得更加嚴峻，但這也讓你更清楚什麼才是自己真正擁有的力量。",
      "5": "你發現自己雖然資源有限，但仍能維持最基本的秩序和運作。內心有種堅韌的平靜，知道即使在困難中也不會完全崩潰。你學會了在極簡的狀態下依然保持尊嚴和方向感。外在環境雖然嚴酷，但你已經適應了這種精簡的生活方式，甚至從中找到了某種純粹的力量。",
      "6": "你來到了一個完整循環的終點，所有該離開的都已經離開了。內心感到一種奇特的解脫和寧靜，雖然表面上看起來一無所有，但你知道最珍貴的種子還在。環境也完成了它的清理工作，為新的開始準備了空間。你帶著深刻的智慧和純淨的初心，等待下一個階段的到來。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易動搖不定，此時應順應變化調整學習方向，重新檢視自己的根基，找出真正適合的發展道路。",
        "7": "你的底子扎實且具備成長潛力，應該持續在既定方向上精進基本功，天時地利正助你建立更深厚的根基實力。",
        "8": "你過往累積的基礎已經僵化難以改變，必須認清現實放下包袱，避免固守陳舊的能力框架，為新的開始做準備。",
        "9": "你的基礎能力已達顛峰但開始衰退，應順應時勢轉變角色定位，將豐富經驗轉化為指導他人的智慧資本。"
      },
      "2": {
        "6": "你的外在形象正處於不穩定狀態，容易給人搖擺不定的印象，此時應該順應環境變化，適時調整自己的表現方式，避免固執己見而失去他人信任。",
        "7": "你展現出來的樣子符合當前趨勢，在剝落的大環境中仍能保持適度的堅持，繼續維持現有的外在表現，但要留意不可過於張揚招致反感。",
        "8": "你的外在表現已經積累了太多負面印象，旁人對你的觀感難以改變，現在應該認清這個現實，暫時收斂鋒芒，避免繼續惡化既有形象。",
        "9": "你過往強勢的外在表現已經到了轉折點，繼續維持強硬姿態只會適得其反，是時候順應情勢轉變，展現更加謙和低調的一面。"
      },
      "3": {
        "6": "你的成長潛力正處於關鍵轉折點，面對剝落的環境時要靈活調整發展方向，不要固執於原有計畫，順勢而為才能找到新的突破口。",
        "7": "你具備穩定向上的成長動能，即使外在環境充滿挑戰，仍要堅持正道前進，持續累積實力是你最大的成長空間。",
        "8": "你的成長受到深層阻礙所困，必須認清現實中的限制因素，暫時避開正面衝突，重新審視自己的能力邊界。",
        "9": "你過往的成長模式已達極限，需要順應時勢轉變發展策略，放下舊有的成功經驗，才能開創新的成長可能。"
      },
      "4": {
        "6": "你觀察到外在環境開始出現不穩定跡象，此時應當靈活調整策略，不要固守原有做法，順應變化修正方向才能避免更大損失。",
        "7": "你發現外在條件雖有挑戰但大勢仍在，保持既定方針繼續前進，堅守正道不輕易動搖，時機會證明你的堅持是正確的。",
        "8": "你面對的外在環境已經嚴重惡化且積弊已深，現實地認清形勢選擇暫時避讓，保存實力等待更好時機才是明智之舉。",
        "9": "你看到外在強勢力量已達頂峰開始轉弱，順應這個轉變趨勢調整自己的立場，與其硬碰不如順勢而為尋找新機會。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，剝落的跡象初現，此時應順勢調整策略，靈活應對這些不穩定因素，避免固守既有做法。",
        "7": "你看見環境中剝蝕力量雖強，但仍有順應天地自然規律的空間，繼續維持正道前進，不被表面的動盪所迷惑。",
        "8": "你面對的外在局勢已呈現嚴重剝落態勢，積重難返的現實擺在眼前，必須認清形勢，適時退避保全實力。",
        "9": "你察覺環境變化已達臨界點，強勢即將轉為衰落，此刻應順應這股轉變之勢，主動調整位置迎接新局。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，雖然趨勢尚未明朗，但應保持敏銳觸覺，隨時準備根據新的發展調整你的策略方向。",
        "7": "你看見外在大勢正朝著有利方向發展，這是天時地利的好時機，應該堅定信心，維持既定路線繼續前進不要動搖。",
        "8": "你面對的外在環境已經形成難以逆轉的不利局面，與其硬碰硬徒然消耗，不如認清現實暫時退避，等待更好時機。",
        "9": "你察覺外在強勢即將走到盡頭，舊有格局開始鬆動，此時應該順應這股轉變的力量，準備迎接新局面的到來。"
      }
    }
  },
  "24": {
    "number": 24,
    "name": "復",
    "code": "100000",
    "卦解": "你現在就像是在寒冬裡感受到第一絲春意的人。外在環境依然冷冽，各種阻礙還是不少，但你內心深處有種微妙的暖意正在悄悄萌發。整體狀況看起來還是有些吃力，進展也不太順暢，可是你能感覺到某種生機正在慢慢甦醒。就像種子在土裡默默發芽一樣，雖然表面上看不出太大變化，但那股向上的力量已經開始在你心裡扎根了。這是個需要耐心等待的時刻。",
    "六階段": {
      "1": "你內心深處有個微弱但清晰的聲音在呼喚，那是你最初的信念正在重新點亮。雖然周圍還是一片混亂，但你開始感受到一絲久違的安定感，像是找到了回家的第一個路標。這個時候外在環境可能還沒什麼明顯變化，但你心裡知道，有什麼重要的東西正在慢慢回來，那股熟悉的力量開始在你體內輕柔地流淌。",
      "2": "你發現自己能夠穩定地展現出真實的樣子了，不再需要刻意偽裝或勉強自己。每一個小小的行動都充滿了踏實感，你的內心越來越平靜，像是重新找回了自己的節拍。身邊的人開始注意到你的變化，雖然還很微妙，但那種自然而然的表現讓人感到舒服。環境似乎也在配合你，提供了一些小小的支持和鼓勵。",
      "3": "你感覺到自己蘊藏的可能性正在甦醒，雖然偶爾還會有些猶豫和反覆，但你心裡已經很清楚自己要往哪個方向走。內在的資源和能力逐漸整合起來，你開始相信自己真的可以做到。周圍的條件也慢慢到位，需要的人脈、資訊、機會開始出現在你的生活中，雖然還不完整，但已經讓你看到了希望的輪廓。",
      "4": "外在世界的門開始為你敞開，那些曾經斷掉的連結重新建立起來。你感到一陣輕鬆，因為不再需要孤軍奮戰，支援和協助從各個方向湧來。內心的焦慮逐漸消散，取而代之的是一種「事情開始順暢」的確定感。環境的回應變得更加積極，溝通變得容易，原本卡住的事情開始有了進展，你能感受到整個生態系統在重新活絡起來。",
      "5": "你重新掌握了主導權，心中有了明確的方向感和控制感。內在的智慧和外在的條件達到了很好的平衡，你感到自信而踏實，知道自己正走在對的路上。周圍的環境現在完全支持你的選擇，資源配置得當，團隊運作順暢，效率大幅提升。你能清楚地看到目標，也有足夠的能力和條件去實現它，一切都在你的掌控之中。",
      "6": "你完成了這一輪的回歸之旅，心中充滿了成就感和滿足感。那些臨時的應急措施可以退場了，因為正常的運作模式已經完全恢復。你感到既安定又充滿期待，因為新的循環即將開始。環境也呈現出穩定而有活力的狀態，為下一階段的發展提供了良好的基礎。你知道是時候收拾行囊，準備迎接新的挑戰和機會了。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚在波動中，此時應順應變化調整根基，不必強求穩定，透過靈活修正來逐步建立更適合的底子。",
        "7": "你的根基正順應天地自然趨勢成長，應保持當前的努力方向持續前進，讓基礎能力在正確軌道上穩步提升。",
        "8": "你必須認清現有基礎能力的限制已成定局，避免勉強突破既有框架，轉而在現實條件內尋找可行的發展空間。",
        "9": "你的基礎能力已達頂峰開始轉折，應順應這個自然轉變，將過往累積的底子轉化為新階段的起點與養分。"
      },
      "2": {
        "6": "你在外表現出的不確定讓人看見內心掙扎，此時應順應變化修正形象，不必強撐完美假象，真誠展現調整中的自己反而能獲得理解與支持。",
        "7": "你展現出的積極態度正合時宜，繼續保持這種向上的外在表現，你的正面能量正在感染周圍的人，維持這份真誠的進取心將帶來更多機會。",
        "8": "你外顯的固執形象已經根深蒂固難以改變，與其費力扭轉他人印象，不如認清現實暫時收斂鋒芒，避免因形象包袱而錯失實質改善的機會。",
        "9": "你過度強勢的外在表現已到極限，是時候展現柔軟謙遜的一面，順應形勢轉變展現方式，讓外在形象從強硬轉向包容，反而能重獲新生。"
      },
      "3": {
        "6": "你在成長路上容易因小挫折而動搖，此時需要靈活調整學習方法和發展方向，不要固執於單一路徑，順應變化才能找到真正適合的成長軌道。",
        "7": "你的成長潛力正處於上升期，應該堅持當前的努力方向和學習節奏，保持積極進取的態度，順應天時地利持續精進，必能開花結果。",
        "8": "你過去累積的限制性思維已成為成長阻礙，需要認清這些根深蒂固的模式難以快速改變，先避開舊習慣的影響，重新建立成長基礎。",
        "9": "你過度依賴既有的優勢和經驗，但這些優勢已達極限，應該順應時代變化主動轉型，放下過去的成功模式，開發新的成長可能性。"
      },
      "4": {
        "6": "你面對的外在環境正處於變動期，雖有不確定因素但仍存機會，應保持敏銳觀察力，隨時準備調整策略以配合環境變化。",
        "7": "你所處的外在條件正順應自然發展規律，環境氛圍有利於復甦成長，應堅持既定方向持續前進，把握這波良好態勢。",
        "8": "你眼前的外在環境積弊已深，阻力重重難以突破，應認清現實避免硬碰硬，暫時收斂鋒芒等待更好的時機到來。",
        "9": "你察覺外在環境的推動力已達頂峰開始轉弱，應順應這個自然轉換過程，調整期望值並準備迎接下一個發展階段。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變化雖然還不穩定，但正是調整策略的好時機，順應這些新趨勢來修正你的行動方向。",
        "7": "你看見外在大勢正朝著有利的方向發展，天時地利都在支持復甦的進程，此時應該堅持既定路線，維持穩健前進的步調。",
        "8": "你面對的外在阻力已經根深蒂固，積累已久的問題不是短期能解決的，現在需要認清現實，暫時避開正面衝突尋找迂迴之路。",
        "9": "你注意到外在的強勢力量已經到達頂峰開始轉弱，這個轉折點正是復甦的契機，順應這個大轉變來規劃你的下一步行動。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，這些變化雖然還不穩定，但正是調整方向的好時機，順應這些新興趨勢來修正你的策略。",
        "7": "你看見外在大環境正朝向復甦的方向發展，這股向上的趨勢值得信賴，繼續維持現有的前進步調，與天地之勢同行。",
        "8": "你必須認清外在環境已經形成難以逆轉的沉重局面，與其對抗這股強大的阻力，不如暫時避開鋒芒，等待更好的時機。",
        "9": "你發現外在的復甦力量已達到頂峰開始轉弱，這個轉折點提醒你要順應即將到來的變化，不要固守過時的判斷。"
      }
    }
  },
  "25": {
    "number": 25,
    "name": "無妄",
    "code": "100111",
    "卦解": "你現在處在一個很有意思的狀態——表面上看起來條件不錯，外在資源也算充足，但內心深處總覺得哪裡不太對勁。就像走在一條看似平坦的路上，卻時不時遇到小石子絆腳，進展得不夠順暢。你的內在動力和外在表現有些不太協調，造成一種「想要但又不太確定」的微妙感受。整個氛圍是穩定中帶著些許停滯，不算糟糕，但也不是那種一切都恰到好處的狀態。",
    "六階段": {
      "1": "你發現自己過去總是想太多，習慣把事情搞得複雜。現在你開始意識到，那些花俏的手法其實沒什麼用，反而讓你偏離了正軌。內心有種想要回歸簡單的渴望，但又擔心這樣做會不會太平凡。周圍的環境其實很單純，只是你把它看得太複雜了。是時候拿掉那些多餘的包裝，按照最基本的常理和正道來做事。",
      "2": "你決定採取最直接的方式行動，不再繞彎抹角或使用小聰明。這種改變讓你感到輕鬆許多，心情變得踏實而穩定。你發現當你老實按規則來的時候，事情進展得比預期還要順利。外在環境對你的直率反應良好，沒有你想像中的阻力。簡單的方法往往最有效，你開始相信誠實面對比耍花招更有力量。",
      "3": "就在你以為一切都在掌握中時，突然出現了一些意想不到的訊息或變化。你的第一反應可能是慌張，想要馬上調整策略。但內心深處有個聲音提醒你要冷靜，先搞清楚這些訊號是真是假。環境中充滿了雜音和干擾，但你需要保持內心的單純和清明。不要因為一時的意外就改變原本正確的方向，堅持簡單純粹的做法。",
      "4": "你的樸實作風開始獲得外界的認同和信任。周圍的人對你的態度明顯變好，願意配合你的想法和計劃。你感受到一種被理解和支持的溫暖，不再需要費盡心思去說服別人。溝通變得容易多了，因為大家都看得出你的真誠。環境條件對你越來越有利，你發現誠實和簡單原來是最好的社交策略，也是最省力的做事方法。",
      "5": "你現在處於一個很穩定的狀態，內心清澈如水，判斷事情的時候不會被雜念干擾。做決定變得快速而自然，不需要糾結或勉強自己。你感到一種前所未有的自在和從容，彷彿找到了屬於自己的節奏。外在環境也很配合，各種條件都恰到好處。你不再追求完美或刻意控制結果，而是相信順其自然就是最好的安排。",
      "6": "來到收尾階段，你依然保持著質樸的風格，沒有想要畫蛇添足或錦上添花。內心充滿了平靜的滿足感，知道該做的都做了，剩下的就交給時間。你不會因為接近終點就急躁或加碼，而是讓一切自然地走向結束。外在環境也呈現出一種和諧的收斂狀態，所有的元素都在往同一個方向匯聚。這種不刻意追求的態度，反而讓結果更加圓滿。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力還不夠穩固，容易因外在變化而動搖，此時應該謙虛學習，順應當下情況調整自己的根基，不要急於展現實力。",
        "7": "你的底子扎實且正在穩步提升，這是順應天地自然的成長節奏，保持現在的努力方向，持續累積基本功，前進的路是對的。",
        "8": "你的根基已經固化在錯誤的方向上，積習難改，與其勉強改變既有的底子，不如認清現實，避免在舊有基礎上繼續投入無效努力。",
        "9": "你過去累積的基礎能力已達到極限，強撐只會消耗更多能量，順應時勢轉換跑道，讓舊有的根基自然轉化為新的起點。"
      },
      "2": {
        "6": "你現在的外在表現容易讓人產生誤解，不妨主動調整自己展現的方式，讓真誠自然的一面更清楚地被他人看見。",
        "7": "你的外在表現正展現出純真自然的狀態，這份真實無偽的樣子正是當下最好的展現，繼續保持這樣的真誠。",
        "8": "你長期以來的外在形象已經固化，認清現實中他人對你的既定印象，暫時避免強行改變外在表現的嘗試。",
        "9": "你過度用力的外在表現已到臨界點，順應自然法則讓自己回歸更樸實真誠的狀態，不必刻意營造形象。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，此時最適合順應內心真實想法做出調整，不要固執於原有計畫，靈活修正方向才能開拓更大發展空間。",
        "7": "你具備穩定向上的成長動能，應該堅持正道持續精進，這是積累實力的關鍵時期，保持專注和耐心將為未來奠定堅實基礎。",
        "8": "你需要認清目前成長受限的現實狀況，避免勉強突破既有框架，先穩固基本功再談發展，急躁只會消耗寶貴的潛在能量。",
        "9": "你的某些能力已達高峰需要轉型，順應時勢調整成長方向，將既有優勢轉化為新領域的基礎，這樣才能延續發展動力。"
      },
      "4": {
        "6": "你觀察到外在環境正在微妙變化，這是調整策略的最佳時機，順應這些變化修正你的方向，而非固執己見對抗趨勢。",
        "7": "你面對的外在條件正值有利時期，天時地利皆在你這邊，堅持既定路線持續前進，把握這波順勢而為的機會。",
        "8": "你必須認清外在環境已形成不利局面，積習難改的困境無法輕易扭轉，明智的選擇是暫時避開鋒芒等待時機。",
        "9": "你感受到外在強勢即將轉弱，盛極而衰的轉折點已現，順應這個自然循環的變化，準備迎接新的發展階段。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變動雖然細微但值得關注，順應這些新的趨勢調整你的策略，避免固守舊有做法而錯失良機。",
        "7": "你看見外在情勢正朝著有利方向發展，天時地利皆順，繼續維持現有的前進步調，專注執行既定計劃就能獲得理想成果。",
        "8": "你面對的外在環境已經形成難以改變的固化局面，與其硬碰硬徒勞無功，不如認清現實狀況，暫時迴避正面衝突尋找其他出路。",
        "9": "你察覺外在強勢即將轉弱，過去的優勢條件正在消失，主動順應這個轉變趨勢，提前布局新的方向才能化解即將到來的困境。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動期，趨勢尚未明朗，此時應保持敏銳觀察力，隨時準備根據環境變化調整自己的策略方向。",
        "7": "你看見外在趨勢正朝著有利方向發展，天時地利皆順，應該堅定信念持續前進，不要因小波動而改變既定路線。",
        "8": "你面對的外在環境已形成固化趨勢，積習難改，與其硬碰硬不如認清現實，暫時避開正面衝突尋找其他突破口。",
        "9": "你察覺外在強勢已達頂峰開始轉弱，舊有趨勢即將改變，應該順應這個轉換時機，準備迎接新的發展階段。"
      }
    }
  },
  "26": {
    "number": 26,
    "name": "大畜",
    "code": "111001",
    "卦解": "你現在處於一個蓄積能量的階段，內在的力量相當充實，就像水庫裡積存了豐沛的水源。雖然整體的推進節奏還算順暢，但偶爾會感到有些阻滯，不是那麼一帆風順。你的內在狀態明顯比外在環境來得強勢，有種蓄勢待發的感覺。短期內可能不會有太大的變動，但你能感受到各種條件正在慢慢整合，力量正在一點一滴地累積，為將來的突破做準備。",
    "六階段": {
      "1": "你正處於需要主動踩煞車的時刻，雖然內心有著強烈的行動衝動，但理智告訴你現在不是衝刺的時候。周圍的環境還不夠成熟，你需要把那股躁動的能量先收起來，專心做好基礎建設和資源積累。這種克制讓你感到有些焦慮，但你知道這是為了更大的目標而做的必要準備。",
      "2": "你開始看到自己的努力有了具體成果，無論是技能、人脈還是各種資源都在穩步增長。內心充滿了踏實的成就感，因為你能清楚感受到自己正在變強。外在環境對你越來越友善，周圍的人開始注意到你的進步，你建立的制度和培養的能力正在發揮作用，一切都朝著好的方向發展。",
      "3": "你感受到內在力量已經相當充實，開始有種想要大展身手的衝動。但這時候你需要特別注意節奏的掌控，不要讓積蓄的能量過早流失。周圍環境雖然看起來充滿機會，但你必須學會精準控制自己的輸出，保持內斂而專注的狀態，讓力量在最關鍵的時刻發揮最大效用。",
      "4": "外在環境開始對你施加更大的壓力和挑戰，但你發現這些阻力反而成為你成長的催化劑。你在實戰中不斷調整和優化自己，承受挫折的能力明顯提升。內心雖然偶爾會感到疲憊，但更多的是一種被磨練後的充實感。環境的考驗讓你的能力得到真正的驗證和提升。",
      "5": "你的能力終於得到了權威的認可，環境給你開了綠燈，重要的機會和責任開始向你傾斜。內心充滿了被信任的喜悅和責任感，但你保持著謹慎的態度，知道不能一次性把所有籌碼都押上。外在環境雖然支持你，但你明智地選擇分批展現實力，確保每一步都穩妥可控。",
      "6": "你已經完成了這一輪的積累和成長，現在是戰略性休整的時候。內心感到一種深層的滿足，因為你知道自己已經具備了足夠的實力。外在環境呈現出蓄勢待發的氛圍，各種機會正在醞釀中。你選擇耐心等待，保留實力，等待那個最佳的時機到來，屆時將是你真正發力的時刻。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖，此時應謙虛學習，順應環境調整自己的根基，不要急於展現實力。",
        "7": "你的根基扎實且正處於上升期，應該持續精進基本功，順應天時地利的趨勢，穩健地累積更深厚的實力底蘊。",
        "8": "你長期積累的基礎已顯僵化，難以適應新的挑戰，應認清現實局限，避免固執於過往經驗，重新檢視根本能力。",
        "9": "你的基礎能力雖然深厚但已達極限，應順應時勢轉變，將累積的底子轉化為新的發展方向，避免過度消耗既有根基。"
      },
      "2": {
        "6": "你在外表現出的能力還不夠穩定，容易讓人質疑你的實力。此時應該主動調整展現方式，收斂鋒芒，用更踏實的行動來證明自己的價值。",
        "7": "你展現出來的形象正符合時勢所需，具備了被重用的條件。繼續保持這種積極向上的外在表現，堅定地朝目標前進，必能獲得認可。",
        "8": "你過去建立的形象已經固化，難以在短時間內改變他人對你的既定印象。認清這個現實，暫時避免強求改變，等待更好的時機再行動。",
        "9": "你一直以來的強勢表現已經到了轉折點，繼續硬撐只會適得其反。順應變化，適時展現謙遜柔和的一面，反而能獲得更多支持。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，適時調整學習方向和發展策略，順應內心真實需求，靈活修正過去的固執想法，才能開啟新的成長空間。",
        "7": "你的成長動能正值上升趨勢，堅持當前的努力方向，持續累積實力與經驗，保持積極進取的態度，未來必能突破現有格局。",
        "8": "你已在舒適圈停留太久，認清自身局限性是成長的第一步，避免重複無效的努力模式，重新審視真正需要提升的核心能力。",
        "9": "你過去的成功模式已達極限，順應時代變化調整成長策略，放下既有優勢的執著，謙虛學習新領域才能延續發展動力。"
      },
      "4": {
        "6": "你面對的外在環境正在微妙變化，雖有不確定性但也蘊含轉機，應當敏銳觀察市場動向，適時調整策略以順應這股變化的潮流。",
        "7": "你所處的外在條件正值上升趨勢，各方面環境都對你有利，應當把握這個黃金時機，堅定信念持續推進既定計畫向前發展。",
        "8": "你面臨的外在環境已形成固化格局，既有的不利因素短期內難以改變，應當務實認清現狀，暫時避開正面衝突尋求其他出路。",
        "9": "你眼前看似強勢的外在環境實已接近轉折點，舊有的優勢條件即將消退，應當順應這個自然變化提前做好應對準備。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變動雖然還不明顯，但已透露出重要訊息，你應該敏銳捕捉這些信號，及時調整自己的策略和行動方向。",
        "7": "你看見外在大勢正朝著有利方向發展，各種條件都在成熟中，這是順應天時地利的絕佳時機，你應該堅持既定路線，積極把握當前的良好局面。",
        "8": "你面對的外在環境已經形成穩固的既定格局，各種力量盤根錯節難以撼動，你必須認清現實限制，避開正面衝突，尋找其他可行的路徑。",
        "9": "你察覺外在的強勢力量已到達頂峰開始轉弱，舊有的秩序正在鬆動，你應該順應這個轉變趨勢，準備迎接即將到來的新局面和新機會。"
      },
      "6": {
        "6": "你察覺到外在環境正在微妙變化，趨勢尚未明朗但已有徵兆，此時應保持敏銳觀察力，隨時準備調整策略以順應即將到來的轉變。",
        "7": "你看見外在大勢正朝著有利方向發展，天時地利人和皆在你這一邊，應堅定信念持續前進，不要因小波動而動搖既定方針。",
        "8": "你面對的外在環境已形成強大阻力，舊有模式根深蒂固難以撼動，現在需要認清現實限制，避免硬碰硬的無謂消耗。",
        "9": "你觀察到外在強勢已達頂峰開始轉弱，舊秩序即將瓦解新局面將要展開，應順應這股轉變力量，為下一階段做好準備。"
      }
    }
  },
  "27": {
    "number": 27,
    "name": "頤",
    "code": "100001",
    "卦解": "你現在就像在一個安靜的休息站裡，能量雖然不算充沛，但內心外在都保持著一種穩定的平衡感。周圍的節奏不急不徐，沒有太多波瀾起伏，一切都在緩慢而穩定地進行著。你可能感覺進展有些緩慢，但這種狀態並不令人焦慮，反而有種踏實的安全感。就像在等待適當時機，各種條件正在悄悄地聚攏整合，雖然表面上變化不大，但底下有股持續的力量在默默累積著。",
    "六階段": {
      "1": "你正處在一個需要重新建立基礎的時刻。內心有種飢餓感，渴望獲得更多知識和資源來充實自己。周遭環境相對簡樸，但這正是你重新審視自身需求的好時機。你開始明白什麼是真正必要的養分，什麼只是表面的裝飾。這個階段雖然樸素，但你內心踏實，知道自己正在為未來打下堅實的根基。",
      "2": "你的日常節奏開始穩定下來，有了固定的學習或工作模式。內心感到安定，因為這種規律帶來了可預期的成長。環境也逐漸配合你的步調，提供持續而穩定的支持。你發現自己的表現越來越一致，不再像之前那樣起伏不定。這種穩定感讓你更有信心面對各種挑戰。",
      "3": "你正在經歷一個精細調整的過程，需要反覆修正自己的方向和方法。內心有些焦慮，因為總覺得還不夠完美。外在環境變化較多，需要你不斷適應和調整。雖然這個過程有點累人，但你知道這些細膩的調整是必要的，它們正在釋放你更深層的潛力，讓你的能力更加精進。",
      "4": "外在的支援系統開始穩定運作，你需要的資源和工具都能及時到位。內心感到輕鬆許多，因為不再需要為基本條件擔憂。環境對你的支持度明顯提升，合作關係也更加順暢。你發現自己可以把更多精力投入在核心工作上，而不用分心處理瑣碎的供應問題。這種外在條件的改善讓你更有餘力發揮。",
      "5": "你現在處在一個需要做重要選擇的位置，能夠主導整個發展方向。內心充滿智慧和判斷力，知道如何在眾多選項中找到最佳平衡。環境給你足夠的權限和資源來實現你的規劃。你不僅要照顧自己的需求，也要考慮整體的和諧發展。這個階段讓你感受到領導者的責任與成就感。",
      "6": "你站在一個週期的尾聲，開始總結這段時間的經驗和成果。內心既有成就感，也有對未來的思考。環境趨勢指向新的可能性，但你更注重那些經得起時間考驗的方法和原則。你正在整理這段歷程中最有價值的部分，準備將它們轉化為長期可用的資產，為下一個階段做好準備。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖，此時應順應當下情況靈活調整學習方向，不要固執於單一技能的鑽研。",
        "7": "你的根基正處於良好的成長軌道，應該持續深耕現有的核心能力，按部就班地累積實力，這是建立長遠競爭優勢的關鍵時期。",
        "8": "你長期忽視基本功的培養，現在已積習難改，必須認清這個現實，避免好高騖遠，從最基礎的能力開始重新打底。",
        "9": "你過度依賴既有的技能優勢已到極限，應該順應時代變化主動轉型，將累積的經驗智慧轉化為新領域的學習基礎。"
      },
      "2": {
        "6": "你目前的外在形象容易給人不穩定的印象，應該主動調整言行舉止，讓自己在他人面前展現更加穩重可靠的一面。",
        "7": "你現在展現出來的樣子正合時宜，繼續保持這種積極正面的外在表現，讓別人看到你的專業與自信。",
        "8": "你過去建立的外在形象已經定型且難以改變，不如接受現實，專注於內在修養而非刻意改變他人對你的看法。",
        "9": "你之前強勢的外在表現已到極限，現在該順應情勢調整姿態，展現更加謙和包容的一面會更有利。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該順應內在的直覺調整發展方向，不要固執於原有計劃，靈活修正才能把握真正適合的成長機會。",
        "7": "你的成長動能正順應天地自然規律，應該堅持目前的努力方向持續前進，保持內在的積極態度，這是擴展潛力的最佳時機。",
        "8": "你過去的成長模式已經積習難改，必須認清現實避開舊有的限制思維，放下包袱才能為未來的發展創造新的可能空間。",
        "9": "你的成長力量已達高峰開始轉化，應該順應這個自然轉變過程，將累積的經驗智慧轉化為新階段的發展基礎和動力來源。"
      },
      "4": {
        "6": "你面對的外在環境正在波動變化，這是調整策略的好時機，密切觀察市場動向，靈活修正你的行動方針以適應新局面。",
        "7": "你所處的外在條件正順應天時地利，環境基本面對你有利，堅持既定方向持續前進，把握這股良好趨勢創造更大成果。",
        "8": "你面臨的外在環境已形成不利格局且難以改變，認清這個現實並暫時避開正面衝突，等待更合適的時機再行動會更明智。",
        "9": "你觀察到外在環境的強勢已接近尾聲，準備迎接即將到來的轉變，順應這個趨勢調整你的策略以把握新的機會。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變動雖然不穩定但充滿機會，順應這些變化調整你的策略，將能在養育發展的道路上找到新的突破口。",
        "7": "你看見外在環境正朝著有利的方向發展，天時地利皆在你這一邊，保持現在的前進步調，持續在養育耕耘的路上穩健推進，成果指日可待。",
        "8": "你面對的外在環境已經形成難以撼動的固化格局，與其硬碰硬消耗自己，不如認清現實暫時避開鋒芒，等待更適合的時機再投入養育事業。",
        "9": "你察覺外在環境的強勢已達頂峰開始轉折，舊有的模式即將改變，順應這個轉變的趨勢調整方向，將為你的養育計畫開啟全新的可能性。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動期，趨勢尚未明朗，此時應保持彈性思維，隨時準備根據新出現的訊號調整你的策略方向。",
        "7": "你看見外在大勢正朝著有利的方向發展，天時地利皆順，你應該堅定信心，持續朝既定目標前進，不要輕易改變路線。",
        "8": "你面對的外在環境已經形成固化的不利格局，舊有模式積重難返，你需要認清現實，暫時避開正面衝突，另尋出路。",
        "9": "你所處的外在環境即將從高峰轉向，強勢局面已是強弩之末，你要順應這個轉變趨勢，提前做好因應準備。"
      }
    }
  },
  "28": {
    "number": 28,
    "name": "大過",
    "code": "011110",
    "卦解": "你現在處在一個力量偏強但需要謹慎拿捏的狀態。就像站在一座結實卻略顯沉重的橋上，雖然有足夠的支撐力，但也感受到某種微妙的壓力。你的內在和外在環境保持著平衡，沒有太大的衝突或失調，整體節奏也算穩定。這段時間變化不會太劇烈，更像是在積蓄能量，等待更好的時機。你能感覺到各個環節正在慢慢磨合，雖然推進的速度不算快，但每一步都在為未來奠定基礎。",
    "六階段": {
      "1": "你正面對著超出預期的重大挑戰，內心感到壓力山大，就像肩膀突然被壓上沉重負擔。這時你開始仔細檢視自己的能力底線，找出最脆弱的環節。周圍的人還沒意識到問題的嚴重性，但你已經開始擔心是否能承受得住。這種謹慎的態度是對的，因為只有先了解自己的極限，才能制定出可行的應對策略。",
      "2": "你學會了巧妙分配重量，不再硬扛所有壓力，內心逐漸找到平衡點。你發現從兩端輕柔地開始處理問題，讓中間部分逐步承擔重任，這樣可以避免一次性崩潰。身邊的環境開始配合你的節奏，大家都看出你在用更聰明的方式處理困境。這種循序漸進的方法讓你重新燃起信心，覺得這個看似不可能的任務也許真的能完成。",
      "3": "危機信號開始浮現，你內心感到緊迫但不慌亂，因為你已經準備好應急方案。裂縫雖然出現了，但你同時進行加固和尋找替代方案，展現出危機處理的智慧。外在環境變得更加嚴峻，時間壓力增加，但你的雙管齊下策略讓周圍的人對你刮目相看。這個階段考驗的是你在壓力下的應變能力和執行力。",
      "4": "外界的支援及時到來，你內心感到如釋重負，不再是孤軍奮戰。臨時的支撐系統讓整個局面穩定下來，雖然還不是最終解決方案，但至少可以維持正常運作。環境條件明顯改善，有了更多資源和人力協助。你發現有時候適時求援並不是weakness，而是智慧的表現，這讓你對接下來的挑戰更有把握。",
      "5": "你成功通過了最關鍵的考驗，內心充滿成就感但仍保持警覺。雖然承載的壓力達到高峰，但在你的掌控範圍內，你快速而穩定地度過了最危險的階段。外在環境呈現高張力狀態，所有人都屏息關注你的表現。這是整個過程中最精彩的時刻，你的專業能力和心理素質都得到了完美展現，為最終的成功奠定了基礎。",
      "6": "任務完成，你內心感到深深的滿足和解脫，同時也有種重新開始的輕鬆感。你開始卸下重擔，拆除那些臨時的支撐設施，但很有智慧地留下了完整的經驗總結和標準規範。外在環境逐漸回歸平靜，但因為你的努力，整個系統變得更加穩固和完善。你不僅解決了當前的危機，更為未來類似挑戰建立了寶貴的參考框架。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力雖有不足，但正因靈活可變，此時應主動修正自己的根基，透過學習和練習來彌補底子的薄弱，為面對過度的挑戰做好準備。",
        "7": "你的基本功扎實且正在成長軌道上，應該持續強化這些核心能力，保持學習的節奏和方向，讓穩固的根基成為你應對大過局面的有力支撐。",
        "8": "你過去累積的基礎已經僵化難以改變，必須認清這個現實限制，避免勉強突破既有框架，反而要在現有能力範圍內尋找適合的應對方式。",
        "9": "你的基礎能力已達巔峰但開始疲乏，應該順應這個轉變，主動調整過於依賴舊有技能的習慣，培養新的底子來因應時代的變化需求。"
      },
      "2": {
        "6": "你的外在形象容易搖擺不定，此時應該主動調整表達方式，讓自己在他人面前展現更穩重的一面，避免因言行反覆而失去信任。",
        "7": "你展現出的積極態度正合時宜，繼續保持這種向上的外在形象，讓別人看到你的決心與能力，這將為你帶來更多支持與機會。",
        "8": "你過度沉重的外在表現已經積習難改，不如暫時收斂鋒芒，認清自己給人的印象過於嚴肅，學會在適當時機展現輕鬆的一面。",
        "9": "你一直以來的強勢表現已到極限，是時候調整外在姿態，學會示弱與合作，讓別人感受到你的謙遜，才能重新獲得好感。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該靈活調整學習方向和發展策略，不要固執於原有計劃，順應環境變化來修正自己的能力培養重點。",
        "7": "你具備良好的成長基礎和發展勢頭，應該堅持當前的努力方向，持續投入時間精力提升核心技能，順天時而進取必有所獲。",
        "8": "你在某些領域的舊有模式已難以突破，應該認清現實限制，避免在低效領域浪費精力，轉向更有潛力的新方向重新積累。",
        "9": "你過往的優勢已達頂峰開始衰退，應該順應時勢轉變，主動學習新技能新思維，將經驗智慧轉化為指導他人成長的能力。"
      },
      "4": {
        "6": "你需要密切觀察外在環境的微妙變化，當發現條件開始轉向不利時，要靈活調整策略，不要固執於原有計畫，順勢而為才能化解危機。",
        "7": "你所面對的外在環境正朝著有利方向發展，天時地利皆備，此時應該堅定信念繼續前進，把握這個難得的良好時機積極行動。",
        "8": "你必須正視外在環境已經惡化到難以扭轉的程度，積重難返的局面不是你能改變的，明智的選擇是暫時避開，等待時機轉變。",
        "9": "你察覺到外在的有利條件已達頂峰開始衰退，強弩之末的趨勢無法逆轉，順應這個轉變並提前做好應對準備是當務之急。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變化雖然還不明顯，但已經釋出調整的訊號，你應該保持敏銳度，隨時準備順應這些新的趨勢。",
        "7": "你看到外在大勢正朝著有利的方向發展，天時地利都在支持當前的進展，你應該把握這個順勢而為的時機，堅定地維持前進步調。",
        "8": "你面對的外在現實已經形成難以撼動的既定格局，積累的問題和阻力超出了個人能力範圍，你必須認清這個現實，選擇迴避正面衝突。",
        "9": "你察覺外在的強勢局面已經到了轉折點，過度的力量開始顯露疲態，你需要順應這個即將到來的轉變，準備迎接新的局面。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，這些變化雖然還不明顯，但已經顯露端倪。你應該保持敏銳觀察力，隨時準備根據環境趨勢的轉向來調整自己的策略方向。",
        "7": "你看見外在大勢正朝著有利方向發展，各種跡象都指向積極的未來走向。你要把握這個順勢而為的時機，堅定地朝既定目標前進，不要被小波動影響判斷。",
        "8": "你面對的外在環境已經形成強大阻力，各種不利因素積累成難以撼動的趨勢。你必須認清這個嚴峻現實，避免與大勢對抗，保存實力等待更好的時機。",
        "9": "你察覺外在的強勢已達頂峰，即將轉向另一個循環階段，變化在所難免。你要順應這個自然轉變，放下對過往模式的執著，準備迎接新的環境格局。"
      }
    }
  },
  "29": {
    "number": 29,
    "name": "坎",
    "code": "010010",
    "卦解": "你現在就像在一條緩緩流動的溪流中，雖然水勢不算強勁，但至少能感受到前進的方向。周圍的環境相對穩定，內心與外在世界達到了某種微妙的平衡狀態。你可能會覺得進展有些緩慢，但並非完全停滯，而是在一種溫和的節奏中慢慢積累著能量。這段時間給人一種安靜而持續的感覺，就像細水長流，雖然不驚天動地，卻有著自己的韻律和方向。",
    "六階段": {
      "1": "你剛踏入這個充滿挑戰的領域，立刻感受到處處是陷阱。內心既緊張又謹慎，像走在薄冰上一樣小心翼翼。你開始學會觀察哪裡有風險，哪些地方需要特別留意，這種摸索的過程雖然讓人不安，但也讓你對困難有了初步認識。周圍的環境對你來說還很陌生，每一步都需要試探，但這份警覺心正是你建立穩固基礎的開始。",
      "2": "經過一段時間的磨練，你開始掌握一些訣竅，知道在哪些關鍵點可以安全通過。內心的恐懼逐漸被經驗取代，你開始有了一些自信，雖然還不敢大意。你發現有些固定的方法和路線是可靠的，這讓你在面對困難時有了可以依循的模式。環境對你來說不再完全陌生，你開始能夠預測一些狀況，並且知道如何應對。",
      "3": "你以為已經熟悉了規律，卻發現困難總是以新的形式出現。內心感到挫折，有時候會懷疑自己的判斷，甚至想要放棄重新開始。你發現之前的方法不總是有效，需要不斷調整策略，這種反覆的過程讓人疲憊。環境變得更加複雜多變，暗流湧動，你需要更多的耐心和毅力來面對這些看不見的挑戰，學會在挫敗中找到前進的方向。",
      "4": "你開始意識到光靠經驗還不夠，需要建立更完善的防護措施。內心變得更加務實和周到，你學會為自己準備後備計劃。你開始設置各種安全網，讓自己即使失足也不會跌得太重。外在環境開始出現一些支持系統，可能是朋友的建議、專業的工具，或是更好的資源配置，這些都讓你在面對困難時有更多選擇和保障。",
      "5": "你終於開始真正理解困難的本質和規律，內心感到前所未有的清明和自信。你不再被表面的困擾所迷惑，而是能夠看透問題的核心，選擇最有效的解決方式。這種洞察力讓你的行動變得更加精準有效，不再浪費時間在錯誤的方向上。外在環境也配合你的成長，提供了更好的條件和機會，讓你能夠充分發揮自己的能力。",
      "6": "就在你以為快要完全脫離困境的時候，你發現最後這段路依然需要保持警覺。內心雖然充滿期待，但也明白不能掉以輕心，勝利就在眼前但還沒完全到手。你學會了在接近成功時更加專注，不讓最後的疏忽毀掉之前的努力。外在環境看似平靜，但仍有一些潛在的滑點需要小心應對，只有堅持到最後一刻，才能真正走出這片困難的區域。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外界變化而動搖，此時應該順應當前處境，靈活調整學習方向和努力重點，不要固執於原有計畫。",
        "7": "你的根基正在穩健成長，這是打造實力的黃金時期，應該堅持當前的努力方向，持續深耕基本功，為未來發展奠定堅實底子。",
        "8": "你長期累積的基礎問題已經根深蒂固，難以快速改變，應該認清現實限制，避免勉強突破，轉而尋找能發揮現有能力的合適領域。",
        "9": "你過去建立的基礎能力已達頂峰但開始衰退，應該順應這個轉變階段，主動尋求新的學習領域，讓經驗智慧轉化為不同形式的根基。"
      },
      "2": {
        "6": "你目前展現的形象容易讓人產生誤解，應該主動調整外在表現方式，讓真實的能力和善意更清楚地被他人看見和理解。",
        "7": "你現在展現出來的專業形象正符合時勢所需，應該繼續保持這種積極進取的外在表現，讓更多人看到你的實力和決心。",
        "8": "你過去塑造的形象已經定型且難以改變，與其勉強扭轉他人印象，不如認清現實，專注做好實質工作勝過表面功夫。",
        "9": "你一直以來的強勢表現已到轉換時刻，應該主動展現更柔和謙遜的一面，讓外在形象隨著環境變化而自然轉型。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，面對內心的不確定感時，主動調整學習方向和能力培養重點，將這份敏感轉化為適應變化的優勢。",
        "7": "你具備穩定向上的成長動能，持續在既定的能力提升路徑上前進，順應自然發展節奏，讓潛力在堅持中逐步綻放光芒。",
        "8": "你需認清當前能力發展已陷入僵化模式，主動避開固有思維的束縛，重新審視成長方向，才能突破現有的發展瓶頸。",
        "9": "你的某些能力已達高峰開始轉折，順應這個自然循環，主動將過往經驗昇華為智慧，為下一階段的成長蓄積新的能量。"
      },
      "4": {
        "6": "你面對的外在環境正在快速變化，危機中蘊含轉機，保持靈活應變的心態，隨時調整策略以配合環境的變動節奏。",
        "7": "你所處的外在條件呈現穩定向上的趨勢，這是推進計畫的有利時機，堅持既定方向持續前進，順應大勢而為。",
        "8": "你面臨的外在環境已陷入深層困境，積弊難改，現實條件極不利於行動，認清局勢暫時避讓是明智選擇。",
        "9": "你觀察到外在環境的強勢已達頂點開始轉弱，舊有格局即將改變，順應這個轉折趨勢調整自己的定位和策略。"
      },
      "5": {
        "6": "你觀察到外在環境正處於變動不定的狀態，各種訊息混雜難辨，此時應保持彈性思維，隨時準備根據新的情況調整自己的判斷和策略。",
        "7": "你看見外在大勢正朝著有利的方向發展，各項條件逐漸成熟，應該堅定信心繼續按照既定方向前進，不要被小波動影響判斷。",
        "8": "你面對的外在環境已經形成頑固的困難局面，各種阻礙根深蒂固難以撼動，應該認清現實避開正面衝突，尋找其他突破點。",
        "9": "你察覺外在的強勢力量已達顛峰開始轉弱，舊有格局即將鬆動，應該順應這個轉換時機，準備迎接即將到來的新局面。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，這些不穩定的趨勢提醒你要保持靈活應變的態度，隨時準備調整策略以順應即將到來的轉機。",
        "7": "你看見外在大勢正朝著有利方向發展，這股順天應時的趨勢值得你堅持既定方向，穩健前進不偏離正道，必能乘勢而起。",
        "8": "你面對的外在環境已陷入深層困局，積累已久的問題難以逆轉，你需要認清現實避開這股逆流，另尋出路才是明智之舉。",
        "9": "你察覺外在強勢已達頂峰開始轉弱，這個轉折點提醒你要順應這股變化之勢，及時調整立場迎接新的環境循環。"
      }
    }
  },
  "30": {
    "number": 30,
    "name": "離",
    "code": "101101",
    "卦解": "你現在就像一團明亮的火焰，內在能量充沛，光芒四射，但這份熱情在向外推展時卻遇到不少阻礙。你的內心世界和外在表現保持著微妙的平衡，不會過度內斂也不會太過張揚。雖然前進的路上有些磕磕絆絆，讓你感覺步調時快時慢，但你的根基是穩固的。這段時間變化不會太劇烈，反而像是在默默積蓄力量，等待各個環節慢慢接軌，然後穩步向前推進。",
    "六階段": {
      "1": "你內心深處那股熱情終於被點燃了，就像黑暗中突然亮起的火光，讓你清楚看見自己真正想要的是什麼。這份初始的光亮雖然還不穩定，但已經足以照亮前方的道路。你感到一種久違的興奮和期待，彷彿找到了人生的方向感。周圍的人也開始注意到你身上的改變，那種從內而外散發的光芒讓你顯得格外有魅力。",
      "2": "你的能力開始穩定展現，就像調好亮度的燈光，讓一切都變得清晰可見。你對自己的表現越來越有信心，處理事情的效率也大幅提升。內心感到踏實和安定，不再像之前那樣患得患失。身邊的環境變得友善支持，人們開始信任你的判斷和能力，願意將重要的事情交給你處理，這讓你更加確信自己走在正確的路上。",
      "3": "你發現自己的潛能就像閃爍的光影，時而明亮時而暗淡，讓你感到既興奮又困惑。有時候你能發揮出超乎想像的能力，有時候卻又回到平凡。內心有些焦慮，擔心無法掌控這股力量。周遭環境也變得複雜多變，需要你更仔細地觀察和調整。這是一個需要校正和平衡的階段，學會在光明與陰影間找到最適合的節奏。",
      "4": "外在環境開始對你產生正面回應，就像光線遇到了良好的反射面，你的影響力得到放大和傳播。你感受到一種被世界接納的溫暖，原本的努力終於得到應有的認可。周圍的人不僅支持你，更主動幫你宣傳和推廣。機會開始主動找上門來，各種合作邀請和發展機會讓你應接不暇。你開始意識到自己已經不再是孤軍奮戰。",
      "5": "你正站在聚光燈的中心，所有的注意力都聚焦在你身上，影響力達到了前所未有的高度。內心既感到自豪又承受著巨大的壓力，因為每個決定都會被放大檢視。環境對你極其有利，資源豐富，支持者眾多，但同時也意味著更大的責任。你必須謹慎地運用這份光芒，因為此時的你就像太陽一樣，能溫暖他人也能灼傷別人。",
      "6": "光芒開始逐漸減弱，就像夕陽西下留下溫柔的餘暉。你感到一種寧靜的滿足，知道該是沉澱和整理的時候了。內心很平和，對於這個循環的結束並不感到失落，反而有種完成使命的釋然。周遭環境也變得安靜祥和，給你充分的空間去回顧和總結。你開始將經驗和智慧封存起來，為下一次的光芒綻放做準備，相信時機成熟時會再次燃起。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖根基，此時應順應當下情況靈活調整學習方向，重新打造更適合的能力底子。",
        "7": "你的根基紮實且符合時代趨勢，這是持續精進的好時機，堅持在既有的能力基礎上深耕發展，必能開花結果。",
        "8": "你的舊有能力模式已難適應現況，與其勉強維持過時的技能，不如認清現實放下包袱，為學習新能力騰出空間。",
        "9": "你的核心能力已達高峰但開始顯露疲態，順應自然規律讓強項適度轉型，培養新的輔助技能來延續優勢。"
      },
      "2": {
        "6": "你的外在形象容易因小事而搖擺不定，此時應順應環境變化，適時調整自己的表現方式，不必過分堅持固有的形象包袱。",
        "7": "你展現出來的光明形象正合天時地利，應該保持這種積極正面的外在表現，繼續以誠待人，讓內在光明自然流露。",
        "8": "你的外在表現已形成固化印象難以改變，與其強求突破不如認清現實，暫時收斂鋒芒，避免不必要的形象衝突。",
        "9": "你過度張揚的外在表現已到極限，應該順應時勢轉為內斂，讓過於強烈的光芒適度收束，避免物極必反的結果。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該靈活調整學習方向和發展策略，不要固執於單一路徑，順應內心真實需求來修正努力的重點。",
        "7": "你具備穩定的成長動能，應該持續在既定方向上深耕努力，保持學習熱忱和進取心，這是累積實力的黃金時期。",
        "8": "你需要認清自身能力的現實限制，避免好高騖遠的成長計畫，專注於基礎能力的紮實建構，穩步提升才是王道。",
        "9": "你的某些優勢已達高峰，應該順應時勢轉換成長重點，將過往經驗轉化為新領域的養分，開創下一階段的發展空間。"
      },
      "4": {
        "6": "你需要密切關注外在環境的細微變化，當發現不利徵象時應立即調整策略，靈活應對才能避免陷入困境。",
        "7": "你應該把握當前有利的外在條件，順應大環境的發展趨勢，堅定地朝既定目標前進，時機正好。",
        "8": "你必須認清外在環境已經惡化且難以改變的現實，暫時避開不利因素，等待更好的時機再行動。",
        "9": "你要察覺外在環境正在從高峰轉向衰退，主動順應這個轉變趨勢，提前做好調整準備。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變化雖然還不穩定，但正是調整策略的好時機，順應這些新趨勢來修正你的方向。",
        "7": "你看見外在大勢正朝有利方向發展，天時地利都在支持你前進，現在應該堅定信念，維持既定路線不動搖。",
        "8": "你面對的外在環境已經形成強大阻力，舊有模式根深蒂固難以撼動，認清現實並暫時避開正面衝突是明智之舉。",
        "9": "你察覺外在強勢已達頂峰開始轉弱，原本的主導力量正在衰退，順應這個轉變趨勢來重新布局你的策略。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動期，趨勢尚未明朗，此時應保持敏銳觀察力，隨時準備調整策略方向，避免固守既定計畫而錯失轉機。",
        "7": "你看見外在大環境正朝著有利方向發展，天時地利人和皆具備，應該堅定信心持續推進現有計畫，順應這股正向趨勢前行。",
        "8": "你面對的外在環境已形成難以撼動的固化格局，強行對抗只會徒勞無功，應該認清現實限制，尋找其他可行路徑或暫時退守。",
        "9": "你感受到外在環境的強勢即將轉弱，舊有格局正在鬆動，應該順應這個轉變契機，準備迎接新局面的到來，不要抗拒變化。"
      }
    }
  },
  "31": {
    "number": 31,
    "name": "咸",
    "code": "001110",
    "卦解": "你現在處於一種微妙的感應狀態中。就像兩個頻率相近但不完全同步的收音機，時而清晰時而模糊。你與周圍的人事物有著某種連結，但這種連結並不順暢，總是遇到一些阻礙和延遲。\n\n外在的影響力比你內在的能量更強一些，讓你感覺像是在被動回應多過主動出擊。整體氛圍有種「想要但得不到」的微妙張力，就像隔著一層薄霧看風景，輪廓清晰但細節朦朧。變化在緩慢發生，但步調並不如你所願。",
    "六階段": {
      "1": "你開始感受到內心深處的某種觸動，那是一股微妙而真實的感應力量。過往看似平靜的內在世界，現在開始有了細微的波動和共鳴。你發現自己對周遭的人事物變得更加敏感，能夠察覺到以前忽略的細節。這種新生的感受力讓你既興奮又有些不安，因為它打開了一扇通往更深層連結的門。環境中開始出現一些小小的回應，彷彿在驗證你內心的這份覺醒。",
      "2": "你的表達變得更加自然流暢，內心的感受能夠透過各種方式傳達出去。無論是言語、行動還是眼神，都帶著一種真誠的感染力。你發現自己不需要刻意表演或偽裝，真實的情感就能引起他人的共鳴。這種狀態讓你感到輕鬆愉悅，因為終於可以做最真實的自己。周圍的人也開始回應你的真誠，互動變得更加溫暖有趣，形成了良性的情感循環。",
      "3": "你意識到自己擁有強大的感化潛力，這份天賦正在慢慢顯現。內心充滿著一種躍躍欲試的能量，你知道自己可以在人際關係中創造更深刻的影響。這種認知帶來了信心，同時也讓你更加謹慎地運用這份能力。你開始理解什麼是恰到好處的感應，既不過度也不保守。環境為你提供了各種練習和發揮的機會，讓你的潛力得以在實際互動中得到驗證和提升。",
      "4": "外在環境變得格外有利於交流和連結。你會發現人們比平常更容易敞開心扉，願意分享內心的想法和感受。社交場合變得活躍，各種聚會、會議或偶遇都帶著特別的溫度。這種氛圍讓你感到舒適自在，因為不需要費力就能與他人建立良好的關係。周圍的人事物彷彿都在釋放善意的信號，為深度的感應和交流創造了絕佳的條件。",
      "5": "你處於人際關係的核心位置，能夠自然地協調和影響整個群體的氛圍。內心充滿著掌控感和滿足感，因為你發現自己的感應力能夠帶來實際的效果。無論是在工作還是生活中，你都能敏銳地察覺到關鍵時刻，並做出恰當的回應。環境對你的反饋非常積極，人們願意聽取你的意見，信任你的判斷。這種狀態讓你感到充實而有意義，彷彿找到了自己的使命所在。",
      "6": "感應的能力已經完全融入你的日常生活，不再是刻意為之，而是自然而然的存在狀態。內心變得平靜穩定，你知道什麼時候該主動感應，什麼時候該保持距離。這種智慧讓你在人際關係中遊刃有餘，既能深度連結又不會過度涉入。環境也趨於穩定和諧，各種關係都找到了舒適的平衡點。你已經學會了如何在保持自我的同時，與世界建立美好的感應關係。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外界變化而動搖，此時應順勢調整學習方向，不要急於展現，先紮實根基再求發展。",
        "7": "你的基本功底正處於上升期，順應天地自然的成長節奏，持續精進核心能力，維持這股向上的學習動能不懈怠。",
        "8": "你長期累積的基礎能力已形成固化模式，難以快速改變，應認清現實接受限制，避免勉強突破而耗損根基。",
        "9": "你的基礎能力已達顛峰狀態，繼續硬撐反而會走下坡，順應自然轉變規律，開始培養新的能力領域為未來鋪路。"
      },
      "2": {
        "6": "你目前的外在表現容易讓人產生誤解或反感，應該及時調整自己的言行舉止，讓別人看到更真實溫和的一面，避免因衝動而破壞人際關係。",
        "7": "你現在展現出來的形象正符合時勢所需，應該繼續保持這種積極正面的外在表現，讓自己的魅力和能力自然流露，持續向前發展。",
        "8": "你長期以來的外在形象已經定型且難以改變，與其強行扭轉不如認清現實，暫時收斂鋒芒，避免在不利的情況下繼續強出頭。",
        "9": "你過去強勢的外在表現已經到了轉折點，應該順應變化主動軟化姿態，讓自己從強硬轉向柔和，才能在新局面中重新獲得認同。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該靈活調整學習方向和發展策略，不要固守舊有模式，順應內在變化來修正自己的能力提升路徑。",
        "7": "你的成長空間正值上升趨勢，應該堅持當前的努力方向，持續投入時間和精力來強化核心能力，順勢而為地推進個人發展計畫。",
        "8": "你需要認清目前成長受限的現實狀況，避免在已經飽和的領域過度投入，重新審視自己的發展瓶頸，尋找突破的新方向。",
        "9": "你過往累積的優勢已達頂峰，應該順應轉變的時機，主動開拓新的成長領域，將既有實力轉化為下一階段發展的基礎。"
      },
      "4": {
        "6": "你需要密切觀察外在環境的微妙變化，當發現不利訊號時要及時調整策略，保持靈活應變的態度，避免固執己見而錯失轉機。",
        "7": "你應該把握當前有利的外在條件，順應大環境的正面趨勢持續前進，但要保持警覺心，隨時準備因應可能的變化。",
        "8": "你必須正視外在環境已經形成的不利局面，暫時避開正面衝突，等待更好的時機再行動，切勿逆勢而為。",
        "9": "你要認清外在優勢已達高峰即將轉變，主動順應這個轉換期，提前布局新的方向，而非執著於過往的成功模式。"
      },
      "5": {
        "6": "你看到外在環境正在微妙變化，這些變動雖然還不穩定，但正是調整策略的好時機，順應這些變化來修正你的方向。",
        "7": "你觀察到外在環境呈現積極向上的趨勢，各種條件都在朝有利方向發展，堅持當前路線繼續前進就對了。",
        "8": "你面對的外在環境已經形成固化格局，既有的結構和規則難以撼動，認清這個現實並避開正面衝突為上策。",
        "9": "你注意到外在環境的強勢局面已接近轉折點，舊有的力量開始衰退，順應即將到來的新變化才是明智之舉。"
      },
      "6": {
        "6": "你察覺到外在環境正處於變動期，這些微妙的轉變雖然還不明顯，但已經開始影響整體趨勢，你應該保持敏銳觀察並適時調整策略方向。",
        "7": "你看見外在環境正朝著有利的方向發展，各種跡象都顯示這股趨勢會持續一段時間，你應該堅持既定路線並把握這個順勢前進的機會。",
        "8": "你必須正視外在環境已經形成了難以撼動的固化趨勢，這些既定的格局短期內不會改變，你應該避免硬碰硬並尋找其他突破口。",
        "9": "你觀察到外在環境的強勢發展已經到達頂點，即將面臨轉折或衰退的階段，你應該順應這個即將到來的變化並提前做好準備。"
      }
    }
  },
  "32": {
    "number": 32,
    "name": "恆",
    "code": "011100",
    "卦解": "你現在處在一種穩定但不算突出的狀態中。外在環境雖然平靜，但你內心的能量比表面看起來更充實一些。整個節奏不快不慢，像是河水緩緩流淌，沒有太大的波瀾起伏。你會發現很多事情都在按部就班地進行，雖然看不到立即的重大變化，但各個環節正在慢慢磨合，形成更好的配合。這是一個積蓄力量的時期，內在的準備比外在的行動更重要。",
    "六階段": {
      "1": "你開始意識到自己攤子鋪得太大，各種承諾和計畫讓你分身乏術。內心有種疲憊感，但同時也有種解脫的渴望。你決定主動收手，把那些不必要的項目先停下來，專注在最重要的事情上。周圍的人可能會有些意外，但你知道這是為了長遠考慮。這種回歸本質的感覺讓你內心逐漸平靜下來。",
      "2": "經過初步整理後，你明顯感受到生活節奏變得輕快許多。那些真正重要的事情開始浮現，而那些可有可無的雜務自然而然地淡出你的視線。你的效率明顯提升，做事更有章法。內心感到一種久違的清爽，就像大掃除後的房間一樣舒適。身邊的人也開始注意到你的改變，給予正面的回饋。",
      "3": "你持續在細節上做調整，每一個流程都在優化中。溝通變得更直接，不必要的中間環節被省略。你發現自己有更多潛力可以發揮，因為不再被瑣事綁住手腳。內心有種逐漸清晰的感覺，對於什麼該做、什麼不該做有了更準確的判斷。環境也開始配合你的節奏，一切都朝著更簡潔的方向發展。",
      "4": "在對外合作上，你開始採取更謹慎的策略，選擇那些真正匹配的夥伴。你不再追求大而全，而是專注在小而美的合作模式上。這樣的轉變讓你在談判時更有底氣，也更容易達成共識。外在環境對這種務實的態度給予正面回應，合作關係變得更穩固。你感受到一種踏實的安全感。",
      "5": "你的核心資源配置已經趨於完美，每一分力氣都用在刀口上。工作產出變得穩定而有品質，不再有忽高忽低的波動。內心感到一種成熟的自信，知道自己的節奏和方向都是對的。外在環境也開始認可你的專業度，機會和資源自然向你靠攏。這種穩定的狀態讓你既有成就感，又保持著內心的平和。",
      "6": "整個瘦身過程已經完成，你現在擁有一個更精簡但更強韌的系統。就像一部經過調校的機器，運行起來更順暢也更耐用。你內心有種完成蛻變的滿足感，同時也開始期待下一個階段的挑戰。外在環境呈現出新的可能性，你知道是時候為下一輪的成長做準備了。這種蓄勢待發的感覺讓你充滿期待。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外界變化而動搖，此時應順勢調整學習方向，不斷修正自己的根基，避免急於求成而忽略基本功。",
        "7": "你的底子扎實且具備成長潛力，正是順應天地自然趨勢的時機，應持續維持當前的學習與積累方向，穩步前進不偏離正道。",
        "8": "你過去累積的舊習或錯誤基礎已根深蒂固，積重難返，必須認清現實，避免繼續在錯誤的根基上建構，重新檢視基本能力。",
        "9": "你的基礎能力雖然深厚但已達極限，強弩之末難以持久，應順應轉變的時機，將既有底子轉化為新的發展方向。"
      },
      "2": {
        "6": "你目前的外在表現容易給人搖擺不定的印象，應該適時調整展現方式，讓別人看到你更穩定可靠的一面，建立持久的信任關係。",
        "7": "你的外在表現正展現出穩健恆久的特質，這正符合天地運行的自然節奏，繼續保持這種一致性的展現，將為你帶來長遠的成功。",
        "8": "你長期以來的外在形象已經固化，旁人對你的印象難以改變，與其強求突破不如接受現實，在既有框架內發揮你的優勢。",
        "9": "你過度強勢的外在表現已到了需要轉換的時候，學會以更柔和包容的方式與人互動，順應情勢變化調整你的展現風格。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，不必堅持固定模式，靈活調整學習方向和發展策略，順應內心真實需求來修正自己的能力建構路徑。",
        "7": "你具備穩健的成長動能，持續在既定方向上精進自己，保持學習的恆心與毅力，這是你未來發展最可靠的基石和優勢所在。",
        "8": "你需要認清現有能力的局限性，避免在已經僵化的領域繼續投入，轉而尋找更有潛力的新方向來開發自己的成長空間。",
        "9": "你當前的能力發展已達高峰，應該順應自然規律準備轉型，將accumulated經驗轉化為指導他人的智慧，開啟新的成長階段。"
      },
      "4": {
        "6": "你需要密切關注外在環境的細微變化，當發現不利因素時要及時調整策略，靈活應對才能維持長久發展的基礎。",
        "7": "你所處的外在環境正朝著有利方向發展，應該堅持既定方針，順應這股正面趨勢持續前進，時機正佳。",
        "8": "你面對的外在條件已形成不利格局且難以改變，應該務實認清現實，避免硬碰硬，尋找其他發展路徑。",
        "9": "你察覺外在環境的有利條件已達頂峰開始轉變，此時應順應這個轉折點，提前佈局下一階段的發展方向。"
      },
      "5": {
        "6": "你發現外在環境正在微妙變化，此時需要敏銳觀察並靈活調整策略，不要固守舊有做法，順應變化才能維持長久穩定。",
        "7": "你所處的外在環境呈現良好趨勢，這是持續前進的最佳時機，保持現有方向和節奏，穩健推進既定計畫必能獲得成果。",
        "8": "你面對的外在局勢已經僵化難以改變，明智的做法是暫時避開正面衝突，認清現實限制，等待更好的時機再行動。",
        "9": "你觀察到外在環境的強勢已達頂峰開始轉折，此時應順應這個轉變趨勢，適時調整定位以迎接新的發展階段。"
      },
      "6": {
        "6": "你觀察到外在環境正在醞釀變化，雖然趨勢尚未明朗，但你應該保持敏銳觸覺，隨時準備調整策略以順應即將到來的新局面。",
        "7": "你看見外在大勢正朝著有利方向發展，天時地利皆在你這一方，你應該堅定信念持續前進，不要被小波折動搖了既定方針。",
        "8": "你面對的外在環境已經形成固化趨勢，積習難改的現實讓你難以撼動，你應該認清局勢避開正面衝突，另尋突破口。",
        "9": "你感受到外在強勢即將轉弱，盛極而衰的規律正在顯現，你應該順應這個轉變契機，及早布局迎接新的時代來臨。"
      }
    }
  },
  "33": {
    "number": 33,
    "name": "遯",
    "code": "001111",
    "卦解": "你現在處在一個蓄勢待發的狀態，內心雖然還在調整節奏，但外在環境其實對你相當有利。整體來說，你的處境是偏強的，只是進展的速度不快不慢，保持著穩定的平衡。你會發現短期內不會有太大的變化，但這並不代表停滯不前。反而像是在為下一步做準備，隨著各種條件逐漸到位，你的推進力會慢慢累積起來。這是個需要耐心但前景看好的階段。",
    "六階段": {
      "1": "你開始感受到周圍的壓力正在悄悄增加，像是空氣中瀰漫著緊張的氣息。你的直覺告訴你，現在不是擴張的時候，而是要把重要的東西收攏起來。你開始整理手邊的資源，把注意力拉回到最核心的事務上。雖然內心有些不安，但你清楚知道這是保護自己的必要行動。外在環境雖然還算穩定，但你已經嗅到了變化的味道。",
      "2": "你刻意降低了自己的存在感，不再像以往那樣積極地出現在各種場合中。內心其實有點矛盾，一方面覺得這樣做很明智，另一方面又擔心會錯過什麼機會。你選擇性地維持一些重要的人際連結，但整體而言變得更加謹慎和內斂。周圍的環境開始出現一些微妙的變化，雖然表面上還算和諧，但你能感覺到暗流正在湧動。",
      "3": "你發現自己越來越能夠抽離那些曾經讓你糾結的事情，心境變得更加平靜。以前覺得很重要的爭執和競爭，現在看來似乎沒那麼要緊了。你學會了用時間來化解衝突，不急著要立刻得出結果。內心的焦躁感逐漸消散，取而代之的是一種從容的智慧。外在的紛擾依然存在，但你已經為自己建立了足夠的緩衝空間。",
      "4": "你開始更有選擇性地與外界互動，不再來者不拒，也不盲目地參與每個活動。你保留了那些真正穩定可靠的關係，對於其他的社交場合則採取觀望態度。這種轉變讓你感到既輕鬆又有點孤單，但你知道這是必要的調整。外在環境的複雜度正在增加，各種訊息和機會紛至沓來，但你已經學會了如何過濾和選擇。",
      "5": "你的生活進入了一種安靜而穩定的節奏，雖然產出依然持續，但不再追求轟轟烈烈的表現。你享受這種低調的狀態，內心感到前所未有的安全感。風險確實降低了，但你也明白這是暫時的平衡。外在環境看起來風平浪靜，但你知道這只是表象，真正的變化還在醞釀中。這種相對的寧靜讓你有時間思考和準備。",
      "6": "一個階段即將結束，你已經成功地完成了戰略性的布局調整。回頭看這段時間的退避和低調，你感到滿意和欣慰，因為這為你保存了實力，也讓你看清了很多事情的本質。內心充滿了期待，你知道新的機會正在地平線上等待。外在環境開始出現新的轉機和可能性，你準備好了在適當的時機重新出現在舞台上。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖，此時應順應形勢調整自己的根基，不要急於展現實力，先修練內功為要。",
        "7": "你具備良好的基本功底，正處於能力提升的黃金期，應該保持現有的學習節奏，持續精進技能，為未來發展奠定更堅實的基礎。",
        "8": "你長期累積的舊有能力模式已經難以適應新環境，必須認清現實，承認既有技能的局限性，避免固執於過時的專業領域。",
        "9": "你過往引以為傲的核心能力已達巔峰難以突破，應順應時代變遷轉換跑道，將豐富經驗轉化為新領域的優勢，重新出發。"
      },
      "2": {
        "6": "你在退隱過程中的外在表現還不夠穩定，容易讓人看出內心的猶豫不決，此時應順應情勢調整你的言行舉止，展現更從容的態度。",
        "7": "你的外在表現正合於退隱的天地大勢，保持目前這種不爭不搶、淡然處世的姿態，繼續朝著內心嚮往的方向穩步前進。",
        "8": "你長期養成的外在表現模式已經根深蒂固，很難在短時間內改變，不如認清這個現實，接受自己無法完全隱藏的本性。",
        "9": "你過去強勢的外在表現已經到了轉變的時刻，不要再硬撐門面，順應時勢轉為低調內斂，才能真正完成心境的轉化。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應當順應環境變化調整發展方向，不要固執於原有計劃，靈活修正才能找到新的突破點。",
        "7": "你的未來發展正合天時地利，應該堅定信念持續前進，這是積累實力的關鍵時刻，保持努力方向不變即可開花結果。",
        "8": "你必須認清自身局限性已經形成，與其勉強突破不如暫時避開正面衝突，重新評估能力範圍，尋找更適合的成長路徑。",
        "9": "你的某些優勢已到極限，應該順應時勢轉換跑道，將過往經驗轉化為新領域的基礎，順勢而為才能再創高峰。"
      },
      "4": {
        "6": "你察覺外在環境開始出現不利變化，此時應當靈活調整策略，不要固執於原定計劃，適時修正方向才能避免更大損失。",
        "7": "你看到外在條件仍然支持當前的退守策略，應當堅持既定方針繼續前進，天時地利皆在你這邊，保持定力不動搖。",
        "8": "你面對的外在環境已經惡化到難以扭轉的地步，必須認清現實立即撤退，不要再抱持任何幻想或試圖力挽狂瀾。",
        "9": "你感受到外在強勢力量已達極限開始轉弱，這是順應大勢轉變的關鍵時刻，要把握機會調整立場迎接新局面。"
      },
      "5": {
        "6": "你觀察到外在環境開始出現不穩定的跡象，這些變化雖然微小但值得警惕，應該靈活調整自己的策略和態度，順應這些初期的變化趨勢。",
        "7": "你看到外在大勢正朝著退隱的方向發展，這符合天地自然的規律，你應該堅持既定的退守方針，繼續按計劃穩步推進撤退的準備。",
        "8": "你面對的外在環境已經惡化到難以挽回的地步，各種負面因素根深蒂固，你必須認清這個嚴峻現實，不要再抱持任何改變現狀的幻想。",
        "9": "你察覺外在的強勢力量已經到達頂點開始衰落，這是大勢轉換的關鍵時刻，你要順應這個轉變的趨勢，把握時機完成優雅的退出。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙轉變，這些變化雖然還不明顯，但已露出端倪，此時應當靈活調整自己的策略方向，順應這股新興的趨勢。",
        "7": "你看見外在大勢正朝著有利的方向發展，天時地利皆在你這一邊，應當堅持既定路線繼續前進，不要因小波動而動搖決心。",
        "8": "你面對的外在環境已經形成難以撼動的局面，舊有的格局根深蒂固，你必須認清這個現實，選擇暫時退避而非硬碰硬對抗。",
        "9": "你察覺外在強勢力量已達巔峰開始衰退，舊秩序即將轉換，你應當順應這個歷史轉折點，準備迎接新時代的到來。"
      }
    }
  },
  "34": {
    "number": 34,
    "name": "大壯",
    "code": "111100",
    "卦解": "你現在處在一個力量充沛但進展不太順暢的狀態。內心的能量和信心都很足，感覺自己有能力應對各種挑戰，但外在環境卻像是設了不少路障，讓你無法痛快地發揮。就像一台馬力十足的車子在崎嶇山路上行駛，引擎轟轟作響，卻只能慢慢前進。你的步調和周圍的節奏時而合拍時而不同，整體推進的速度比預期慢一些。雖然短期內看不到明顯的突破，但能感受到力量正在暗中累積，等待合適的時機爆發。",
    "六階段": {
      "1": "你感受到內在有股強大的能量正在甦醒，像是蓄積已久的力量終於找到了出口。過去那些看似困難的障礙，現在都變得可以突破，你的行動力明顯增強，做事的效率也大幅提升。內心充滿了躍躍欲試的衝勁，對未來充滿信心。周圍的人開始注意到你的變化，原本停滯的事情開始有了進展的可能。",
      "2": "你的表現越來越穩定，不再是偶爾的爆發，而是持續性的高水準輸出。工作或學習上的節奏變得更有張力，你能夠同時處理多項任務而不感到吃力。內心的焦慮減少了，取而代之的是一種從容的自信。你發現自己的影響範圍在擴大，更多人願意聽你的意見，你的聲音開始被重視。",
      "3": "你開始能夠深入到事情的核心細節，那些曾經讓你卡關的技術問題或複雜狀況，現在都能迎刃而解。內心有種豁然開朗的感覺，彷彿突然掌握了某種訣竅。你的工作效率達到了前所未有的高度，原本需要很久才能完成的事，現在可以快速搞定。周圍的環境也開始配合你的節奏，各種資源變得更容易取得。",
      "4": "外在環境開始對你的努力給出正面回應，合作夥伴或同事變得更加配合，溝通變得順暢無阻。你發現各種管道的承載能力都在提升，無論是資金流、人脈網絡還是資訊管道都更加通暢。內心感到一種被支持的安全感，不再需要孤軍奮戰。周圍的人開始主動提供協助，整個大環境都朝著有利於你的方向發展。",
      "5": "你已經能夠掌控全局，無論是工作項目還是人生規劃都在你的掌握之中。各項事務都能規模化運作，你的產能接近最高水準。內心有種君臨天下的豪氣，對自己的能力充滿信心。外在環境高度配合你的步調，資源配置達到最佳狀態，你的影響力已經擴展到相當大的範圍，成為別人眼中的成功典範。",
      "6": "你來到了一個相對穩定的高原期，雖然成長的速度放緩了，但整體狀況非常穩固。內心從之前的衝勁轉為一種深沉的滿足感，不再急於追求更多的突破，而是享受現有成果帶來的安定感。外在環境也趨於平穩，雖然新的機會變少了，但現有的平台足夠支撐你長期發展，這是一個適合鞏固既有成就的階段。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖根本，此時應主動檢視自己的底子，順勢調整學習方向，重新打造更堅實的能力基礎。",
        "7": "你的根基實力正順應天時地利而茁壯成長，這是積累基本功的絕佳時機，應保持當前的努力方向，持續強化核心能力不懈怠。",
        "8": "你長期忽視基礎建設，導致底子薄弱已成積習，現在急於求成只會更加不穩，應認清現實差距，暫避鋒芒重新紮根基本功。",
        "9": "你過往累積的基礎能力已達巔峰但開始顯露疲態，強行維持舊有模式將耗盡底子，應順應時勢轉換，讓根基重新蓄積能量。"
      },
      "2": {
        "6": "你目前展現的強勢形象容易引起反彈，適時調整表達方式，以更柔和的姿態與人互動，既能維持你的立場又能減少不必要的阻力。",
        "7": "你散發出的自信與實力正值最佳時機，繼續保持這種積極向上的外在形象，你的正能量將感染周圍的人，帶來更多合作機會。",
        "8": "你長期展現的強硬態度已經積累了太多負面印象，現在需要認清這個現實，暫時收斂鋒芒，避免在公開場合過度表現。",
        "9": "你過度強勢的外在表現已達極限，是時候順應情勢轉變，以謙遜包容的姿態示人，這樣的轉換反而能為你贏得更多尊重。"
      },
      "3": {
        "6": "你的成長潛力仍在探索階段，容易因外界影響而動搖方向。此時應靈活調整學習方式，不要固執於單一路徑，順應內心真實需求來修正成長策略。",
        "7": "你正處於穩定成長的黃金期，各方面能力都在自然提升中。保持現有的學習節奏和努力方向，持續前進就能充分發揮你的成長潛力。",
        "8": "你過去的成長模式已經固化，難以突破現有框架限制。認清自己的能力邊界，避免勉強追求不切實際的成長目標，專注於可行的小幅改善。",
        "9": "你的成長動能已達高峰，繼續用舊方式推進反而會適得其反。順應自然轉換期的到來，將重心從激進成長轉向穩固既有成果和內化經驗。"
      },
      "4": {
        "6": "你面對的外在環境正在微妙變化，雖有不利因素浮現，但這正是調整策略的良機，密切觀察市場動向，順勢修正你的行動方針。",
        "7": "你所處的外在環境正值順勢發展期，各項條件都朝有利方向匯聚，此時應堅持既定方針，把握時機積極推進計劃執行。",
        "8": "你面臨的外在環境已形成不利格局，各種阻力根深蒂固難以撼動，現實地評估局勢，暫時避開正面衝突尋找其他出路。",
        "9": "你眼前的有利環境已達頂峰開始轉向，過度依賴現況將面臨風險，主動順應即將到來的變化，提前布局新的發展方向。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，原本穩固的優勢地位出現鬆動跡象，此時應靈活調整策略，順應這些變化而非強硬抵抗。",
        "7": "你看見外在大勢正朝有利方向發展，各種條件都在支持你的強勢地位，應該堅持既定方針，保持前進動力不要動搖。",
        "8": "你面對的外在環境已經固化成不利格局，過度強勢只會招致更大阻力，必須認清現實並避免與環境正面對抗。",
        "9": "你察覺外在情勢已達頂峰開始轉向，強勢行動的時機即將結束，應該順應這個轉變趨勢，適時收斂鋒芒。"
      },
      "6": {
        "6": "你察覺到外在環境正在微妙變化，這些變化雖然還不明顯，但已顯露端倪。你應該保持敏銳觀察，隨時準備調整策略以順應即將到來的趨勢轉折。",
        "7": "你看到外在大勢正朝著有利方向發展，天時地利皆在你這一邊。你要把握這個良好的環境趨勢，堅定地維持目前的前進方向，順勢而為必有所成。",
        "8": "你面對的外在環境已經形成固化格局，既有的結構和趨勢積重難返。你需要認清這個現實，避免硬碰硬的對抗，另尋突破點或等待時機再動。",
        "9": "你所處的強勢環境已達頂峰，外在趨勢即將反轉向下。你要認知盛極必衰的道理，主動順應這個轉變，提前布局以免被環境變化所傷。"
      }
    }
  },
  "35": {
    "number": 35,
    "name": "晉",
    "code": "000101",
    "卦解": "你現在處在一個蓄勢待發的階段，雖然內在力量還不算強大，但外在環境正逐漸對你有利。整體氣氛是穩定而緩慢前進的，沒有劇烈的起伏變化，就像清晨的陽光慢慢升起，溫和而持續。你會感覺到一種安靜的進展感，雖然步伐不快，但每一步都很紮實。周圍的條件正在悄悄地配合著你的節奏，各種因素開始慢慢連結起來，形成一種溫和而穩定的推動力，讓你感受到前進的確定感。",
    "六階段": {
      "1": "你正處在一個重要的轉折點，過去被忽視的能力和價值開始浮現出來。內心有種終於被看見的欣慰感，但也帶著些許不確定。周圍的人開始注意到你的不同，那些原本模糊的機會變得清晰可見。這是建立信心的關鍵時刻，你的根基正在被重新認識和定義。",
      "2": "你發現自己的努力開始有了規律的回報，每一步都能看到明確的進展。內心充滿踏實感，那種穩定向上的節奏讓你更有動力持續前進。工作或生活中的表現越來越穩定，成果一個接一個地出現。這種可預期的成長模式讓你對未來充滿信心。",
      "3": "你開始補強自己的不足之處，那些曾經的盲點和弱項逐漸被填補。內心有種完整感正在形成，你能更清楚地看到自己的全貌。學習和改善的機會不斷出現，讓你的能力變得更加全面。這個過程雖然需要耐心，但你能感受到自己正在變得更完整。",
      "4": "外界對你的關注明顯增加，更多的機會和合作邀請開始出現。你會感到既興奮又有些overwhelmed，因為選擇變多了。市場或環境對你越來越友善，消息傳播得比以前更快更廣。這個階段需要你學會如何管理這些新的機會和關注。",
      "5": "你已經成為某個領域的標竿人物，影響力顯著擴大。內心有種成就感，但也承擔著更多責任感。你的做法開始被別人模仿和學習，成為了一種標準。環境給你更大的舞台，你的一舉一動都備受關注，這種中心位置既令人振奮也帶來壓力。",
      "6": "熱潮逐漸回歸平穩，但你建立的成果和影響力已經穩固地留在這個領域中。內心感到一種深層的滿足，不再需要刻意追求關注。環境已經將你的貢獻納入常態，成為不可或缺的一部分。這是一種成熟的成功狀態，影響力自然而持久。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力雖有不足，但正是調整的好時機。順應當下情況，主動補強薄弱環節，修正學習方法，為未來晉升建立更穩固的根基。",
        "7": "你的基礎能力正值上升期，應該持續精進不懈怠。維持目前的學習節奏，順應自然發展趨勢，穩健地累積實力為晉升做好準備。",
        "8": "你的基礎能力已經固化難以大幅改變，需要認清現實限制。避免勉強追求不適合的發展方向，善用既有優勢尋找合適的晉升路徑。",
        "9": "你的基礎能力已達巔峰但開始轉變，應順應這個自然循環。接受能力轉換的過程，將豐富經驗轉化為智慧，以新姿態迎接晉升機會。"
      },
      "2": {
        "6": "你的外在表現容易搖擺不定，此時應該順勢調整自己的展現方式，不要固執於某種形象，靈活修正才能找到最適合當下的表達模式。",
        "7": "你展現出來的樣子正順應天地自然趨勢，應該維持這種積極向上的外在表現，持續以正面形象示人，這是你前進路上的有力助緣。",
        "8": "你長期累積的外在形象已經定型且難以改變，應該認清現實避免強行扭轉，接受既有的外在評價，專注於其他可以努力的面向。",
        "9": "你過度強勢的外在表現已達極限開始走下坡，應該順應轉變放下強硬姿態，以更柔和謙遜的方式與外界互動才能重獲新機。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該靈活調整學習方向和能力培養重點，順應內在變化來修正發展路徑，這樣才能在轉變中找到真正適合的成長空間。",
        "7": "你具備良好的成長基礎和上升動能，應該堅持當前的能力提升方向，持續投入學習和自我完善，順著這股正向趨勢穩步前進，必能達成預期目標。",
        "8": "你需要認清當前能力發展已達瓶頸，與其強求突破不如暫時避開過度競爭的領域，重新審視自己的優勢所在，選擇更務實的成長路線來積蓄實力。",
        "9": "你的某些能力已達高峰但開始顯現疲態，應該順應自然規律適時轉換發展重心，將成熟的專長轉為基礎，開始培養新的成長點和競爭優勢。"
      },
      "4": {
        "6": "你需要密切關注外在環境的微妙變化，當發現不利因素開始顯現時，要及時調整策略方向，靈活應對才能避免陷入困境。",
        "7": "你當前面臨的外在條件正處於有利態勢，應該把握這個良好時機，堅定地按既定方向前進，不要輕易改變計畫。",
        "8": "你必須認清外在環境已經形成重大阻礙，現實條件對你極為不利，此時應該暫時避開鋒頭，等待更好的時機。",
        "9": "你面對的外在優勢即將轉換，雖然目前仍有力量，但要順應即將到來的變化，準備調整自己的行動方式。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變動雖然還不明顯，但已露出端倪。順應這些新的趨勢，適時調整你的策略和做法，才能在變局中保持優勢地位。",
        "7": "你看見外在大勢正朝著有利的方向發展，各種條件都在逐步成熟。堅持你既定的方向繼續前進，天時地利都在支持你的晉升之路，不要輕易改變。",
        "8": "你發現外在環境已經形成固化的格局，既有的阻力和限制難以突破。認清這個現實狀況，暫時避開正面衝突，尋找其他的發展路徑會更加明智。",
        "9": "你察覺外在的強勢局面已經到達頂點，開始出現轉折的跡象。順應這個自然的轉變過程，準備迎接新的階段，不要執著於過去的成功模式。"
      },
      "6": {
        "6": "你觀察到外在環境正在醞釀變化，雖然趨勢尚未明朗，但應保持敏銳觸覺，隨時準備調整策略方向，把握住轉機出現的關鍵時刻。",
        "7": "你看見外在大勢正朝有利方向發展，此時應堅定信心持續推進，順應天時地利的自然趨勢，讓成果在穩健前行中自然顯現。",
        "8": "你面對的外在環境已形成難以撼動的既定格局，與其硬碰硬徒耗心力，不如務實地重新評估現況，另尋更適合的發展路徑。",
        "9": "你察覺外在強勢趨勢已達頂峰開始轉折，明智的做法是順應這股轉變力量，提前布局下一階段，避免被舊勢力的慣性所拖累。"
      }
    }
  },
  "36": {
    "number": 36,
    "name": "明夷",
    "code": "101000",
    "卦解": "你現在就像在黎明前的黑暗中摸索，外在環境對你並不太友善，處處都有阻礙讓你感到前進困難。不過你內心其實蘊藏著不錯的力量，只是這股能量還沒找到合適的出口。整個氛圍給人一種悶悶的感覺，就像烏雲密佈的天空，雖然陽光暫時被遮住，但你能感受到雲層後面還是有光亮的。你的步調倒是很穩定，只是每一步都走得比較吃力，需要更多耐心來等待時機。",
    "六階段": {
      "1": "你發現自己的能量開始收斂，不再像以前那樣張揚外放。內心有種說不出的疲憊感，但這不是壞事，而是一種自然的調整。你開始選擇那些不那麼顯眼的路徑，避開人群的目光。周圍的環境似乎也在暗示你，現在不是強出頭的時候。你學會在微光中前行，雖然視野有限，但每一步都更加踏實穩重。",
      "2": "你的行為模式悄悄改變了，不再急於展示成果給所有人看。內心深處有一種保護自己的本能在作用，讓你選擇將重要的事情藏起來。你發現自己開始享受這種低調的狀態，不用時刻準備應對外界的評價。環境也配合著你的轉變，給了你更多私人空間去默默耕耘，留下的痕跡越來越少。",
      "3": "你開始將注意力轉向那些平常被忽略的細節，雖然這讓你的進度看起來變慢了。內心有種探索隱藏寶藏的興奮感，你知道真正的潛力往往藏在不起眼的角落。你願意走更多的彎路，因為你明白直線並不總是最好的選擇。周圍的人可能不理解你的做法，但你內心很清楚，這些看似低效的摸索正在為未來積累力量。",
      "4": "外界的注意力開始分散到其他地方，你終於不用承受那麼多的關注壓力了。內心感到一陣輕鬆，就像卸下了沉重的盔甲。你發現沒有了外部的干擾，反而能夠更專心地處理自己的事情。環境變得相對安靜，給了你修復和調整的機會。你開始在這個相對隱蔽的空間裡，慢慢修補那些之前受損的部分。",
      "5": "你感覺自己被一層無形的保護罩包圍著，核心的部分得到了很好的保護。內心異常平靜，外界的噪音似乎都被過濾掉了。你學會了在低處默默積蓄力量，不再被表面的波動所影響。周圍的環境也變得更加純淨，那些無關緊要的資訊和干擾都自然消散。你知道這是一個重要的蓄能階段，為未來的綻放做準備。",
      "6": "你已經完全適應了這段暗淡的時光，內心變得格外寧靜和深沉。你能感受到生命的脈動變得平緩而有序，不再有之前的起伏波動。你知道這個階段即將結束，但你不急躁，而是耐心地等待。周圍的環境也在悄悄醞釀著變化，你能敏銳地察覺到那些微妙的信號，預示著光明即將重新到來。你已經準備好迎接下一個轉折。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外界變化而動搖，此時應該主動調整學習方向，補強不足之處，為未來的挑戰做好準備。",
        "7": "你的根基扎實且具備成長潛力，應該保持現有的努力方向，持續精進核心能力，順應天時地利穩步前進。",
        "8": "你過去累積的基礎已經僵化難以改變，必須認清現實狀況，避免固守舊有模式，重新審視自己的能力結構。",
        "9": "你的基礎能力雖然深厚但已到達極限，應該順應時勢轉變，將既有優勢轉化為新的發展方向，避免過度消耗。"
      },
      "2": {
        "6": "你的外在形象容易受到質疑和變動，此時應該主動調整展現方式，收斂鋒芒，以更謙和的姿態面對他人，避免招致不必要的批評。",
        "7": "你可以堅持當前的外在表現，保持正直的形象和原則立場，即使環境艱難也要維持內心的光明，這是順應天地正道的表現。",
        "8": "你的外在處境已經相當困難，不宜再強求表現，應該認清現實狀況，暫時隱藏才華和鋒芒，等待更合適的時機再展現自己。",
        "9": "你過度的外在展現已達極限，應該順應時勢變化，主動收斂強勢的表現，轉為內斂謙遜的姿態，這樣才能避免更大的損傷。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，面對內在的不確定感時，要善於順應環境調整自己的發展方向，靈活修正原有計畫才能突破現況。",
        "7": "你擁有穩定向上的成長動能，此時應該堅持既定的學習與提升路徑，持續投入努力，順應天地正道必能開花結果。",
        "8": "你的成長模式已經僵化難以突破，必須認清現實接受暫時的停滯，避免強行改變反而消耗能量，等待時機再圖發展。",
        "9": "你過往的成長方式已達極限，要順應內在轉變的訊號，放下舊有的執著與模式，才能為下一階段的潛力開發騰出空間。"
      },
      "4": {
        "6": "你觀察到外在環境正在微妙變化，雖然當前條件不算理想，但這些波動中蘊含轉機，保持敏銳度隨時調整策略方向。",
        "7": "你發現外在大勢正朝有利方向發展，儘管明夷卦象徵困頓，但天時地利漸趨明朗，堅持既定路線持續前進為上策。",
        "8": "你面對的外在環境已形成根深蒂固的不利格局，與其硬碰硬消耗實力，不如認清現實暫時避開鋒頭保存元氣。",
        "9": "你感受到外在強勢力量已達頂峰開始轉弱，舊有的壓制環境即將鬆動，順應這股轉變之勢準備迎接新局面。"
      },
      "5": {
        "6": "你觀察到外在環境正處於不穩定的變化中，此時應保持彈性思維，隨時準備根據局勢發展調整自己的策略和立場。",
        "7": "你看見外在趨勢正朝著光明方向發展，縱使當下仍有陰霾，你應堅持正道，順應天時地利繼續前行。",
        "8": "你面對的外在困境已經根深蒂固難以撼動，與其硬碰硬消耗自己，不如認清現實選擇暫時迴避保全實力。",
        "9": "你察覺外在強勢力量已達頂點開始衰退，明智的做法是順應這個轉變的時機，準備迎接新的契機到來。"
      },
      "6": {
        "6": "你觀察到外在環境正在醞釀變化，雖然當前形勢不明朗，但保持靈活調整的心態，隨時準備修正方向，這些微妙的轉機將為未來帶來新的可能。",
        "7": "你看見大環境正朝著光明復甦的方向發展，順應這股天地自然的趨勢，堅持正道前行，時間會證明你的堅持是對的，黎明就在不遠處。",
        "8": "你必須認清外在環境的黑暗已經根深蒂固，短期內難有根本改變，明智的做法是避開正面衝突，保存實力，等待更好的時機到來。",
        "9": "你感受到舊有的困頓局面已達極限，外在環境即將迎來重大轉變，順應這個自然的轉折點，放下過往包袱，迎接即將到來的新局面。"
      }
    }
  },
  "37": {
    "number": 37,
    "name": "家人",
    "code": "101011",
    "卦解": "你現在處在一個相當穩定和諧的狀態中，就像一個運作良好的家庭一樣，各方面都維持著適當的平衡。你的內心世界和外在環境達到了難得的協調，既不會感到過度緊張，也不會覺得鬆散無力。\n\n這段時間你會發現生活節奏很有規律，各種事情都在按部就班地進行著。雖然沒有什麼戲劇性的大變化，但你能感受到一種溫暖踏實的氛圍圍繞著你，就像在自己熟悉的空間裡，一切都井然有序，讓人安心。",
    "六階段": {
      "1": "你正在為生活建立基本的架構和秩序。內心渴望找到屬於自己的位置和角色定位，雖然一切還在摸索階段，但你已經開始認真思考責任分工的問題。周圍的環境要求你必須承擔起某些基本職責，就像剛搬進新家需要決定誰負責什麼家務一樣。這個階段雖然有些忙亂，但你能感受到建立秩序後帶來的安全感。",
      "2": "你開始進入穩定的日常節奏中，各種例行公事變得越來越自然流暢。內心感到踏實，因為生活有了可預期的規律性，不再需要每件小事都重新思考決定。周圍的環境也配合著這種節拍運轉，就像家庭生活中大家都知道該在什麼時候做什麼事情。雖然日子看似平凡，但這種穩定的韻律讓你感到溫馨和歸屬感。",
      "3": "你正在處理各種細節上的調整和磨合，努力讓所有環節都能更好地配合。內心既有期待也有些許焦慮，因為你知道這些小地方的對齊很重要，但過程中難免會有摩擦。周遭環境中的人事物還在相互適應階段，就像家庭成員還在找尋最舒適的相處模式。雖然偶有不順，但你能感受到大家都在為共同目標而努力調整。",
      "4": "你開始將注意力更多地投注在內部的協調合作上，對外的接觸相對減少。內心感到這樣的專注很有必要，因為把內部關係理順比對外擴張更重要。環境條件也支持這種向內凝聚的趨勢，外界的干擾變少了，你有更多空間和時間來深化內部的連結。這種相對封閉但緊密的狀態，讓合作效率明顯提升。",
      "5": "你處在一個運作非常順暢的狀態中，所有的規則和節拍都已經清楚建立。內心感到充實和滿足，因為整個系統在你的協調下運轉得井井有條。周圍環境呈現出和諧穩定的現況，每個人都知道自己的角色和職責，就像一個經營良好的家庭，溫暖而有序。你能夠輕鬆掌握全局，並且享受這種掌控中帶來的成就感。",
      "6": "你正在為一個階段性的任務做收尾整理工作，同時準備進入下一個循環。內心有完成一件事的滿足感，但也開始思考如何讓下一輪運作得更好。環境趨勢顯示著新的變化即將到來，需要重新安排和規劃。就像做完大掃除準備迎接新的開始，你在整理過往經驗的同時，也為未來的挑戰做好準備，充滿期待地等待新週期的展開。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖，此時應主動檢視自己的根基，順應當下情況靈活調整學習方向，避免固執於單一技能發展。",
        "7": "你的基本功底正處於上升期，各項能力發展順應自然規律，應當持續專注於核心技能的深化，維持現有的學習節奏與方向不偏不倚。",
        "8": "你過往累積的基礎已形成固化模式難以改變，應當認清現實接受既有能力的局限性，避免勉強突破反而消耗更多精力與時間成本。",
        "9": "你的基礎能力已達高峰開始面臨轉折點，應當順應這個自然變化，主動為下一階段的能力轉型做好準備，不要過度依賴舊有優勢。"
      },
      "2": {
        "6": "你在家庭中展現的形象還不夠穩定，容易給人搖擺不定的感覺，此時應該順勢調整自己的言行舉止，讓家人看到你更加可靠的一面。",
        "7": "你目前在家庭中展現出積極正面的形象，這個趨勢很好，應該繼續維持這種溫和而有原則的外在表現，讓家庭關係更加和諧穩固。",
        "8": "你長期以來在家人面前展現的形象已經固化，想要改變他們對你的看法並不容易，不如先認清現實，避免強行扭轉既定印象。",
        "9": "你過去在家庭中表現得過於強勢或固執，這種模式已經到了該轉變的時候，順應家庭和諧的需要，展現更加柔和包容的一面。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，容易因小事而動搖信心，此時應順勢調整學習方向，將每次挫折視為修正機會，靈活適應才能找到真正適合的發展道路。",
        "7": "你具備良好的成長基礎和明確方向，應該維持現有的努力節奏持續前進，天時地利人和都在支持你，只要保持正確態度就能穩步提升能力。",
        "8": "你過去的學習模式已經根深蒂固但效果有限，必須認清現實中的能力瓶頸，避免繼續用舊方法期待新突破，重新審視才能找到成長空間。",
        "9": "你的某項能力已經達到高峰開始走下坡，與其固執地維持既有優勢，不如順應時勢轉變發展重點，將經驗智慧轉化為新的成長動能。"
      },
      "4": {
        "6": "你需要密切關注外在環境的微妙變化，當發現不利於家庭和諧的因素時，要靈活調整策略，順勢而為才能化解潛在危機。",
        "7": "你觀察到外在條件正朝有利方向發展，家庭事業皆得天時地利，此時應堅持既定方針，持續推進各項計畫不要動搖。",
        "8": "你面對的外在困境已經積累太久難以扭轉，與其勉強對抗不如認清現實，暫時避開不利環境等待更好時機再行動。",
        "9": "你察覺外在優勢已到盛極而衰的轉折點，應主動順應即將到來的變化，提前做好轉換準備才能保全家庭利益。"
      },
      "5": {
        "6": "你觀察到家庭或團隊內部出現些許波動，這些變化雖然帶來不安，但正是調整關係結構的好時機，順應這些微妙變化來修正互動模式。",
        "7": "你看見外在環境對家庭和諧非常有利，各種資源和機會都在支持團體發展，此時應該保持現有的領導方式，繼續推動既定的家庭計畫。",
        "8": "你面對的是長期累積的家庭問題已經根深蒂固，外在壓力讓改變變得更加困難，現在需要認清現實，避免強行介入只會加劇衝突。",
        "9": "你察覺外在環境正在發生重大轉變，過去有效的家庭經營方式已達極限，是時候順應新的時代趨勢，讓家庭關係自然轉向新的平衡。"
      },
      "6": {
        "6": "你觀察到家族或團隊的外在環境正在微妙變化，此時應靈活調整內部運作方式，順應這些新興趨勢，避免固守舊有模式而錯失良機。",
        "7": "你發現外在環境對家族事業或團隊發展呈現有利態勢，應當保持現有的正確方向持續前進，穩健地擴展影響力與合作關係。",
        "8": "你面對的外在環境已形成難以撼動的既定格局，應認清現實限制，避免與大勢對抗，轉而尋找在現有框架內的生存發展空間。",
        "9": "你察覺外在環境的強勢趨勢已達頂峰開始轉向，應順應這個轉變契機，適時調整家族或團隊的發展策略，迎接新的機遇週期。"
      }
    }
  },
  "38": {
    "number": 38,
    "name": "睽",
    "code": "110101",
    "卦解": "你現在處在一個有點微妙的狀態裡。雖然你的條件和實力都不錯，但周圍似乎存在著一些分歧或誤解，讓事情的進展顯得有些停滯。就像是大家各有各的想法，步調不太一致，但也沒有激烈的衝突。你的內在和外在環境都保持著平衡，只是那種「各自為政」的氛圍讓你感覺有些卡住。不過這種僵持的感覺不會太久，隨著時間推移，彼此的想法會慢慢靠攏，事情也會開始有所進展。",
    "六階段": {
      "1": "你心中有著強烈的信念和想法，但發現周圍的人都有截然不同的觀點。這種根本性的分歧讓你感到困惑，甚至有些焦躁不安。你試圖說服別人理解你的立場，卻發現大家都在堅持自己的角度。環境中充滿了辯論和爭執的聲音，每個人都想證明自己是對的。這個階段讓你開始懷疑，是否真的存在絕對的對錯。",
      "2": "你開始學會清楚表達自己的觀點，同時也試著理解別人的想法。內心的混亂漸漸平息，取而代之的是一種井然有序的感覺。你發現可以和持不同意見的人劃分各自的工作範圍，在保持距離的同時進行合作。周圍的氛圍變得相對平和，大家開始接受「可以不同意，但可以共事」的現實。這種有邊界的相處模式讓你感到輕鬆一些。",
      "3": "你的內在蘊含著調和矛盾的能力，雖然表面上看起來還是經常與人產生小摩擦。你會為了一些細節問題而煩惱，需要不斷調整自己的表達方式和工作方法。環境中仍然存在許多需要磨合的地方，偶爾會有誤解和衝突發生。但你已經具備了處理這些問題的潛力，只是還需要時間去發揮。每一次的碰撞都讓你更懂得如何與差異共存。",
      "4": "外在環境開始出現一些助力，可能是有經驗的前輩或者中間人願意幫忙協調。你感受到一絲希望，原本僵持的局面有了轉機的可能。這些橋接者幫助你們找到了一些共同點，雖然只是小範圍的共識，但已經足夠讓溝通管道重新打開。周圍的氛圍變得比較友善，人們開始願意聽取不同的聲音。你開始相信，分歧並不一定意味著對立。",
      "5": "你發現現在的環境允許大家朝著各自的方向前進，同時還能保持適度的聯繫。你的心情變得開朗許多，不再為意見不合而苦惱。雖然大家走的路不完全相同，但彼此都能看見對方的進展，偶爾還會在某些節點上相遇交流。整個環境呈現出一種多元並進的活力，每個人都能在自己的軌道上發光發熱。這種狀態讓你感到既自由又安心。",
      "6": "你看見了一個美好的未來景象：不同的聲音可以和諧共存，各自精彩。你的內心充滿了寬容和智慧，能夠欣賞每一種不同的選擇和道路。環境中的分歧已經不再是問題，而是豐富性的體現。每個人都找到了屬於自己的正確軌道，彼此之間既不干擾也不孤立。你感受到一種深層的平靜，明白了「和而不同」的真正含義。這個世界因為有了差異而變得更加精彩。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚有不穩之處，但正是調整根基的好時機，順應當下情勢靈活修正自己的底子，將為未來奠定更堅實的基礎。",
        "7": "你的根基正合天時地利，基礎能力與大勢相符，堅持現有的學習方向持續精進，這份底子將成為你長遠發展的有力支撐。",
        "8": "你過往累積的基礎能力已到瓶頸，認清現實中的限制比勉強突破更重要，暫時避開需要深厚底子的挑戰會是明智選擇。",
        "9": "你的基礎能力雖然深厚但已到轉折點，順應時代變化調整自己的根基方向，讓過往的底子成為新領域發展的踏板。"
      },
      "2": {
        "6": "你的外在形象容易因小事而搖擺不定，此時應順應環境變化適時調整表現方式，不要固執於單一形象，靈活修正能贏得更多認同。",
        "7": "你展現出的正面形象正符合時勢所需，繼續保持這種積極向上的外在表現，堅定前行的姿態將為你帶來持續的支持與機會。",
        "8": "你長期累積的負面形象已根深蒂固難以扭轉，現在應認清現實避免強求改變他人觀感，專注內在修養等待時機自然轉化。",
        "9": "你過於強勢的外在表現已達極限開始產生反效果，主動收斂鋒芒順應他人期待，謙和的姿態反而能化解對立重建關係。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，面對內在的不確定感時，應順勢調整學習方向，將這份敏感轉化為適應力的優勢。",
        "7": "你具備穩健的成長動能，應維持當前的學習節奏持續前進，這份內在的陽性力量將帶來長期的能力提升。",
        "8": "你需認清某些根深蒂固的思維模式已成為成長阻礙，暫時避開強行突破，轉而培養其他領域的潛能空間。",
        "9": "你過往倚重的能力優勢已達頂峰，應順應時機轉變，將經驗智慧轉化為指導他人的新成長方向。"
      },
      "4": {
        "6": "你察覺外在環境變化多端，此時應靈活調整策略，順應環境變動而修正方向，不必固執己見，適度妥協能化解分歧。",
        "7": "你觀察到外在條件正朝有利方向發展，環境趨勢支持你的目標，應堅持既定方針繼續前進，把握良好時機。",
        "8": "你面對的外在環境已形成固化阻礙，既有格局難以撼動，應認清現實限制，暫時迴避正面衝突為上策。",
        "9": "你發現外在強勢力量已達頂點開始轉弱，應順應這股轉變趨勢，放下對抗心態，以柔順姿態迎接新局面。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些看似矛盾的訊號實際上是調整的契機，順應這些變化並適時修正你的策略，將能化解當前的分歧局面。",
        "7": "你面對的外在情勢雖有分歧對立，但大勢依然明朗，堅持你的正確判斷並持續前進，時間會證明你的洞察力和決策的正確性。",
        "8": "你看到外在的對立衝突已經根深蒂固，短期內難以改變，認清這個現實並避免強行介入，保持距離觀察是最明智的選擇。",
        "9": "你察覺外在的強勢力量已達頂峰開始轉弱，順應這個轉變趨勢而不是對抗，將能在新的平衡中找到化解分歧的機會。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動階段，各方立場仍在調整中，此時應保持彈性，隨時準備修正自己的策略方向。",
        "7": "你看見外在趨勢正朝有利方向發展，各種條件逐漸成熟，應該堅定信心繼續推進既定計劃。",
        "8": "你面對的外在環境已形成固化格局，對立局面短期內難以扭轉，應認清現實選擇迴避或另闢蹊徑。",
        "9": "你察覺外在的強勢力量已達頂點開始轉弱，舊有格局即將改變，順應這個轉換時機調整自己的定位。"
      }
    }
  },
  "39": {
    "number": 39,
    "name": "蹇",
    "code": "001010",
    "卦解": "你現在就像走在一條崎嶇的山路上，腳步有些沉重，前進的力氣不太夠。周圍的環境看起來停滯不前，好像時間都凝固了一樣。不過有個好消息是，你內心的想法和外在的處境倒是很一致，沒有那種內外拉扯的痛苦感。\n\n雖然眼前確實有些困難，但你會發現這種狀況不會急劇惡化，也不會突然好轉。就像在霧中慢慢摸索，每一步都很謹慎，但隨著時間推移，你會漸漸找到更穩定的節奏，累積出前進的動能。",
    "六階段": {
      "1": "你站在一個充滿挑戰的起點，面前的道路比預期更加崎嶇難行。內心雖然有些忐忑，但你明白急躁只會帶來危險，必須放慢腳步仔細觀察。周圍的地形陡峭不平，每一步都需要謹慎選擇落腳點。這時候最重要的是建立穩固的基礎，寁可花更多時間確認安全，也不要冒險前進。你的謹慎態度將成為度過難關的重要根基。",
      "2": "你開始調整自己的行進方式，將原本的大步流星改為小碎步前進。心情雖然有些焦急，但你學會了將注意力集中在當下這一步，而不是遙遠的終點。外在環境依然充滿不確定性，但你發現透過縮短每次的目標距離，反而能更好地掌控局面。這種「一步一腳印」的表現方式，讓你在困難中找到了屬於自己的節奏感。",
      "3": "你在這個階段展現出了靈活變通的潛力，當發現某條路走不通時，你不會固執地硬撐下去。內心雖然偶爾會因為需要退回重來而感到挫折，但你逐漸理解這種反覆試探其實是智慧的表現。外在的路況變化莫測，但你的適應能力正在這個過程中被激發出來。退一步不是失敗，而是為了找到更適合的前進路線。",
      "4": "外在環境開始出現轉機，你發現有了一些實用的工具和支援可以運用。內心的壓力明顯減輕，因為繩索、扶手這些外援讓原本看似不可能的路段變得可以通行。周圍的條件雖然仍有挑戰，但已經不再是孤軍奮戰的狀態。你開始相信，有了適當的輔助和準備，即使是最困難的路段也能夠安全通過。這給了你繼續前進的信心和動力。",
      "5": "你來到了關鍵的突破點，這是整個旅程中最關鍵的時刻。內心既緊張又興奮，因為你感覺到勝利就在不遠處。外在環境雖然依然需要小心應對，但你已經掌握了通過的訣竅。如果是團隊行動，大家的配合也更加默契，整個隊形穩定有序。雖然還不能完全放鬆，但你知道最困難的部分已經被克服了，現在只需要保持穩定繼續前進。",
      "6": "你已經可以看到出口，但這最後一小段路反而需要格外專注。內心雖然充滿即將成功的喜悅，但你明白現在絕不是鬆懈的時候。外在環境看似平穩，但你知道在完全脫困之前都不能掉以輕心。這時候需要的是堅持到底的毅力和始終如一的專注度。只要穩穩地走完這最後的坡面，你就能夠徹底擺脫困境，迎來全新的開始。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力還不穩固，容易因外在困難而動搖，此時應該謙虛學習，順勢調整自己的知識結構和技能組合，為突破困境打好更堅實的根基。",
        "7": "你的基礎能力正處於上升期，雖然面臨困難但底子扎實，應該堅持既定的學習和成長方向，持續精進核心能力，時機成熟時必能突破。",
        "8": "你過去累積的基礎能力已經僵化，難以應對當前的困境挑戰，必須認清現實，避開不適合的領域，重新思考能力發展的方向。",
        "9": "你的基礎能力雖然深厚但已到瓶頸，不宜再用舊有模式硬撐，應該順應時勢變化，將既有優勢轉化為新的能力組合和發展方向。"
      },
      "2": {
        "6": "你在困境中展現的形象還有調整空間，不妨順應當下情勢，適度修正自己的外在表現，讓別人看到你積極應變的一面。",
        "7": "你展現出來的堅韌態度正符合天地運行的規律，繼續保持這種不屈不撓的外在形象，穩步前進必能突破困局。",
        "8": "你長期積累的負面形象已難以快速改變，與其勉強包裝，不如認清現實，暫時收斂鋒芒，避免更多誤解產生。",
        "9": "你過度強勢的外在表現已到了該轉變的時候，順應形勢變化，展現更柔和包容的一面，反而能獲得更多支持。"
      },
      "3": {
        "6": "你的成長潛力在於靈活應變，當前困難正是磨練你適應能力的機會，順應環境變化調整自己的方向，將阻礙轉化為前進的動力。",
        "7": "你具備穩定向上的成長動能，即使面對困境也要保持初心持續努力，這段艱難時期正是奠定你未來實力的關鍵階段，堅持必有收穫。",
        "8": "你需要認清自身局限，過度勉強只會消耗能量，現階段應該避開正面衝突，將注意力轉向內在修養和基礎能力的紮實培養。",
        "9": "你的成長在於學會放下執著，過往的成功模式已不適用當前困境，順應時勢轉變思維方式，才能開啟新的發展可能性。"
      },
      "4": {
        "6": "你面對的外在環境正在微妙變化，困難中隱含轉機，應當敏銳觀察環境動向，適時調整策略以順應變化。",
        "7": "你所處的外在條件雖有阻礙，但大勢仍朝有利方向發展，堅持正道前行，時機成熟時自然突破困境。",
        "8": "你必須認清外在環境的嚴峻現實，困難已經積重難返，暫時避開正面衝突，保存實力等待時機。",
        "9": "你察覺外在阻力已達頂峰開始衰退，此時應順應這個轉變趨勢，不再強求，讓困難自然消解。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，困難中出現轉機的跡象，此時應該靈活調整策略，順應這些積極的變化來化解當前的阻礙。",
        "7": "你看見外在大勢正朝有利方向發展，雖然困境尚未完全解除，但天時地利已現，應該堅持既定方向繼續前進，不要輕易動搖。",
        "8": "你面對的外在困境已經根深蒂固，各種阻礙盤根錯節難以撼動，現在需要認清現實，暫時避開正面衝突，保存實力等待時機。",
        "9": "你察覺外在的阻礙力量已達頂峰開始衰退，舊有的困難格局即將轉變，此時應該順應這個自然的轉換過程，準備迎接新局面。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，這些變化雖然還不穩定，但正是調整策略的良機，順應這些新趨勢來修正你的方向。",
        "7": "你看見外在大環境正朝著有利的方向發展，天時地利皆順，現在正是堅持既定路線，維持前進步調的最佳時機。",
        "8": "你面對的外在困境已經積累太深，現實環境的阻力難以撼動，你需要認清這個局面，暫時避開正面衝突。",
        "9": "你察覺外在的強勢趨勢已達頂峰，即將轉向，與其硬撐到底，不如主動順應即將到來的變化，準備迎接新局面。"
      }
    }
  },
  "40": {
    "number": 40,
    "name": "解",
    "code": "010100",
    "卦解": "你現在處於一個緩慢解開的狀態中。雖然整體能量不算強勁，但內心與外在環境達到了難得的平衡，沒有太多衝突或拉扯。就像一個緊繊的結正在慢慢鬆開，過程雖然不急不徐，卻是穩定而持續的。你感受到一種安靜的流動感，事情沒有大起大落，而是以自己的節奏在進展。這種狀態有點像春天剛來時的感覺——變化正在發生，但需要耐心等待它自然展現。",
    "六階段": {
      "1": "你內心那個最深層的結打開了，像是胸口的大石頭終於被移走。過去那些讓你窒息的壓抑感開始鬆動，呼吸變得順暢許多。雖然周圍的環境還沒有太大變化，但你已經能感受到一種微妙的輕鬆感。這是解脫的起點，你的根基正在重新調整，為接下來的轉變做準備。內在的緊繃開始融化，就像冰雪初融時那種既謹慎又充滿希望的感覺。",
      "2": "你開始看見事情之間的連結，原本卡住的環節一個接一個地順暢起來。內心的焦慮逐漸被一種「事情在好轉」的踏實感取代，你能感受到自己的表現越來越自然流暢。身邊的人也開始注意到你的變化，給予更多正面的回應。困擾你許久的問題不再是孤立的難題，而是開始形成可以處理的清晰脈絡。你的行動力回來了，每一步都比之前更有方向感。",
      "3": "你發現自己有能力處理那些細微但重要的問題，過去被忽略的小毛病現在都能逐一解決。內心湧現一種成就感和掌控感，你開始相信自己的潛力比想像中更大。周圍的環境給你足夠的空間去發揮，那些曾經的阻礙現在看起來都是可以克服的。你的清單上的待辦事項一項項被劃掉，每完成一件事都讓你對自己更有信心。這種細緻的進步讓你感到穩定而踏實。",
      "4": "外界的合作管道重新暢通，你發現與他人的互動變得順利許多。之前那些溝通不良、配合困難的狀況明顯改善，工作或生活上的協調回到正常軌道。你內心的壓力因為外部支援的恢復而大幅減輕，不再需要獨自承擔所有重擔。環境條件開始對你有利，資源的流動變得順暢，你能感受到整個系統正在恢復健康的運轉節奏。這種外在的支持讓你更有底氣面對挑戰。",
      "5": "整個局面進入最佳狀態，你感受到一種久違的輕快和自在。內心的負擔完全放下，取而代之的是一種平衡而充滿活力的感覺。周圍的環境非常配合，各種條件都恰到好處地支持著你的行動。你的表現達到了一個新的水準，既不會過度用力也不會鬆懈怠慢。這是解卦過程中最舒暢的階段，一切都在最理想的狀態下運行，讓你體驗到真正的自由自在。",
      "6": "這一輪的解決過程即將完成，你內心充滿了清爽和成就感。所有的複雜問題都已經處理完畢，剩下的是一條簡潔明瞭的前進道路。環境也跟著你的轉變而煥然一新，舊的混亂狀態完全消失，為新的開始創造了理想的條件。你感到既有結束的滿足，也有對未來的期待。這個階段讓你明白，每一次的解決都是為了迎接更好的可能性，你已經準備好擁抱新的挑戰和機遇。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖根本，此時應順應當下情況靈活調整學習方向，逐步修正自己的能力缺口。",
        "7": "你的根基紮實且具備成長潛力，正是順應天時地利發展核心能力的時機，維持現有的努力方向持續精進，必能開花結果。",
        "8": "你長期累積的舊有能力模式已難以適應新環境，與其固執己見不如認清現實，暫時避開需要突破的領域重新定位。",
        "9": "你過往引以為傲的強項能力已到達顛峰難再突破，順應時勢轉變發展新的技能領域，才能延續競爭優勢。"
      },
      "2": {
        "6": "你的外在形象容易搖擺不定，此時應該順應環境變化主動調整展現方式，不要固執於單一的表現模式，靈活修正能讓你更好地適應當下情況。",
        "7": "你展現出的狀態正合天時地利，應該維持目前積極正面的外在表現繼續前進，這種展現方式能夠獲得他人認同並帶來良好的發展機會。",
        "8": "你長期累積的外在形象已經定型難以改變，必須認清現實避免強行扭轉，接受目前的展現方式並在此基礎上尋找適合的發展路徑。",
        "9": "你過於強勢的外在表現已達極限開始走下坡，應該順應時勢轉變展現方式，從剛強轉向柔和能讓你重新獲得他人的支持與信任。"
      },
      "3": {
        "6": "你的成長潛力還在探索階段，容易因外界影響而改變方向。順應內心真實想法，適時調整學習重點，不要害怕在摸索中修正自己的發展路徑。",
        "7": "你的成長動能正值上升期，各方面能力都在穩定提升中。保持現有的學習節奏和努力方向，持續精進專業技能，前進的道路會越來越清晰。",
        "8": "你過去累積的包袱或固化思維限制了成長空間，突破困難重重。認清現實條件，先放下不必要的執著，重新檢視自己真正需要發展的核心能力。",
        "9": "你某些方面的能力已達高峰，繼續用舊方法提升會遇到瓶頸。順應時代變化，主動學習新領域新技能，讓成長模式跟上環境的轉變需求。"
      },
      "4": {
        "6": "你察覺到外在環境正在微妙變化，此時應保持敏銳觀察力，適時調整策略方向，不要固守原有計劃，順應環境波動才能化解困局。",
        "7": "你發現外在條件正朝有利方向發展，天時地利皆備，此刻應堅定信心持續推進，把握大勢所趨的良好時機，勇敢前行必有所獲。",
        "8": "你面對的外在環境積弊已深，結構性問題難以短期改變，與其硬碰硬徒耗心力，不如暫時迴避鋒芒，另尋突破口為上策。",
        "9": "你觀察到外在強勢力量已達頂峰開始轉弱，舊有格局即將鬆動，順應這股轉變之勢，耐心等待新局面形成，時機自然到來。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變化雖然帶來不確定性，但也創造了調整的機會，順應這些變化來修正你的策略方向。",
        "7": "你看見外在趨勢正朝有利方向發展，天時地利人和皆備，現在正是維持既定方針、穩步前進的最佳時機，不宜輕易改變。",
        "8": "你面對的外在困境已經積累太久，現實狀況比預期更加嚴峻，認清這個事實並暫時避開正面衝突，等待更好的時機。",
        "9": "你察覺外在強勢已達頂峰開始轉弱，舊有格局即將改變，順應這個轉變趨勢來重新布局，而非硬碰硬地抵抗。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，這些變化雖然還不穩定，但正是調整策略的好時機，順應這些新趨勢做出靈活修正。",
        "7": "你看見外在大勢正朝有利方向發展，天時地利都在你這邊，繼續維持現有方向穩步前進，不必急於改變既定路線。",
        "8": "你面對的外在環境已經僵化固定，積累的阻力太過沉重，認清現實選擇暫時避讓，等待更適合的時機再行動。",
        "9": "你感受到外在強勢已達頂峰開始轉弱，舊有格局即將改變，順應這個轉變趨勢調整自己的位置和策略方向。"
      }
    }
  },
  "41": {
    "number": 41,
    "name": "損",
    "code": "110001",
    "卦解": "你現在正處在一個需要適度收斂的階段。外在環境雖然不算太順暢，但也不至於完全阻塞，就像河流遇到一些小石頭，水還是能夠流動，只是速度放緩了些。你的內在能量其實比表面看起來要充足，有種蓄勢待發的感覺，但暫時還沒找到完全釋放的出口。整體氛圍就像是在為某個重要時刻做準備，需要先整理內務、減少不必要的消耗。雖然變化不大，但你能感受到一種漸進式的累積正在發生。",
    "六階段": {
      "1": "你的內在基礎相當穩固，就像找到了對的頻道一樣，與周圍的人事物都能輕鬆配合。你會發現自己在處理各種關係時特別順手，原本堵塞的溝通管道開始一個個打通。內心感到輕鬆自在，不再需要強求什麼，反而在這種自然的狀態下，事情進展得比預期還要順利。周圍的環境也很友善，給你足夠的空間去發揮。",
      "2": "你的表現雖然看起來沒有太大的起伏，但這正是你的優勢所在。你學會了在平穩中保持自己的節奏，不急不躁地把一些小缺失慢慢修補好。內心有種踏實的安全感，知道穩紮穩打比急功近利更有價值。外在環境可能不會給你太多驚喜，但也不會有什麼大風大浪，正好讓你專心做好手頭的事情。",
      "3": "你的潛能還在醞釀階段，路上會遇到不少干擾和雜音，讓你感到有些迷茫。短期內可能看不到明顯的成長，這讓你偶爾會懷疑自己的方向是否正確。內心會有些焦慮和不耐煩，特別是看到別人似乎進展更快的時候。外在環境比較複雜多變，各種訊息和選擇讓你眼花撩亂，需要更多耐心去過濾和選擇。",
      "4": "外在條件開始變得清晰明朗，就像雜草被清除後的道路變得筆直通暢。你會發現各種資源和機會開始對齊，不再像之前那樣零散混亂。內心感到振奮和充滿希望，因為你終於能夠看到具體的進展。環境變得更加有序和支持性，那些不必要的干擾因素被過濾掉，讓你能夠專注在真正重要的事情上。",
      "5": "目前的外在環境相當穩定，一切都在按部就班地進行。你不會感到特別的壓力或急迫感，因為進展速度剛剛好，在你能掌控的範圍內。內心平靜而有信心，知道只要保持現在的節奏就能達到目標。周圍的人事物都很配合，沒有太多突發狀況需要處理，讓你可以從容不迫地處理每一個細節，享受這種有條不紊的感覺。",
      "6": "未來的趨勢顯示會有一些挑戰和阻力，推進起來會比較吃力。你可能會遇到一些卡點，需要先回頭補強一些基礎條件才能繼續前進。內心會感到有些沈重和壓力，因為事情不像預期那樣順利。外在環境變得更加嚴格和挑剔，需要你做好更充分的準備。不過這也是一個重新檢視和調整的好機會，為下一階段奠定更堅實的基礎。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖，此時應順應當下情況靈活調整學習方向，不必執著於既定計畫，保持開放心態重新建構根基。",
        "7": "你的底子正處於穩健發展階段，應持續在既有基礎上深耕細作，維持目前的學習節奏與方向，天時地利人和皆有利於你紮實累積核心競爭力。",
        "8": "你長期積累的舊習慣或過時技能已成包袱，必須認清現實放下執念，避免繼續投入無效努力，重新審視什麼才是真正需要的基礎能力。",
        "9": "你過往引以為傲的專長已達巔峰難以突破，應順應時代變遷主動轉型，將既有經驗轉化為新領域的基石，以柔克剛重建競爭優勢。"
      },
      "2": {
        "6": "你的外在形象容易因小事而搖擺不定，此時應該順應當下情況靈活調整表現方式，不必過分堅持既定的外在姿態，適度修正能讓你更受歡迎。",
        "7": "你現在的外在表現正合乎時勢所需，應該維持這種謙遜而有節制的姿態繼續前進，這樣的損己利人之風將為你贏得更多信任與支持。",
        "8": "你長期建立的外在形象已經過於固化難以改變，現在要認清現實避免強求突破，接受目前的定位並在既有框架內發揮所長即可。",
        "9": "你過去強勢的外在表現已到轉折點，應該順應時勢轉變為更加謙和低調的姿態，主動收斂鋒芒將為你開啟新的發展空間。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應順應內心感受適時調整發展方向，不要固執於原有計畫，靈活修正才能開拓更廣闊的成長空間。",
        "7": "你具備穩定向上的成長動能，應持續在既定軌道上精進努力，保持內在修為的積累，這段時期正是奠定未來實力的關鍵時刻。",
        "8": "你需要認清自身成長的現實限制，避免過度消耗既有能量，重新審視內在資源配置，將注意力集中在最核心的能力提升上。",
        "9": "你的成長模式已達高峰需要轉換，順應內在智慧的指引調整努力方向，放下過往的執著，迎接全新階段的蛻變與突破。"
      },
      "4": {
        "6": "你需要敏銳觀察外在環境的微妙變化，當發現不利因素開始顯現時，要立即調整策略方向，避免在錯誤的環境條件下堅持到底。",
        "7": "你正處於有利的外在環境中，各種條件都在朝著正面方向發展，此時應該把握時機繼續推進計畫，順應這股良好趨勢前行。",
        "8": "你面對的外在環境已經形成不利局面且難以改變，與其對抗既定的困難條件，不如承認現實並尋找其他可行的發展方向。",
        "9": "你所依賴的外在有利條件已接近轉折點，應該及早準備面對環境變化，順應即將到來的新局面而非固守當前優勢。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，當前的損減策略需要靈活調整，不要固守原有做法，順應環境變化來修正你的減損方向。",
        "7": "你看見外在趨勢明確向好，現在的損減投入正合天時，堅持當前的犧牲付出策略，繼續朝既定目標穩步前進。",
        "8": "你面對的外在困境已經積累太深，現有的損減努力難以扭轉大局，認清現實狀況，暫時避開正面衝突尋找其他出路。",
        "9": "你察覺外在強勢已到盛極而衰的轉折點，過度的損減即將結束，順應這個自然轉變，準備迎接新的發展機會。"
      },
      "6": {
        "6": "你需要靈活觀察外在環境的微妙變化，當發現趨勢出現轉折時，要及時調整策略方向，避免固守過時的做法而錯失良機。",
        "7": "你應該順應當前環境的正向發展趨勢，保持既定的前進步調，這是天時地利人和的時機，持續推進會有良好成果。",
        "8": "你必須正視外在環境已經積累的沉重負擔和阻力，現實條件已難以改變，暫時避開直接衝突是明智的選擇。",
        "9": "你要認清外在環境的強勢已到達頂點開始轉弱，順應這個自然轉換的趨勢，準備迎接新的發展階段的來臨。"
      }
    }
  },
  "42": {
    "number": 42,
    "name": "益",
    "code": "100011",
    "卦解": "你現在處在一個穩定而溫和的成長期，就像春天的樹木正在默默積蓄養分。你的內在雖然還在調整節奏，但外在環境對你相當友善，有種被支持著的感覺。整體來說，你的生活步調不急不躁，變化也不會太劇烈，一切都在按部就班地進行著。雖然進展看起來不算快，但你能感受到各方面的條件正在慢慢整合，就像拼圖的碎片逐漸找到自己的位置，累積出一種踏實的前進動能。",
    "六階段": {
      "1": "你的內在根基正在穩固建立，每一步努力都能看見明確的成果。心中充滿踏實感，因為付出的時間和精力都有回報，不再是盲目摸索。周圍的人開始注意到你的改變，給予更多支持和認同。這種持續向上的動能讓你對未來充滿信心，知道只要保持這個節奏，目標就在不遠處等著你。",
      "2": "你的表現開始展現連貫性，各項能力串聯起來形成穩定的產出。內心感到一種從容不迫的自信，因為你已經找到屬於自己的節奏和方法。環境對你越來越友善，合作機會增加，資源也更容易取得。這段時間你會發現自己的成長曲線平穩上升，每個階段都比前一個更加完善。",
      "3": "你正在整合內在的各種可能性，雖然過程中會遇到一些成本考量和效益權衡。心情時而興奮時而謹慎，因為機會很多但需要做出選擇。外在環境給出的訊號有些複雜，需要你更仔細地分析和判斷。雖然短期內進展有限，但這個階段的思考和準備將為後續的突破奠定重要基礎。",
      "4": "環境條件開始對你有利，各種資源和機會能夠順暢地傳遞到你身邊。你感受到一種暢通無阻的愉悅，因為之前的努力終於在外在世界找到了對應的出口。周圍的人事物都顯得井然有序，彷彿一切都在為你的目標讓路。這個時期你會發現自己的影響力開始向外延伸，產生更大的效應。",
      "5": "你與外在環境的互動變得極其順暢，無論是溝通、合作還是資源交換都非常流暢。內心充滿活力和滿足感，因為你已經找到與世界對話的最佳方式。環境持續提供新的可能性，各種通道都為你保持開放狀態。這是一個收穫豐富的時期，你會感受到付出與回報之間的完美平衡。",
      "6": "你即將完成這個階段的主要任務，成長的速度開始趨於平緩但更加穩定。內心有一種即將圓滿的安定感，同時也在為下一個階段做準備。外在環境提醒你要善始善終，把該完成的事情都處理好。這個時期適合回顧和整理，確保沒有遺漏重要的細節，為新的開始創造最好的條件。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚在變動中，此時應順應當下情況靈活調整學習方向，不必固執於既定計畫，透過修正與適應來穩固根基。",
        "7": "你的基礎能力正處於上升趨勢，應該持續在既有方向上努力精進，維持學習的節奏與專注度，讓根基更加紮實穩固。",
        "8": "你的基礎能力已有固化傾向，必須認清現實中的不足之處，避免過度依賴舊有經驗，重新審視自己的能力架構。",
        "9": "你的基礎能力已達到一個階段的極限，應順應時勢轉變學習重點，讓既有根基成為新發展的跳板而非束縛。"
      },
      "2": {
        "6": "你在外表現出的不穩定正是調整的契機，順應內心真實想法，適時修正你的言行舉止，讓外在形象更貼近內在品格。",
        "7": "你展現出的積極面貌正合時宜，繼續保持這種向上的外在表現，讓你的正面形象成為他人學習的典範。",
        "8": "你已經習慣的外在表現模式難以改變，認清這個現實後，暫時避免強求改變形象，專注內在修養即可。",
        "9": "你過度強勢的外在表現已到極限，順應時勢轉為謙和低調，讓你的外在形象回歸平和自然的狀態。"
      },
      "3": {
        "6": "你的成長路徑需要靈活調整，當發現某些能力發展遇到阻礙時，不要固執己見，適時修正方向才能找到真正適合的增強空間。",
        "7": "你正處於能力提升的黃金期，應該持續在既定的成長軌道上努力，保持學習的節奏和方向，讓潛力自然而穩健地展現出來。",
        "8": "你必須認清某些根深蒂固的限制已難以突破，與其消耗精力在無望的領域，不如避開這些束縛，尋找其他可行的成長途徑。",
        "9": "你過往的優勢即將轉換，應該順應這個變化趨勢，將累積的經驗轉化為新的成長動能，在轉折中發現不同的發展可能性。"
      },
      "4": {
        "6": "你觀察到外在環境正在微妙變化，這些不穩定的訊號提醒你及時調整策略，順應環境波動來修正原有計畫，把握變化中的新機會。",
        "7": "你發現外在條件正朝著有利方向發展，天時地利人和皆備，此時應該堅持既定方針繼續前進，不要因小的波動而改變大方向。",
        "8": "你面對的外在環境已經形成不利的固化格局，積重難返的現實需要你認清並避開正面衝突，尋找其他突破口或暫時退守。",
        "9": "你察覺外在環境的優勢已達頂峰開始轉弱，強弩之末的態勢要求你主動順應這個轉變，提前佈局下一階段的發展方向。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變化雖然還不明顯，但已經開始影響整體局勢，你需要敏銳捕捉這些信號並適時調整策略。",
        "7": "你看見外在環境正朝著有利的方向發展，各種條件都在配合你的行動，你應該把握這個良好時機，堅定地按既定方向前進。",
        "8": "你面對的外在環境已經形成固定格局，各種阻礙因素根深蒂固難以改變，你必須接受現實限制，避免硬碰硬的無謂消耗。",
        "9": "你感受到外在環境的強勢力量已達頂峰開始轉弱，舊有的格局即將發生根本性變化，你要順應這個轉換期的自然規律。"
      },
      "6": {
        "6": "你需要密切關注環境變化的細微信號，當外在趨勢出現波動時，要靈活調整策略方向，不可固執己見而錯失轉機。",
        "7": "你應該順應當前的有利環境趨勢，保持既定方向穩步前進，此時外在條件正朝著對你有益的方向發展。",
        "8": "你必須正視外在環境已形成的不利格局，避免硬碰硬的對抗，暫時收斂鋒芒等待更好的時機到來。",
        "9": "你要察覺到外在優勢環境即將轉變的徵兆，主動順應新的趨勢走向，及早為下一階段做好準備布局。"
      }
    }
  },
  "43": {
    "number": 43,
    "name": "夬",
    "code": "111110",
    "卦解": "你現在處在一個蓄勢待發的狀態，內心充滿能量和想法，但外在環境卻像有層層阻礙，讓你感到推進緩慢。這種感覺就像你明明有很多想做的事，也有足夠的實力，但總是遇到各種卡點和延遲。你的內在動力很強，想法也很清晰，可是要真正落實到現實層面時，就會發現阻力比想像中大。整體氛圍有點像在濃霧中開車，你知道方向是對的，也有足夠的油料，但能見度有限，只能慢慢前進。",
    "六階段": {
      "1": "你正處在決斷的起始階段，內心雖有想法但還不急躁，選擇穩紮穩打地處理眼前的小缺失。你感到踏實而專注，知道急不得，先把基礎打好比什麼都重要。周圍環境相對平靜，沒有太大壓力催促你，正好給了你充分的時間去思考和準備。這種從容不迫的節奏讓你能夠仔細檢視每個細節，為後續的行動奠定堅實基礎。",
      "2": "你開始感受到各種聲音和資訊湧入，內心有些躁動不安，想要行動卻又被雜音干擾。你努力在眾多意見中尋找方向，但發現局面還沒有清晰的輪廓浮現。外在環境充滿變數，不同的聲音此起彼落，讓你難以判斷哪些是重要訊息。你學會在這種混沌中保持冷靜，知道現在還不是大動作的時候，需要更多耐心去等待明確的信號出現。",
      "3": "你感到內在力量開始甦醒，思路變得清晰連貫，行動也更有章法。心中的決心逐漸堅定，你開始看見突破的路徑，每一步都環環相扣。外在環境開始出現積極回應，原本卡住的關節點陸續鬆動，讓你感受到明顯的進展。你的信心大增，知道自己走在正確的道路上，內心充滿期待，準備迎接更大的挑戰和機會。",
      "4": "你的影響力開始向外擴展，但也遇到一些新的阻力和複雜情況。內心有些焦慮，擔心步調太快會出亂子，你意識到需要更謹慎地處理權責分配。外在環境變得更加複雜，涉及的人事物增多，偶爾出現溝通不順或流程卡關的狀況。你學會放慢腳步，先把規則和界限理清楚，確保每個人都明白自己的角色，再繼續往前推進。",
      "5": "你感到前所未有的自信和掌控感，主張明確建立後，一切都開始順暢運轉。內心充滿成就感，看著計畫一步步實現，每個環節都緊密配合。外在環境高度配合，各個節點如齒輪般精準咬合，進度穩定而持續。你享受這種掌舵的感覺，知道自己的決斷是正確的，團隊和環境都在支持你的方向，讓你對未來充滿信心。",
      "6": "你已經進入收尾階段，內心平靜而專注，知道勝利在望只需要按部就班完成。雖然偶爾還有小插曲，但你已經有足夠經驗處理，不再感到慌亂。外在環境整體穩定，流程運作順暢，就像一台調校好的機器按表操課。你感到滿足和安心，知道最困難的部分已經過去，現在只需要保持專注，把最後幾個步驟完美執行完畢。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力還在變動中，此時應順勢調整學習方向，不必急於定型，保持開放心態去修正自己的根基，讓能力更紮實穩固。",
        "7": "你的底子正值成長期，應維持當前的努力方向持續前進，順應天地趨勢深耕基本功，讓根基在穩定中逐步壯大。",
        "8": "你過往累積的基礎已形成固定模式難以改變，應認清現實避免強求突破，接受現有能力範圍內的發展可能性。",
        "9": "你的基礎能力已達頂峰開始轉變，應順應這個自然轉化過程，讓舊有根基轉化為新的能力基礎，迎接下一階段。"
      },
      "2": {
        "6": "你在外表現出的態度容易搖擺不定，此時應該順應情勢變化，適時調整自己展現給他人的形象和立場，不必堅持原有的外在姿態。",
        "7": "你展現出來的決斷力正合時宜，應該維持目前這種果決明快的外在表現，繼續以堅定的姿態面對眾人，推進既定的計劃。",
        "8": "你長期積累的外在形象已經僵化固著，必須認清這個現實，暫時避免強行改變給人的印象，先從內在做起再談外在調整。",
        "9": "你過於強勢的外在表現已達極限，應該順應情勢轉變，適時收斂鋒芒，以更柔和謙遜的方式與他人互動，避免物極必反。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，此時應順應內心的調整需求，靈活修正發展方向，不要固執於原有計畫，適時的改變將為你開啟新的成長空間。",
        "7": "你的成長動能正順應天地大勢，應該堅定維持目前的發展軌道，持續在既定方向上精進努力，這股正向能量將帶領你穩步提升實力。",
        "8": "你在成長路上已累積過多包袱，必須認清現實並避免繼續在錯誤方向投入，暫時停下腳步重新檢視，才能為真正的突破做好準備。",
        "9": "你的成長能量已達高峰但開始轉向，應順應這股轉變的趨勢，將過往累積的實力轉化為新的發展模式，迎接下一階段的蛻變機會。"
      },
      "4": {
        "6": "你需要密切觀察外在環境的微妙變化，當發現不利趨勢時要及時調整策略，保持靈活應變的態度來順應時勢。",
        "7": "你可以看到外在條件正朝有利方向發展，這是天時地利的好時機，應該堅定信心持續推進既定計畫。",
        "8": "你面對的外在阻力已經根深蒂固難以撼動，與其硬碰硬不如暫時避開鋒芒，等待更有利的時機再行動。",
        "9": "你察覺到外在環境的強勢已達頂點即將轉變，此時要順應這個自然轉換，準備迎接新的局面發展。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變化雖然還不明顯，但已經開始影響整體局勢，你需要敏銳地順應這些初期變化，及時調整自己的策略和行動方向。",
        "7": "你看見外在環境正朝著有利的方向發展，天時地利人和都在支持你的決斷，你應該把握這個良好的外在條件，堅定地維持既定方針，繼續向前推進。",
        "8": "你面對的外在環境已經固化成難以撼動的格局，既有的阻礙和困難根深蒂固，你必須認清這個嚴峻的現實狀況，避免硬碰硬的無謂衝突。",
        "9": "你察覺外在環境的強勢表象背後已露疲態，原本看似堅固的阻力其實已到轉折點，你要順應這個即將到來的轉變，準備迎接新的局面。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，這些變動雖然還不明顯，但已露出端倪。此時應該保持敏銳度，隨時準備調整策略以適應即將到來的趨勢轉換。",
        "7": "你看見外在大勢正朝著有利方向發展，天時地利皆在你這一邊。現在正是順應這股強勁趨勢，堅定地維持既定方針，讓成功水到渠成的最佳時機。",
        "8": "你面對的外在環境已經形成強大阻力，舊有模式根深蒂固難以撼動。與其硬碰硬消耗實力，不如認清現實，暫時避其鋒芒，尋找其他突破口。",
        "9": "你察覺外在強勢已達頂峰開始轉弱，原本的優勢環境即將生變。明智的做法是順應這個轉換點，提前布局新的發展方向，避免被舊勢力拖累。"
      }
    }
  },
  "44": {
    "number": 44,
    "name": "姤",
    "code": "011111",
    "卦解": "你現在處在一個相當有力量的狀態中，整體條件對你是有利的。雖然事情的推進節奏不算完全順暢，但大方向還是在往前走的。你會發現外在環境給你的支持比內在的準備要來得更充足一些，有種被推著前進的感覺。短期內可能不會有太劇烈的變化，但你能感受到各種因素正在慢慢整合，力量在默默累積中。這是一個穩健向上的階段，雖然步調有時會有些不太協調，但整體的能量流動是正面的。",
    "六階段": {
      "1": "你正站在全新的起點上，面對著陌生的人事物，內心既期待又忐忑。這段時間你會發現很多事情都還沒有明確的規則可循，做起來特別吃力，常常需要反覆確認和調整。周圍的環境也還在摸索階段，大家都在試著找出最適合的合作模式。建議你先把基本的框架和標準建立好，這樣後續的發展才會更順利。",
      "2": "你開始與新的夥伴或環境建立連結，但這份關係還很脆弱，時常出現溝通上的落差。你可能會感到有些挫折，因為原本以為簡單的事情卻一再卡關。外在環境也呈現不穩定的狀態，各種配合都還在磨合中。這時候你需要耐心地把合作的細節談清楚，把可能的漏洞都先補起來，才能避免後續更大的問題。",
      "3": "你漸漸找到了屬於自己的節奏，雖然變化不算太大，但至少能穩定地往前推進。內心開始有了踏實感，不再像之前那樣焦慮不安。周圍的環境也趨於平穩，雖然還有一些小缺口需要處理，但已經不影響整體的進展。你可以按部就班地把剩下的問題逐一解決，相信很快就能看到更明顯的成果。",
      "4": "你發現外在環境開始出現新的變數，有些原本穩定的流程偶爾會被打斷。內心可能會有些緊張，擔心這些變化會影響既定的計畫。周遭的人事物也因為新因素的介入而需要重新調整配合方式。建議你主動更新聯絡名單和時程安排，確保所有相關人員都能即時掌握最新狀況，這樣就能將衝擊降到最低。",
      "5": "你成功地將新的變化融入到主要的運作模式中，整個流程重新變得順暢起來。內心感到相當滿足，因為你證明了自己有能力處理複雜的狀況。外在環境也配合得很好，各個環節都能無縫接軌，讓你的成果能夠持續穩定地產出。這是一個豐收的階段，你可以充分展現自己的能力和價值。",
      "6": "你感受到這一波的相遇即將告一段落，新的因素開始逐漸淡出你的生活。內心有些不捨，但也明白天下沒有不散的筵席。外在環境正在回歸到相對平靜的狀態，是時候為這個階段做個完美的收尾了。把還沒處理完的細節都整理好，為下一個循環做好準備，這樣你就能帶著滿滿的收穫迎接新的開始。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖，此時應主動檢視自己的根基，適時調整學習方向，不要急於展現，先把底子打牢再說。",
        "7": "你的基本功底正在順利累積，這是建立實力的好時機，應該持續專精本業，按部就班地強化核心能力，讓根基更加深厚穩定。",
        "8": "你過去養成的基礎習慣已經僵化，難以適應新局面的要求，必須認清現實，避免固守舊有模式，重新審視自己的能力結構是否需要更新。",
        "9": "你原有的基礎優勢已達頂點開始衰退，不能再依賴過去的老本，應順應時勢主動轉型，將既有根基轉化為新領域的起點。"
      },
      "2": {
        "6": "你的外在形象容易搖擺不定，此時應該主動調整表達方式，順應當下情勢修正自己的言行舉止，讓別人看到你的靈活適應能力。",
        "7": "你展現出來的樣子正合天時地利，應該維持目前的外在表現繼續前進，讓你的積極正面形象成為吸引他人合作的關鍵力量。",
        "8": "你過去累積的外在形象已經定型難以改變，應該認清現實避免強行扭轉，專注於內在修養而非急於改變他人對你的既有印象。",
        "9": "你一直以來的強勢外在表現已到臨界點，應該順應時勢轉變為更柔和的姿態，讓別人感受到你願意放下身段的誠意。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該靈活調整發展方向，不要固執於原有計畫，順應內在變化來修正自己的能力培養重點。",
        "7": "你具備良好的成長基礎，應該堅持既定的能力提升路線，持續投入時間精力，讓潛能在穩定前進中逐步開花結果。",
        "8": "你需要認清當前能力的局限性，避免好高騖遠的成長目標，專注於基本功的紮實訓練，從根本處重新建立實力。",
        "9": "你過往的成長模式已達極限，應該順應時勢轉換發展跑道，放下舊有的優勢包袱，開啟全新的潛能開發方向。"
      },
      "4": {
        "6": "你面對的外在環境正在微妙變化，雖有不穩定因素，但仍有調整空間。密切觀察市場動向，靈活修正策略，把握時機順勢而為。",
        "7": "你所處的外在條件正值有利時機，大環境趨勢明朗向上。保持既定方針持續前進，但要留意觀察環境變化的早期信號。",
        "8": "你面臨的外在環境已形成不利格局，積累的問題難以在短期內扭轉。認清現實限制，暫時避開正面衝突，等待更好時機。",
        "9": "你眼前的有利外在條件已達頂峰，即將出現轉折。主動順應環境變化趨勢，提前布局應對新局面，避免被動挨打。"
      },
      "5": {
        "6": "你觀察到外在環境正處於微妙變化中，此時應保持敏銳洞察力，隨時準備調整策略，不要固執己見，順應環境變化才能化解潛在危機。",
        "7": "你看見外在趨勢正朝有利方向發展，應堅持既定方針繼續前進，保持正道而行，順應天地自然規律，必能收穫豐碩成果。",
        "8": "你面對的外在局勢已經積累過多負面因素，現實環境對你極為不利，應認清形勢避其鋒芒，暫時退守等待時機再起。",
        "9": "你察覺外在強勢力量已達頂峰開始轉弱，此時不宜硬碰硬對抗，應順應這股轉變趨勢，以柔克剛方能化險為夷。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，這些新興趨勢雖然還不明朗，但值得你靈活調整策略，順應這些初現的轉機。",
        "7": "你看見外在大勢正朝有利方向發展，天時地利皆在你這一邊，此時應該堅定信念，維持既定方向持續前進。",
        "8": "你必須認清外在環境已經形成難以撼動的格局，與其硬碰硬消耗實力，不如暫時避開鋒芒，保存力量待時而動。",
        "9": "你察覺外在強勢已達頂峰開始轉弱，這個轉折點正是你的機會，順應這股變化的潮流，迎接新局面的到來。"
      }
    }
  },
  "45": {
    "number": 45,
    "name": "萃",
    "code": "000110",
    "卦解": "你現在就像站在一個聚會的邊緣，想要融入人群卻感覺有些力不從心。周圍的人際網絡看起來很活躍，但你與他們的步調總是有些微妙的不同步，交流中時常遇到小小的阻礙。你的外在表現比內在感受要強勢一些，給人的印象可能比實際狀況更有自信。整個氛圍有種「想聚卻聚不攏」的感覺，雖然變化不大，但你隱約感覺到隨著時間推移，這些零散的連結正在慢慢變得更加穩固。",
    "六階段": {
      "1": "你正處在一個新計畫的起點，手邊的資源和人力都還不夠充足，心裡有些焦急想要快速推進。但現在最重要的是先穩住基本盤，把自己的核心能力和必要條件準備好。周圍的環境還在觀望，人們對你的想法持保留態度。這時候不要急著大聲號召，先把自己的根基打穩，讓別人看到你的決心和實力，自然會有人願意加入。",
      "2": "你開始感受到團隊的力量，一個個關鍵的夥伴陸續到位，每個人都找到了自己的角色。內心充滿期待，看到進展逐步展現，信心也隨之增長。外在環境變得更加友善，原本的阻力開始化解，合作的氣氛愈來愈濃厚。你發現只要把每個節點都扣緊，整個流程就能順暢運行，成果也開始一段段地累積起來。",
      "3": "你遇到了一些意想不到的阻礙，推進的速度變得緩慢，心裡開始有些挫折感。雖然大方向是對的，但細節上總是出現零星的問題，讓你感到有些疲憊。外在環境出現了一些變化，原本順利的配合開始出現縫隙。這時候需要停下來檢視，哪些必要條件還沒有完全到位，先把這些基礎問題解決了，才能繼續往前走。",
      "4": "你發現外部的支援點不夠充足，想要對接的資源總是難以順利串聯，心裡有種孤軍奮戰的感覺。雖然內部團隊運作良好，但要擴大影響力時卻處處碰壁。外在環境缺乏足夠的橋樑和平台，讓你的想法難以傳達到更廣的範圍。現在需要先投資建立更多的會合節點，培養關鍵的中間人和資源管道，為後續的發展鋪路。",
      "5": "你的核心陣地已經穩固建立，心裡充滿成就感和掌控感。各個點位開始串聯成面，影響力逐漸擴散，整個局面呈現穩定成長的態勢。外在環境對你愈來愈友善，支持的聲音明顯增加，合作機會也不斷湧現。你感受到一種統籌全局的力量，每個決策都能產生連鎖效應，推動整個版面持續向前發展。",
      "6": "整個集結過程已經接近尾聲，你內心感到一種圓滿的滿足，同時也有些不捨這段充滿挑戰的歷程。節奏變得從容穩當，不再需要大張旗鼓地推動，更多是在收尾和完善的工作。外在環境已經形成良好的生態，各方面的配合都很順暢。你正在一邊收穫成果，一邊補強最後的缺口，為下一個階段做好準備。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外界變化而動搖，此時應順應環境調整學習方向，不要固執己見，靈活修正才能打好根基。",
        "7": "你的基本功底扎實且正在上升軌道，應該持續精進核心能力，保持學習熱忱，順應成長趨勢穩步向前不懈怠。",
        "8": "你的基礎能力已形成固化模式難以改變，需要認清自身局限性，避免勉強挑戰超出能力範圍的目標，務實為上。",
        "9": "你的基礎能力已達巔峰但開始顯露疲態，應順應自然規律適時轉換跑道，將accumulated experience轉化為新的發展方向。"
      },
      "2": {
        "6": "你的外在表現容易搖擺不定，此時應順勢調整自己的形象與態度，不必固執於單一面貌，靈活修正展現方式才能更好地凝聚人心。",
        "7": "你展現出來的樣子正合時宜，順應天地聚合的趨勢，維持現在積極正面的外在形象，持續前進必能吸引更多志同道合的人。",
        "8": "你長期累積的外在形象已形成固定印象難以改變，認清這個現實後應避免強行扭轉，接受現狀並在既有基礎上尋求突破。",
        "9": "你過度強勢的外在表現已達極限開始產生反效果，順應時勢轉變展現更柔和包容的一面，才能重新凝聚周圍的支持力量。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該靈活調整學習方向和發展策略，不要固執於既定計劃，順應內心真實需求來修正前進路徑。",
        "7": "你的成長動能正順應天時地利，應該保持現有的學習節奏和發展方向，持續投入努力，讓潛力在穩定前進中逐步展現。",
        "8": "你需要認清成長路上的積累負擔已經過重，應該暫時避開過度擴張，專注於消化既有經驗，重新整理基礎能力。",
        "9": "你的成長衝勁已達高峰開始轉向，應該順應這個轉變時機，將過往累積的能量轉化為更深層的智慧和內在修養。"
      },
      "4": {
        "6": "你面對的外在環境正在快速變化，當前的有利條件可能隨時反轉，你需要保持敏銳觀察力，及時調整策略以順應環境波動。",
        "7": "你所處的外在環境呈現良好發展趨勢，各種條件都朝著有利方向發展，你應該堅持既定方向，把握這股順勢而為的力量。",
        "8": "你面臨的外在環境已經形成不利的固化格局，既有的阻礙因素根深蒂固，你必須認清現實，避開正面衝突尋找迂迴之路。",
        "9": "你眼前的有利外在條件已達頂峰開始轉弱，過度依賴現有優勢將帶來風險，你要順應這個轉變趨勢提前做好應對準備。"
      },
      "5": {
        "6": "你觀察到外在環境正處於變動期，各方勢力重新洗牌，此時應靈活調整策略，順應這些變化來修正原有計畫，把握機會重新定位。",
        "7": "你看見外在大環境正朝著有利方向發展，各種條件逐漸成熟，應該堅持既定方針持續前進，順著這股天時地利的趨勢穩步推進。",
        "8": "你面對的外在現實已形成固化格局，既有的阻礙和限制根深蒂固難以撼動，必須認清這個事實，避開正面衝突尋找其他出路。",
        "9": "你察覺外在環境的主導力量已到達頂峰開始轉弱，舊有秩序即將改變，應順應這個轉變趨勢，準備迎接新局面的到來。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動期，趨勢尚未明朗，此時應保持靈活應變的心態，隨時準備調整策略方向，避免過度堅持既定計畫。",
        "7": "你看見外在大勢正朝向有利方向發展，這是順應天時的好機會，應該堅定地維持現有路線，持續向前推進你的目標。",
        "8": "你面對的外在環境已經形成強大阻力，既有的不利趨勢難以扭轉，現在需要認清現實狀況，暫時迴避正面衝突為上策。",
        "9": "你察覺外在的強勢趨勢已達頂峰即將轉向，舊有的環境格局正在鬆動，應該順應這個轉變契機，準備迎接新的發展階段。"
      }
    }
  },
  "46": {
    "number": 46,
    "name": "升",
    "code": "011000",
    "卦解": "你現在就像一個正在慢慢爬山的人，雖然體力不算特別充沛，但路況還算可以走得通。你內心其實蠻有想法和動力的，比外在表現出來的要強烈一些。整個前進的節奏有點不太穩定，時快時慢，但大方向還是在往上走的。你能感覺到進展很緩慢，每一步都需要一些時間來站穩腳跟，不過隨著你越來越熟悉這個節奏，後面的路應該會走得比較順暢一些。",
    "六階段": {
      "1": "你現在站在起點，發現基礎還不夠穩固。內心雖然充滿上進的渴望，但也清楚知道急不得。周圍的環境似乎在提醒你，那些看似簡單的準備工作其實最為重要。你開始重新審視自己的能力和資源，默默地補強那些被忽略的細節。這個階段讓你學會謙遜，明白任何偉大的成就都始於扎實的根基。雖然進展緩慢，但你感受到一種踏實的安全感。",
      "2": "你找到了屬於自己的節奏，每一步都走得穩健而有力。內心逐漸平靜下來，不再焦慮於速度的快慢，而是專注於每個動作的品質。外在環境開始對你的表現給予正面回應，你感受到一種自然的流暢感。這種穩定的進展讓你建立起自信，你開始相信只要保持這樣的步調，目標就在不遠處。周圍的人也注意到你的改變，給予更多的支持。",
      "3": "你的能量開始爆發，一個成果接著一個成果出現。內心充滿了成就感和動力，感覺自己正在攀登一座又一座的高峰。外在環境變得更加有利，機會接連出現，彷彿所有的努力都在此刻開花結果。你發現自己的潛力遠比想像中更大，每一次的突破都為下一次奠定更高的起點。這個階段讓你體會到什麼是順勢而為，什麼是勢不可擋的成長動能。",
      "4": "外在環境開始出現一些變化，雖然有起伏但還在可控範圍內。你發現即使面對這些波動，依然能保持原有的節奏和方向。內心變得更加沉穩，學會在變化中尋找平衡點。你開始主動處理那些小小的缺口和問題，不讓它們累積成更大的障礙。這個階段教會你適應性的重要，讓你明白真正的成長不是一帆風順，而是在挑戰中保持初心。",
      "5": "你已經站在相當的高度上，周圍的環境相對穩定。內心充滿了從容和自信，但仍保持著持續精進的心態。外在的大環境對你十分有利，你可以在這個平台上發揮更大的影響力。你學會了邊前進邊調整的智慧，不斷優化自己的位置和策略。這個階段讓你感受到一種掌控感，同時也明白維持這個高度需要持續的努力和細心的經營。",
      "6": "你接近了這個階段的終點，但發現這其實是另一個開始的起點。內心充滿了完成感，同時也對未來充滿期待。外在環境顯示著持續上升的趨勢，你的努力正在開花結果，影響力還在不斷擴大。你發現自己建立的連接和網絡都還在發揮作用，成果的完成度持續提高。這個階段讓你體會到真正的成功不是終點，而是一個能夠延續和傳承的過程。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚有不足之處，但這正是成長的起點。順應當前的學習機會，主動調整自己的知識結構和技能配置，為未來的提升奠定更穩固的根基。",
        "7": "你的底子扎實且具備良好的發展潜力，這是天時地利的配合。保持現有的學習節奏和努力方向，持續精進核心能力，自然能為更高層次的發展做好準備。",
        "8": "你過去積累的基礎已經固化，難以快速改變現狀。認清自己的能力邊界和局限性，避免勉強追求超出根基承載的目標，務實地規劃發展路徑。",
        "9": "你的基礎能力已達到一個階段的巔峰，繼續用舊方式提升效果有限。順應時勢轉變學習模式，從accumulation轉向整合應用，尋找新的成長方向。"
      },
      "2": {
        "6": "你的外在表現還不夠穩定，容易給人搖擺不定的印象。此時應該順應環境變化，適時調整自己的言行舉止，讓別人看到你的彈性與適應力。",
        "7": "你展現出來的形象正合時宜，符合當下的發展趨勢。你應該保持這種積極向上的外在表現，繼續以這樣的姿態面對眾人，穩步向前。",
        "8": "你長期以來的外在形象已經定型，想要改變他人對你的既定印象並不容易。你需要認清這個現實，避免強求立即的形象轉變。",
        "9": "你過去強勢的外在表現已經到了該轉換的時候，繼續維持強硬姿態反而會適得其反。你應該順應時機，展現更加柔和包容的一面。"
      },
      "3": {
        "6": "你的成長潛力正處於變化期，應該靈活調整發展方向，不要固執於既定計畫，順應內在變化找到更適合的提升路徑。",
        "7": "你具備良好的成長基礎，應該堅持當前的努力方向，持續投入學習與實踐，讓潛力在穩定前進中逐步開花結果。",
        "8": "你需要認清目前成長受限的現實狀況，避免在舊有模式中消耗精力，重新審視自己的能力邊界與發展可能性。",
        "9": "你的某些能力已達高峰需要轉型，應該順應時勢調整成長方向，將既有優勢轉化為新領域發展的基石。"
      },
      "4": {
        "6": "你需要密切觀察外在環境的微妙變化，當發現條件不如預期時要及時調整策略，靈活應對才能化解不利因素。",
        "7": "你面臨的外在環境正處於上升趨勢，應該把握這個有利時機，堅持既定方向持續前進，順勢而為必有所獲。",
        "8": "你必須認清外在環境已經固化且不利於發展，與其硬碰硬消耗實力，不如暫時避開鋒芒，等待更好的時機。",
        "9": "你察覺到外在環境的上升動能已達頂峰即將轉變，應該順應這個自然規律，準備迎接下一階段的新局面。"
      },
      "5": {
        "6": "你觀察到外在環境正處於變動期，雖有不確定因素，但這正是調整策略的良機，順應這些變化來修正你的升進路徑。",
        "7": "你看見外在情勢正朝有利方向發展，天時地利人和皆具備，此時應堅定信念，維持既定的升進步調繼續前行。",
        "8": "你發現外在環境已形成難以撼動的既定格局，與其強行突破不如認清現實，暫時避開正面衝突尋找其他升進機會。",
        "9": "你察覺外在的推升力量已達頂峰開始轉弱，此時不宜再強求更高位置，應順應這個轉變及時調整期望值。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動期，趨勢尚未明朗，此時需要保持靈活應變的態度，隨時準備根據新的發展調整你的方向和策略。",
        "7": "你看見外在大環境正朝著有利的方向發展，天時地利皆順，這是持續推進既定計畫的最佳時機，堅定地維持現有的前進步調。",
        "8": "你發現外在環境已經形成難以撼動的既定格局，與其勉強對抗這股強大的趨勢力量，不如暫時退避，另尋更適合的發展機會。",
        "9": "你感受到外在環境的推升力量已達頂峰開始轉弱，舊的發展模式即將結束，主動順應這個轉換期，為下一階段做好準備。"
      }
    }
  },
  "47": {
    "number": 47,
    "name": "困",
    "code": "010110",
    "卦解": "你現在就像被困在一個不上不下的狀態裡，感覺有點卡住但又沒有完全動彈不得。周圍的環境給你一些壓力，讓你覺得施展不開，但這種困頓並不是絕望的那種。你內心其實還算平靜，只是外在的條件讓你暫時無法大展身手。整個氛圍就像是在等待什麼，變化很緩慢，但你能感覺到事情正在慢慢醞釀中，只是需要更多時間和耐心。",
    "六階段": {
      "1": "你的根基此刻承受著不小的壓力，就像水庫水位偏低，每一步推進都格外吃力。內心可能感到有些焦慮，擔心自己的基礎不夠穩固。周遭環境也不太友善，資源匱乏讓你必須更加謹慎地運用手邊的一切。雖然起步艱難，但這正是考驗你意志力的時刻，堅持下去才能為後續發展奠定真正的基礎。",
      "2": "你在表現上感到處處受限，每個環節都繃得很緊，像是走鋼絲般小心翼翼。內心雖有想法，卻難以順暢展現，只能專注於維持最基本的連結和運作。外在條件讓你無法放手一搏，只能在有限的空間中尋求突破。這種狀態雖然壓抑，但也讓你學會在困境中保持冷靜，培養更精準的判斷力。",
      "3": "你的潛力在細節處頻頻受阻，原本看似簡單的事情變得複雜難解。內心容易感到挫折，因為需要不斷回頭修補、重新調整，耐心逐漸被消磨。外在環境充滿各種小障礙，讓你的能力無法完全發揮。然而這個階段正在磨練你的細緻度和堅韌性，每一次的修正都在為未來的突破積累經驗。",
      "4": "外在環境的回應變得遲緩，你常常需要等待別人的反饋或支援。內心可能感到不耐煩，原本的計畫被迫壓縮，時間成本不斷上升。周圍的人事物都像慢了半拍，讓你的節奏被打亂。這種等待雖然煎熬，但也給了你重新思考策略的機會，學會在不確定中保持彈性，適應環境的步調。",
      "5": "雖然整體環境仍然困頓，但你在核心位置上還能保持基本的穩定。內心逐漸找到平衡點，不再過度焦慮，開始專注於守護重要的事物。外在雖然資源有限，但你的基本盤還算穩固，框架沒有散掉。這個階段考驗的是你的領導力和定力，在困境中維持團隊或計畫的完整性。",
      "6": "環境的困頓狀態接近尾聲，但條件依然不算理想。你內心開始看見希望的曙光，但也明白現在還不是大展身手的時候。外在環境雖有鬆動跡象，卻還需要更多時間才能完全好轉。此刻最重要的是保存既有成果，維持現有的成就，耐心等待更好的時機到來，為下一個階段做好準備。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力雖有不足，但正是調整的好時機，主動檢視自己的弱點，透過學習和練習來補強根基，將困境轉化為成長的動力。",
        "7": "你的基本功扎實穩固，即使面臨困頓也要保持信心，持續精進核心能力，這份堅實的底子將是你突破困局的最大資產。",
        "8": "你必須坦然面對能力的局限性，不要勉強承擔超出實力的挑戰，先穩住現有基礎，等待更適合的時機再求發展。",
        "9": "你過去累積的能力優勢已達極限，是時候轉換思維模式，學習新的技能領域，讓自己的根基更加多元和靈活。"
      },
      "2": {
        "6": "你在困境中的表現容易搖擺不定，此時應該順勢調整自己的外在形象，不要固執於原本的做法，靈活修正展現給外界的態度和方式。",
        "7": "你現在的外在表現符合天地運行的趨勢，應該維持這種積極正面的形象繼續前進，堅持展現出你的專業能力和正直品格。",
        "8": "你長期累積的外在形象問題已經積重難返，必須認清現實，避免繼續用過去的方式表現自己，暫時收斂鋒芒等待時機。",
        "9": "你過度強勢的外在表現已達極限，應該順應情勢轉變，放下強硬姿態，以更謙和包容的方式與外界互動，化解困局。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，此時應該靈活調整學習方向和發展策略，不要固守既有模式，順應內心變化來修正自己的能力培養重點。",
        "7": "你具備良好的成長基礎和上升動能，應該堅持既定的學習計畫和能力提升方向，保持穩定前進的節奏，讓潛力自然而然地開花結果。",
        "8": "你需要認清自己在某些領域的局限性已經根深蒂固，與其勉強突破不如避開弱項，將精力轉向更有潛力的能力發展方向。",
        "9": "你在某個專長領域已達高峰但開始顯露疲態，應該順應自然轉換跑道，將累積的經驗智慧轉化為培養新領域潛力的養分。"
      },
      "4": {
        "6": "你面對的外在環境正在快速變化，困境中出現新的轉機，要敏銳觀察這些微妙變化，適時調整策略以配合環境的轉向。",
        "7": "你所處的外在條件雖然仍有困難，但大趨勢對你有利，要堅持既定方向，相信天時地利終將配合你的努力。",
        "8": "你面臨的外在環境已經形成固化的不利局面，長期積累的問題難以快速改變，要認清現實避開正面衝突。",
        "9": "你觀察到外在的強勢力量已達頂峰開始衰退，舊有的困境格局即將鬆動，要順應這個轉換時機準備突破。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，困境中出現鬆動跡象，此時應靈活調整策略，順應這些變化找到突破口，不要固守原有做法。",
        "7": "你看見外在大勢正朝有利方向發展，雖然困境尚未完全解除，但應保持信心繼續前進，時機成熟時自然能夠脫困而出。",
        "8": "你面對的外在困局已經根深蒂固難以撼動，必須認清現實不要硬碰硬，暫時避其鋒芒，等待更好的時機再做打算。",
        "9": "你察覺外在的強勢壓力已達頂點開始轉弱，困境即將出現轉機，此時要順應這個轉變趨勢，準備迎接新的局面。"
      },
      "6": {
        "6": "你看到外在環境的困局開始鬆動，這是轉機的徵兆。順應這股變化的力量，適時調整自己的策略和方向，才能從困境中找到突破口。",
        "7": "你觀察到外在趨勢正朝著有利的方向發展，困境即將解除。保持現有的努力方向，堅定地向前推進，順天應人的時機已經到來。",
        "8": "你面對的外在困境已經根深蒂固，短期內難有根本改變。認清現實的嚴峻性，暫時避開正面衝突，等待更好的時機再行動。",
        "9": "你察覺外在的困難局面已達極限，轉變即將到來。順應這個自然的轉換過程，放下過往的執著，迎接困境之後的新局面。"
      }
    }
  },
  "48": {
    "number": 48,
    "name": "井",
    "code": "011010",
    "卦解": "你現在就像站在一口井邊，資源其實都在那裡，只是還沒完全暢通流出來。你內心的力量比外在表現來得充實，有種悶著勁的感覺，就像水在井裡慢慢累積，但還沒找到最順暢的出口。整個狀態不算停滯，但也稱不上快速推進，更像是在做基礎建設的階段。你能感受到事情正在慢慢串連起來，雖然變化不明顯，但能察覺到一種穩定的醞釀感，就像井水正在一點一滴地匯聚能量。",
    "六階段": {
      "1": "你正在檢視自己的根本條件，就像檢查水井的底層設施。這時候你會發現哪些基本能力需要修復，哪些資源管道還能使用。內心可能有些不安，因為要面對自己的真實狀況。周圍的人也在觀察你的基礎是否穩固，但這正是重新建立可靠根基的好時機。",
      "2": "你開始展現穩定的表現，日常的運作逐漸上軌道。之前斷斷續續的狀況減少了，你能更規律地提供價值。內心感到踏實許多，因為看見自己的努力有了成效。身邊的人開始重新信任你的可靠性，合作關係也變得更順暢。",
      "3": "你的潛力開始顯現，經過細心的自我調整，能力品質明顯提升。你發現自己能處理更複雜的事情，而且表現更加穩定。內心充滿成就感，對未來也更有信心。周圍環境對你的期待提高了，更多機會開始向你靠近。",
      "4": "外在環境開始有序地向你索取服務，你的影響範圍正在擴展。人們知道什麼時候可以找你，形成了固定的合作節拍。你感受到被需要的滿足感，同時也意識到責任的重量。環境對你的依賴度增加，你成為許多人工作流程中的重要環節。",
      "5": "你所在的環境現在運作得井然有序，制度化的管理讓一切更持久穩定。你感到自己處在一個良好的循環中，既能持續輸出價值，也能得到適當的回饋。周圍形成了成熟的生態系統，大家都能從這個穩定的結構中受益。",
      "6": "這一輪的建設即將告一段落，你已經成為環境中可靠的長期資產。內心感到深度的滿足，因為你創造了能夠持續運作的價值系統。環境趨勢顯示，你所建立的這套機制將繼續為未來提供穩定的支持，成為他人可以長期依靠的資源。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖，此時應該靈活調整學習方向，順應當下環境需求來強化自己的根基。",
        "7": "你的基本功底正在穩步提升，符合自然發展規律，應該堅持當前的努力方向，持續深耕專業能力不偏離正道。",
        "8": "你長期累積的舊有能力結構已經僵化，難以適應新時代要求，必須認清現實，避免固守過時的技能和思維模式。",
        "9": "你過度依賴既有的強項能力，已達到發展極限，應該順應時勢轉變，主動學習新領域來更新自己的能力結構。"
      },
      "2": {
        "6": "你的外在形象容易因小事而動搖，此時應順應環境變化適時調整表現方式，不必固執於原有的展現模式，靈活修正才能維持良好印象。",
        "7": "你的外在表現正順應天地自然之勢，應該堅持目前的展現方式持續前進，這種真實而穩定的形象將為你帶來源源不絕的信任與支持。",
        "8": "你長期累積的負面外在形象已根深蒂固難以扭轉，應認清現實避免強行改變表象，先從內在修養做起，待時機成熟再重塑形象。",
        "9": "你過度強勢的外在表現已達極限開始走下坡，應順應轉變的趨勢適度收斂鋒芒，以更謙和的姿態面對他人才能延續影響力。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該靈活調整發展方向，不要固執於既定計畫，順應環境變化來修正自己的能力培養重點。",
        "7": "你的成長軌道正合天時地利，應該堅持當前的努力方向，持續投入學習與提升，這是你能力躍進的黃金時期。",
        "8": "你過去的學習模式已經僵化，應該認清自己的局限性，避免在錯誤方向上繼續投入，重新審視成長的根本問題。",
        "9": "你的某些能力已達高峰開始衰退，應該順應自然規律，將重心轉向新的成長領域，讓舊有優勢自然轉化。"
      },
      "4": {
        "6": "你需要靈活調整對外在環境的判斷，當發現原有的條件評估有誤時，及時修正策略方向，不要固執己見而錯失良機。",
        "7": "你應該把握當前有利的外在條件，順應大環境的正向趨勢，堅持既定方向持續推進，時機正是最佳發展期。",
        "8": "你必須正視外在環境已經惡化的現實，避免在不利條件下強行出擊，保存實力等待更好的時機再行動。",
        "9": "你要順應外在條件即將轉換的趨勢，主動配合環境變化調整步調，將強勢轉為柔和以迎接新局面。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變動雖然還不明顯，但已經開始影響整體局勢，你需要保持敏銳觸覺，隨時準備調整自己的應對策略。",
        "7": "你看見外在環境呈現穩定向上的發展趨勢，各種有利條件正在匯聚，你應該堅持既定方向，持續推進計畫，把握這個順勢而為的良好時機。",
        "8": "你面對的外在環境已經形成固化的不利格局，各種阻礙根深蒂固難以撼動，你必須認清現實，避免硬碰硬的無謂消耗，尋找迂迴之道。",
        "9": "你察覺外在環境的強勢發展已達頂峰，即將面臨轉折點，你要順應這個自然的變化週期，提前做好準備，迎接新的發展階段來臨。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，趨勢尚未明朗，此時應保持敏銳洞察力，隨時準備根據新的市場訊號調整策略方向。",
        "7": "你看見大環境正朝著有利方向發展，各種條件逐漸成熟，現在正是順應這股正向趨勢，堅定執行既定計畫的最佳時機。",
        "8": "你面對的外在環境已形成強大阻力，舊有模式積弊深重難以撼動，明智的選擇是暫時迴避正面衝突，另尋突破點。",
        "9": "你察覺當前的環境優勢已達頂峰開始轉弱，舊的成功模式即將失效，主動順應即將到來的新變化才能持續發展。"
      }
    }
  },
  "49": {
    "number": 49,
    "name": "革",
    "code": "101110",
    "卦解": "你現在正處在一個蓄勢待發的轉變時刻。雖然內在有著相當充沛的能量和條件，但整體氛圍感覺像是在一個密閉的空間裡，變化的節奏比較緩慢。你的內外狀態達到了一種微妙的平衡，沒有明顯的失衡或衝突。這種狀態讓你感受到一種「山雨欲來」的氛圍，彷彿所有的力量都在暗中積聚，等待著某個關鍵時刻的到來。變革的種子已經埋下，只是還需要時間慢慢發酵。",
    "六階段": {
      "1": "你心中開始有些不安分的念頭，覺得現在的狀況好像可以更好一點。內心深處那個想要改變的聲音越來越清晰，雖然還沒有具體的計畫，但你已經開始留意身邊哪些地方可以調整。周圍的環境看似平靜，但你敏銳地察覺到一些微妙的變化信號，就像春天來臨前土壤裡的種子開始蠢蠢欲動。",
      "2": "你開始小心翼翼地嘗試一些新做法，發現效果比想像中好，內心的信心逐漸建立起來。那種「原來真的可以」的驚喜讓你更有動力繼續下去，同時也更清楚知道自己想往哪個方向前進。身邊開始有人注意到你的改變，雖然還不是很明顯，但你能感受到一些正面的回應和支持。",
      "3": "你正處在新舊交替的關鍵時刻，一邊要維持原有的運作，一邊又要推進新的方式，內心有些焦慮和不確定感。每天的節奏都在調整，有時候會覺得有點混亂，需要不斷重新安排優先順序。外在環境也跟著你的變化在重新洗牌，有些關係和合作模式正在重新定義，整體氛圍充滿變動的能量。",
      "4": "周圍的人開始真正理解和接受你的改變方向，阻力明顯減少了許多。你發現推動事情變得容易許多，該有的資源和支持都陸續到位，內心感到一股踏實的力量。環境條件越來越有利，就像所有的齒輪都開始順暢運轉，你可以把更多精力放在實際執行上，而不用花太多時間在說服和協調上。",
      "5": "你已經完全進入新的運作模式，內心感到前所未有的清晰和篤定。新的工作節奏、生活方式或思維模式已經成為你的新常態，效率和滿足感都大幅提升。整個環境都配合著你的新版本在運作，周圍的人事物都找到了與你新狀態相匹配的互動方式，一切都顯得井然有序且充滿活力。",
      "6": "變革的階段告一段落，那種激烈變化的緊張感逐漸消退，內心回到平靜但更有底氣的狀態。新的秩序已經穩定建立，不再需要刻意維護，一切都自然而然地按照新的軌道運行。外在環境也趨於穩定，大家都適應了這個新版本的你，整體氛圍從變動的興奮轉為踏實的滿足，為下一個階段的發展奠定了堅實基礎。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易搖擺不定，此時應順應變化的需求，主動調整學習方向和技能組合，為即將到來的變革做好準備。",
        "7": "你的根基紮實且順應時勢發展，應該維持當前的能力建構方向，持續精進核心技能，這將成為你推動變革的重要支撐力量。",
        "8": "你的舊有能力結構已經僵化難以改變，必須認清現實，避免依賴過時的技能，重新思考什麼才是變革時代真正需要的基礎能力。",
        "9": "你過往引以為傲的能力已達極限，應該順應時代轉變的要求，主動放下舊有的專業包袱，開始培養適應新局面的基礎能力。"
      },
      "2": {
        "6": "你目前的外在形象容易給人搖擺不定的印象，應該主動調整表達方式，讓別人看到你更穩定可靠的一面，這樣才能在變革中獲得他人信任。",
        "7": "你展現出來的積極態度正符合時勢所需，繼續保持這種向前的姿態，讓周圍的人感受到你對變革的堅定信念，這將為你帶來更多支持。",
        "8": "你過往建立的形象已經難以適應當前的變革需求，必須認清這個現實，避免繼續用舊有方式來展現自己，否則只會越來越被邊緣化。",
        "9": "你過去強勢的外在表現已到了該轉換的時刻，順應變革的潮流調整自己的姿態，展現出更柔軟包容的一面，反而能獲得新的影響力。"
      },
      "3": {
        "6": "你的成長潛力正在醞釀變化，此時應該順應內心的調整衝動，靈活修正自己的發展方向，不要固執於原有的成長模式。",
        "7": "你具備穩健的成長動能，應該堅持當前的努力方向，持續投入自我提升，順應天時地利推進個人發展計畫。",
        "8": "你過去的成長模式已經僵化，需要認清現實中的限制，避免繼續用舊方法強求突破，先停下來重新審視自己。",
        "9": "你的成長已達到某個階段的頂點，應該順應轉變的時機，放下過往的成就包袱，為下一階段的蛻變做好準備。"
      },
      "4": {
        "6": "你需要密切觀察外在環境的細微變化，當發現市場風向或政策趨勢出現轉折時，要靈活調整策略，不要固守原有做法。",
        "7": "你所處的外在環境正朝著有利方向發展，順應這股天時地利的趨勢，堅持既定方針繼續前進，時機正在你這一边。",
        "8": "你面對的外在條件已經僵化難改，與其硬碰硬地試圖改變大環境，不如務實地避開不利因素，另尋突破口。",
        "9": "你察覺外在優勢正在消退，舊的有利條件即將結束，順應這個自然轉變過程，提前為新局面做好準備。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，此時應順應這些變動調整自己的立場，靈活修正原有計畫以配合新的局勢發展。",
        "7": "你看見外在趨勢正朝有利方向發展，現在是堅持既定方針的好時機，繼續維持當前的變革步調向前推進。",
        "8": "你面對的外在阻力已根深蒂固難以撼動，此時應認清現實避開正面衝突，尋找其他突破口或等待更好時機。",
        "9": "你察覺外在的強勢力量已達頂峰開始衰退，現在要順應這個轉換順勢而為，準備迎接新的變革契機。"
      },
      "6": {
        "6": "你觀察到外在環境正在醞釀變化，但趨勢尚未明朗，此時應保持彈性，隨時準備根據環境的實際走向來調整自己的策略和方向。",
        "7": "你看見外在大勢正朝著有利的方向發展，變革的時機已經成熟，應該堅定地跟隨這股趨勢，持續推進既定的變革計畫。",
        "8": "你面對的外在環境已經僵化難變，舊有的阻力根深蒂固，現在不是強行推動變革的時候，應該暫時退避，等待更好的時機。",
        "9": "你所處的外在變革浪潮已達高峰即將轉向，過度的變動將帶來反效果，此時應該順應自然規律，準備迎接下一個循環的開始。"
      }
    }
  },
  "50": {
    "number": 50,
    "name": "鼎",
    "code": "011101",
    "卦解": "你現在就像站在一個穩固的基礎上，手中握有不錯的資源和條件。雖然事情推進得不算特別快，但也沒有明顯的阻礙，有種緩慢但持續前行的感覺。你的內在狀態和外在環境相當平衡，不會有太大的落差或衝突。整體氛圍是平穩的，短期內不會有劇烈變化，但你能感覺到隨著各個環節逐漸配合得更好，進展會一步步累積起來。這是個需要耐心的階段，但基礎很紮實。",
    "六階段": {
      "1": "你正在打造屬於自己的基礎架構，就像架起一口穩固的鍋子準備開火。內心充滿期待和緊張，知道這是一切的起點，不能有絲毫馬虎。周圍的人可能還不太理解你在做什麼，但你清楚這個根基的重要性。現在需要的是耐心和專注，把每個細節都處理到位，為接下來的發展創造穩定的條件。",
      "2": "你開始看到自己的努力有了回報，就像底湯慢慢熬出香味，各種素材開始發揮作用。內心感到踏實和滿足，因為日常的表現越來越穩定規律。身邊的人開始注意到你的進步，給予正面的回饋。這個階段讓你建立了自信，知道自己的方向是對的，持續投入就會有更好的成果。",
      "3": "你正在經歷一個淨化和提升的過程，就像撇去浮沫讓湯頭更清澈。內心可能有些焦慮，因為要面對自己的不足和需要改進的地方。外在環境也在考驗你的品質和標準，但這正是成長的機會。通過這個階段，你的潛力會被更好地挖掘出來，整體水準會有明顯的提升。",
      "4": "環境開始為你提供更多展示的機會，就像料理可以順利裝盤分送出去。你感到興奮和有些壓力，因為要面對更大的舞台和更多的期待。周圍的資源和支持變得更加豐富，合作夥伴也開始主動找上門來。這是一個擴展影響力的好時機，但也要注意保持品質的一致性。",
      "5": "你已經找到了自己的獨特風格，就像料理的味型完美到位，成為代表作。內心充滿成就感和自豪，知道自己的價值終於被真正看見和認可。外在環境也給予你充分的肯定和讚賞，機會源源不斷地湧現。這是收穫的黃金時期，你的核心競爭力已經確立，可以享受成功的喜悅。",
      "6": "你開始進入一個沉澱和思考的階段，就像調小火力讓成果慢慢保溫。內心很平靜，有種功成身退的淡然感受。外在環境也趨於穩定，不再有太多波動和變化。這是一個很好的時機來總結經驗，準備下一個循環的開始。你知道這不是結束，而是另一個更高層次挑戰的準備期。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖，此時應順勢調整學習方向，不要固執己見，靈活修正才能打好根基。",
        "7": "你的根基正在穩健成長中，順應天地自然規律持續精進，保持目前的努力方向，維持前進的節奏就能建立扎實底子。",
        "8": "你過去累積的基礎已經僵化難以改變，必須認清現實接受限制，避免強行突破，轉而尋找能發揮現有根基的適合道路。",
        "9": "你的基礎能力已達頂峰開始衰退，不要再強撐過往優勢，順應時勢轉變調整定位，為下一階段的發展重新蓄積能量。"
      },
      "2": {
        "6": "你目前的外在表現還不夠穩定，容易給人留下搖擺不定的印象，應該順應當下情勢，適時調整自己的言行舉止，讓外界看到更加一致的你。",
        "7": "你現在展現出來的形象正順應天地大勢，這種外在表現很有正面能量，應該堅持這樣的狀態，繼續以這樣的姿態向前邁進。",
        "8": "你長期累積的外在形象已經定型，很難在短時間內改變他人對你的既定印象，與其強求改變，不如先認清現實，避免無謂的掙扎。",
        "9": "你過去強勢的外在表現已經到了轉折點，繼續維持強硬姿態反而會適得其反，現在該順應變化，展現更柔軟包容的一面。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，此時應靈活調整學習方向和能力培養重點，不要固執於既定計劃，順應內在變化來修正發展路徑。",
        "7": "你的成長動能正當其時，應持續在既定領域深耕專業能力，保持學習的積極態度，順天時而進，穩步提升核心競爭力。",
        "8": "你在某些領域的發展已達瓶頸，應認清現實限制，避免在低效領域過度投入，轉而尋找新的成長空間和突破方向。",
        "9": "你在現有專長上已趨成熟，應順應時勢轉變，將accumulated經驗轉化為指導他人的能力，從個人成長轉向影響力發展。"
      },
      "4": {
        "6": "你面對的外在環境正在微妙變化，雖然基本條件尚可，但需要靈活調整策略，密切觀察市場動向，適時修正方向以順應環境轉變。",
        "7": "你所處的外在環境正值有利時機，基本面條件良好且趨勢明朗，應該把握這個順勢而為的機會，堅定地維持既定方針持續前進。",
        "8": "你面臨的外在環境已經形成不利格局，基本面條件嚴峻且難以扭轉，必須認清現實狀況，暫時避開正面衝突，等待更好時機。",
        "9": "你周圍的外在環境已達高峰開始轉變，原本有利的基本面條件正在減弱，應該順應這個自然轉換，準備迎接新的環境變化。"
      },
      "5": {
        "6": "你當前面對的外在環境變化頻繁，市場或合作關係尚不穩定，需要保持靈活應變的心態，隨時準備調整策略以適應新的局勢發展。",
        "7": "你所處的外在環境正朝著有利的方向發展，各種條件逐漸成熟，應該把握這個順勢而為的時機，堅定地推進既定的計畫目標。",
        "8": "你面臨的外在環境已經形成固化的不利格局，既有的阻礙根深蒂固難以撼動，應該認清現實並考慮迴避或轉換發展方向。",
        "9": "你目前的外在環境雖然看似強勢，但已達到轉折的臨界點，應該順應即將到來的變化趨勢，提前佈局準備迎接新的局面。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動期，市場趨勢尚未明朗，此時應保持彈性思維，隨時準備根據新的信號調整策略方向。",
        "7": "你看見外在大勢正朝有利方向發展，各種條件逐漸成熟，應當堅持既定路線，順應這股向上的趨勢繼續前進。",
        "8": "你面對的外在環境已形成固化格局，既有結構難以撼動，應認清現實限制，避免正面衝撞，尋找其他突破口。",
        "9": "你察覺外在環境的主導力量已達頂峰開始轉弱，舊秩序即將變化，應順應這個轉折點，準備迎接新的局面。"
      }
    }
  },
  "51": {
    "number": 51,
    "name": "震",
    "code": "100100",
    "卦解": "你現在就像是雷聲初起的時刻，內心有股蠢蠢欲動的能量，但外在環境還沒完全配合。你感受到一種微妙的平衡狀態，內在和外在的力量勢均力敵，沒有明顯的傾斜。整體氛圍有些停滞，像是暴風雨前的寧靜，事情的推進比預期慢一些。你可能會覺得有點悶，想要突破卻又感到阻力，但這種積蓄的狀態正在為未來的變化做準備，只是現階段還需要更多時間來醞釀。",
    "六階段": {
      "1": "你內心深處有股強烈的能量正在甦醒，就像第一聲雷響劃破寧靜的夜空。這股力量來得突然且有力，讓你從原本的沉睡狀態中驚醒。你感受到一種前所未有的緊迫感和活力，血液彷彿重新流動起來。周圍的一切都因為這個震動而開始改變，空氣中瀰漫著即將發生重大轉變的氣息。這是你最原始、最真實的驅動力在發聲。",
      "2": "經過最初的震撼後，你開始找到自己的節奏。那份驚喜和不安逐漸轉化為穩定的前進動力，你的腳步變得更加堅定有力。內心的慌亂平息下來，取而代之的是一種清晰的方向感。你發現自己能夠更直接地表達想法，行動也變得更有效率。周圍的人開始注意到你身上散發出來的這種新的能量，整個氛圍因你的改變而變得更加活躍。",
      "3": "你感受到內在潛力的巨大波動，有時候覺得自己無所不能，有時候又擔心會失去控制。這種起伏讓你偶爾會有些手忙腳亂，節奏時快時慢，就像學習駕馭一匹野馬。你的潛能正在以一種不規則但強烈的方式展現，內心既興奮又忐忑。外在環境也因為你的這種變化而產生連鎖反應，有些人跟不上你的步調，有些人則被你的熱情所感染。",
      "4": "你發現周圍的環境開始理解並適應你的改變。那些原本對你的轉變感到困惑的人，現在開始抓住你的節奏，願意與你協作。合作變得更加順暢，大家的步伐漸趨一致。你感受到一種被理解和支持的溫暖，不再是孤軍奮戰。工作或生活中的夥伴們能夠及時回應你的想法，整個團隊的效率明顯提升。這種和諧的協作關係讓你更有信心繼續前進。",
      "5": "你處在一個相對穩定的中心位置，周圍雖然還有各種聲響和變化，但你已經能夠保持內心的平靜和專注。你的能量變得更加集中和有方向性，不再像之前那樣散亂。即使外在環境仍有震動和挑戰，你也能在其中維持秩序和平衡。別人開始將你視為可靠的核心人物，在混亂中尋求你的指引。你感受到一種掌控全局的自信，同時也承擔起更多的責任。",
      "6": "經歷過所有的震動和變化後，你進入了一個全新的平靜狀態。空氣變得清新透明，心境也格外澄澈。那些曾經帶來巨大衝擊的經歷，現在成為你日常生活中的養分和智慧。你發現自己變得更加成熟和穩重，但同時保持著那份來自內心深處的活力。周圍的環境也因為你的蛻變而呈現出一種和諧的新秩序。這種轉變所帶來的正面影響將會持續很長時間。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力還不夠穩固，容易因外界變化而動搖，現在正是修正根基的好時機，順應當下狀況調整學習方向，打造更扎實的底子。",
        "7": "你的根基正處於穩健成長期，基礎能力與時勢相符，繼續在既有方向上深耕努力，保持學習動力，讓底子越來越厚實。",
        "8": "你過去累積的基礎能力已經僵化，難以適應新的挑戰，與其勉強改變既有底子，不如認清現實，避免在舊有根基上硬拼。",
        "9": "你的基礎能力雖然深厚但已達極限，硬撐只會消耗過度，順應時勢轉換跑道，讓豐富底子在新領域重新發光。"
      },
      "2": {
        "6": "你目前的外在表現容易引起誤解或變化，應該適時調整自己展現的方式，讓別人看到更真實穩定的你，避免因形象搖擺而失去他人信任。",
        "7": "你的外在表現正符合當下趨勢，應該繼續保持現在展現給他人的形象和態度，這樣的你能夠獲得更多認同和支持，持續向前發展。",
        "8": "你長期以來的外在形象已經固化且難以改變，必須認清這個現實，暫時避免強行改變別人對你的既定印象，等待更好的時機再行動。",
        "9": "你過度強勢的外在表現已達極限，應該順應情勢轉變展現方式，讓自己呈現更柔和謙遜的姿態，才能避免物極必反的困境。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，此時應靈活調整發展方向，不要固執於原有規劃，順應內心真實需求來修正努力的重點。",
        "7": "你的成長動能正值上升階段，應持續在既定方向上努力耕耘，保持學習熱忱與行動力，讓潛力自然開花結果。",
        "8": "你需認清成長過程中的現實限制，避免在已經飽和或不適合的領域繼續投入，重新評估自己真正的優勢所在。",
        "9": "你過往的成長模式已達極限，應順應時勢轉換新的發展路徑，放下舊有執著，開放心胸接納不同的成長可能性。"
      },
      "4": {
        "6": "你需要敏銳觀察外在環境的微妙變化，當發現不利因素時要及時調整策略，靈活應對才能避免後悔。",
        "7": "你當前面臨的外在環境正處於有利趨勢，應該堅持既定方向持續前進，順應天時地利的大好時機。",
        "8": "你必須認清外在環境已經積累太多負面因素，現實條件對你極為不利，應該暫時避開正面衝突。",
        "9": "你要看清外在強勢環境已經到達頂峰開始轉弱，此時應該順應這個轉變趨勢重新布局未來。"
      },
      "5": {
        "6": "你面對的外在環境正處於變動期，震動帶來的不確定性讓局勢難以預測，此時應保持敏銳觀察力，隨時準備調整策略以應對突發變化。",
        "7": "你所處的外在環境雖有震盪，但整體趨勢向上發展，這是天地運行的自然規律，你應保持既定方向，穩步前進不被表面波動干擾。",
        "8": "你面臨的外在環境已經積累太多問題，震動只會讓情況更加複雜難解，你需要認清現實狀況，暫時避開正面衝突尋求緩解之道。",
        "9": "你觀察到的外在震動已達到高峰，強烈的變化即將轉向平緩，你應順應這個自然轉折點，不要強求維持高強度的變動狀態。"
      },
      "6": {
        "6": "你觀察到外在環境正在醞釀變化，趨勢尚未明朗，此時應保持敏銳觀察力，隨時準備調整策略方向，切勿固守既有做法。",
        "7": "你看見外在大勢正朝有利方向發展，這是順應天時地利的良機，應堅持既定路線持續前進，不要因小波動而改變方向。",
        "8": "你面對的外在環境已形成強大阻力，舊有模式積重難返，應認清現實避其鋒芒，暫時退守等待更好的時機再出發。",
        "9": "你察覺外在強勢已達頂峰開始轉弱，變革的時刻即將來臨，應順應這股轉變之勢，準備迎接新的環境格局。"
      }
    }
  },
  "52": {
    "number": 52,
    "name": "艮",
    "code": "001001",
    "卦解": "你現在就像站在山腳下，感受著一種穩定卻略顯沉靜的氛圍。周圍的能量不算強勁，但也不會讓你感到無力，一切都在緩緩地、有節奏地進行著。你的內心和外在環境處在一種微妙的平衡中，沒有太大的衝突或波動。雖然進展的速度不快，但你能感覺到事情正朝著對的方向移動，就像溪水輕柔地繞過石頭。這是一個需要耐心的時刻，變化雖然細微，卻在暗中積累著力量。",
    "六階段": {
      "1": "你正處在一個需要重新站穩腳步的時刻。就像走了很久的路，終於意識到該停下來喘息一樣，你的內心開始渴望安定和沉澱。周圍的環境可能還是充滿各種聲音和誘惑，但你已經決定不再被外界牽著鼻子走。這種初步的定靜讓你感到既陌生又安心，彷彿找到了久違的內在anchor點。",
      "2": "你開始建立屬於自己的生活節奏，不再隨波逐流。每天的作息變得規律，做事情有了固定的步調，這讓你感到踏實和自信。身邊的人開始注意到你的改變，你不再是那個容易被打亂計劃的人。這種穩定的表現讓你在工作和人際關係中都更有底氣，內心也因為這份可預期性而感到平靜。",
      "3": "你內在出現了一種微妙的拉扯感。一部分的你想要繼續保持這份安靜，另一部分卻蠢蠢欲動想要行動。這種矛盾讓你有時感到焦躁，但其實這正是你內在力量正在整合的表現。環境中偶爾會出現一些機會或誘惑，考驗著你的定力。你學會在動與靜之間找平衡，發現原來潛力就藏在這種張力中。",
      "4": "你開始對外界設下清楚的界線，不必要的社交和干擾都被你溫和但堅定地拒絕。工作和生活環境變得更加純淨，你只保留真正重要的人事物。這種選擇讓你感到輕鬆自在，不再被迫應付那些消耗能量的瑣事。周圍的人也逐漸習慣並尊重你的這種處事方式，環境開始配合你的節奏運轉。",
      "5": "你的心境達到了一種難得的清明狀態，像是站在山頂俯瞰全景一樣。之前混亂的情況開始有了清晰的脈絡，你能看出事物之間的真實關係。這種洞察力讓你感到充滿智慧和力量，不再為小事煩惱。外在環境也變得相對穩定，各種條件都朝著有利於你的方向發展，一切都在靜中有序地進行著。",
      "6": "你已經完全掌握了止與行的智慧，知道什麼時候該停，什麼時候該動。當前的階段即將圓滿結束，你感到一種深深的成就感和內在的充實。環境中開始出現新的可能性，但你不急躁，而是耐心等待最佳的時機。這種從容讓你散發出一種成熟的魅力，周圍的一切都在為你下一個階段的展開做準備。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易動搖變化，此時應該順勢調整學習方向，不要固執己見，靈活修正自己的根基才能穩步向前。",
        "7": "你的底子扎實且正處於上升期，應該維持現有的努力方向繼續前進，順應天地趨勢持續累積實力，根基會越來越穩固。",
        "8": "你過去累積的基礎已經僵化難以改變，必須認清現實避免硬碰硬，不如暫時停止在舊有根基上用力，尋找新的突破點。",
        "9": "你的基礎能力已達頂峰但開始衰退，應該順應轉變的時機，將過去的積累轉化為新的起點，讓強勢根基自然過渡。"
      },
      "2": {
        "6": "你的外在表現容易搖擺不定，此時應該順勢調整自己的展現方式，不必強求一致性，靈活應對他人的反應和環境變化。",
        "7": "你當前的外在表現符合時勢所需，應該維持這種穩重踏實的形象，繼續以現有的方式與外界互動，時機正好。",
        "8": "你過往建立的外在形象已根深蒂固難以改變，不如認清這個現實，接受他人既定的看法，避免強行扭轉印象。",
        "9": "你長期維持的強勢外在形象已到轉換點，應該順應變化調整表現方式，以更柔和內斂的姿態面對外界會更好。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該靈活調整發展方向，不要固執於原有計畫，順應內心真實需求來修正自己的能力提升路徑。",
        "7": "你具備良好的成長基礎和發展動能，應該堅持當前的學習方向，持續投入時間精力，讓自己的潛能在穩定前進中逐步開花結果。",
        "8": "你在某些領域的成長已經遇到瓶頸，與其勉強突破不如認清現實，將注意力轉向其他更有潛力的能力發展方向。",
        "9": "你過度專注單一能力的提升已達極限，應該順應時勢轉換跑道，將豐富經驗轉化為多元發展的養分，開創新的成長空間。"
      },
      "4": {
        "6": "你面對的外在環境正處於變動期，機會與挑戰並存，應保持敏銳觀察力，隨時準備根據環境變化調整策略，把握時機順勢而為。",
        "7": "你所處的外在環境呈現良好發展態勢，各項條件都在朝有利方向演進，應堅持既定方向持續推進，順應天時地利人和的大勢。",
        "8": "你面臨的外在環境已形成固化格局，既有的不利因素短期內難以改變，應認清現實狀況，暫時迴避正面衝突，另尋突破口。",
        "9": "你所處的外在環境已到達頂峰開始轉向，原本的優勢條件正在減弱，應順應這個轉變趨勢，提前佈局下一階段的發展方向。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變動雖然還不明顯，但已露端倪。順應這些初期變化調整你的策略，把握時機修正方向，避免固守舊有模式。",
        "7": "你看見外在大勢正朝有利方向發展，各種條件都在配合你的計畫。保持現有的前進步調，堅定地維持既定路線，天時地利都在支持你的行動。",
        "8": "你面對的外在環境已經形成難以撼動的既定格局，各種阻力根深蒂固。認清這個現實狀況，暫時避開正面衝突，尋找其他可行的迂迴路徑。",
        "9": "你察覺外在強勢已到達頂點開始轉弱，原本的主導力量正在衰退。順應這個轉變趨勢調整你的應對方式，準備迎接新局面的到來。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動期，許多趨勢尚未定型，此時應保持敏銳觀察力，隨時準備根據環境變化調整自己的策略方向。",
        "7": "你看見外在大勢正朝著有利方向發展，天時地利皆備，應當堅持既定方針，順應這股正向趨勢持續前進，不宜輕易改變。",
        "8": "你面對的外在環境已形成固化格局，既定趨勢難以撼動，與其硬碰硬消耗實力，不如認清現實選擇迴避或另尋出路。",
        "9": "你察覺外在強勢已達頂峰開始轉弱，舊有趨勢即將反轉，應當順應這個轉變時機，及早調整布局迎接新的發展階段。"
      }
    }
  },
  "53": {
    "number": 53,
    "name": "漸",
    "code": "001011",
    "卦解": "你現在處在一個穩步前進的狀態中，就像水鳥慢慢飛向遠方的感覺。雖然條件不算特別優越，但也不差，有種中庸平穩的氛圍。你會發現事情的進展有點像緩慢的河流，時而順暢時而稍有阻滯，但整體方向是清楚的。外在環境對你比較有利，給了你一些推力，不過內在的準備還需要時間。變化不會突然發生，而是像春天的花朵一樣，需要耐心等待每個階段的自然展開。",
    "六階段": {
      "1": "你正站在一個全新的起點，腳下的路還不太熟悉，每一步都需要小心試探。內心既興奮又緊張，像是第一次學騎腳踏車的感覺，知道方向但還在摸索平衡。周圍的環境看起來充滿可能性，但也充滿未知。這時候最重要的是穩住腳步，不急不躁，先讓自己在這個新環境中找到最基本的立足點。每一個小小的進步都值得慶祝，因為它們是你未來成長的堅實基礎。",
      "2": "你開始在這個領域中找到自己的節奏，像樹苗伸展根系一樣，慢慢建立起更多的連結點。內心的不安逐漸被一種踏實的感覺取代，你發現自己比想像中更有適應力。身邊的人事物開始對你產生回應，一些原本模糊的關係變得更加清晰。你不再只是單純地存在，而是開始與環境產生真正的互動。這種相互融合的過程雖然緩慢，但每一次的接觸都讓你更加穩固。",
      "3": "你的步伐雖然依然謹慎，但已經形成了自己的韻律。內心湧現出一種靜靜的自信，你開始看見自己真正的潛力在哪裡。就像登山者漸漸攀升，雖然每一步都很小，但回頭望去已經走了不少路程。周圍的風景開始變得立體，你能夠更清楚地辨識出哪些是機會，哪些是挑戰。這個階段最美好的地方在於，你既保持著初心的純真，又累積了實戰的智慧，整個人散發出一種沉穩的光芒。",
      "4": "外在的道路變得越來越明朗，你發現原本看不清的路徑現在有了清楚的指標。各種支持和資源開始主動向你靠攏，就像登山途中遇到的休息站一個接一個出現。你內心有種「原來如此」的恍然大悟，很多之前困惑的問題現在都有了解答。環境對你越來越友善，不是因為你變了什麼人，而是因為你找到了與這個世界協調共舞的方式。機會之門正在為你打開，你只需要穩步向前。",
      "5": "你在這個位置上已經站穩了腳跟，周圍的人開始認可你的能力和價值。內心充滿一種成熟的滿足感，不再需要刻意證明什麼，因為你的實力已經不言而喻。你的影響力像漣漪一樣慢慢擴散，不僅改變了自己的處境，也開始對身邊的環境產生正面的影響。這個階段的你既有力量又有智慧，知道如何在恰當的時機發揮恰當的作用，就像一位經驗豐富的舞者，每個動作都恰到好處。",
      "6": "你已經抵達了一個重要的高度，站在這個平台上回望來路，內心充滿了深深的成就感。這裡的空氣更清新，視野更開闊，你可以看到更遠的風景和更多的可能性。雖然攀升的速度放緩了，但這不是終點，而是一個新的觀景台。環境在這個高度呈現出不同的樣貌，你意識到還有更遠的山峰等待探索。此刻的你既享受這份來之不易的寧靜，也在心中醞釀著下一段旅程的計畫。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚有不穩之處，此時宜順勢調整學習方向，重新檢視自己的根基，透過持續修練來彌補不足，為未來漸進發展奠定更堅實的底子。",
        "7": "你的基礎能力正處於上升趨勢，應該維持目前的學習步調持續前進，順應天地自然節律來累積實力，這是你漸進成長最有利的時機點。",
        "8": "你過往累積的基礎已形成固定模式難以改變，需要認清現有根基的侷限性，避免強行突破，轉而在現有條件內尋求最佳的漸進路徑。",
        "9": "你的基礎能力已達高峰但顯現疲態，應順應轉變的時機來調整方向，將豐富的底子轉化為新的發展基礎，迎接下一階段的漸進歷程。"
      },
      "2": {
        "6": "你在人前的表現容易搖擺不定，此時應當順應當下情況靈活調整自己的外在形象，不必執著於固定的展現方式，適度修正能讓你更貼近真實需求。",
        "7": "你展現出來的穩健形象正符合時勢發展，繼續保持這種循序漸進的外在表現，讓別人看見你的持續成長，這份穩定前進的姿態將為你累積更多信任。",
        "8": "你過往建立的外在形象已經根深蒂固難以改變，與其勉強扭轉不如認清現實，避免做出與既定印象相衝突的表現，接受現狀並在既有框架內發展。",
        "9": "你過於強勢的外在表現已達頂點開始轉弱，此時應順應變化的趨勢，適時收斂鋒芒，展現更加謙和包容的姿態，讓自己的形象自然轉向平和穩重。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，面對內心的不確定感時，要懂得順勢調整學習方向，將每次的迷惘轉化為探索新能力的契機。",
        "7": "你具備穩定向上的成長動能，此時應該維持既定的提升路線，持續投入時間精力，讓天賦與努力形成良性循環。",
        "8": "你過去的學習模式已經形成固化，需要認清現有能力的局限性，避免在舊思維中打轉，重新審視成長的根本方向。",
        "9": "你現階段的成長方式已達極限，是時候順應內在轉變的呼喚，放下過度用力的執著，讓新的潛能自然浮現。"
      },
      "4": {
        "6": "你發現外在環境出現微妙變化，這些波動雖然令人不安，但正是調整策略的良機，順應這些變化重新佈局，將為未來發展奠定更穩固的基礎。",
        "7": "你觀察到外在條件正朝著有利方向發展，天時地利人和皆在你這一邊，此刻應該堅定信心繼續推進原定計劃，不要因小的干擾而改變方向。",
        "8": "你面對的外在環境已經形成根深蒂固的阻力結構，這些障礙短期內難以撼動，與其硬碰硬消耗實力，不如暫時退守等待更好的時機出現。",
        "9": "你所處的外在優勢環境已達顛峰狀態，繁華背後隱含著轉折的訊號，明智的做法是順應即將到來的變化，提前為新局面做好準備和轉型。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，雖然變動頻繁讓人不安，但這正是調整策略的最佳時機，順應這些變化來修正你的方向。",
        "7": "你看見外在大勢正朝有利方向發展，各種跡象都顯示時機成熟，應該堅定信心繼續推進，不要被小波動影響前進步伐。",
        "8": "你面對的外在局勢已經僵化固定，各種阻礙根深蒂固難以撼動，必須認清現實暫時迴避，等待更好的時機再出手。",
        "9": "你察覺外在強勢已達頂峰開始轉弱，原本的優勢環境即將改變，要及時順應這個轉變趨勢，為下一階段做好準備。"
      },
      "6": {
        "6": "你觀察到外在環境正在醞釀變化，此時應保持敏銳度，隨時準備根據新的趨勢信號調整策略，不要固守既有做法。",
        "7": "你看見環境趨勢正朝著有利方向發展，這是天時地利的好時機，應該堅定信心繼續推進既定計畫，順勢而為。",
        "8": "你面對的外在環境已形成固化趨勢難以撼動，與其硬碰硬消耗實力，不如認清現實選擇迴避或另尋出路。",
        "9": "你察覺當前的環境趨勢已達頂峰開始轉向，明智之舉是順應這個轉變，提前佈局下一個階段的發展方向。"
      }
    }
  },
  "54": {
    "number": 54,
    "name": "歸妹",
    "code": "110100",
    "卦解": "你現在處在一個有些微妙的階段，就像走在一條時而順暢、時而需要停下來調整步伐的路上。你的內在其實蠻有力量和想法的，比外在表現出來的要豐富許多，但這股能量在向外推展時總是遇到一些阻礙，讓進展顯得斷斷續續。你會發現有些事情的節奏跟你預期的不太一樣，需要更多耐心去等待時機成熟。整體氛圍就像在為某個重要的轉變做準備，雖然現在看起來變化不大，但其實底下正在慢慢醞釀著什麼。",
    "六階段": {
      "1": "你的內心深處有著急切的渴望，想要快速建立某種連結或關係。這份衝動讓你在還沒準備充分時就貿然行動，心情既興奮又忐忑不安。周圍的環境似乎也在催促著什麼，讓你感覺時間緊迫，無法從容準備。你意識到自己的基礎還不夠穩固，禮數和準備都不夠周全，但內心的期待已經讓你難以停下腳步，只能在這種半準備的狀態中摸索前進。",
      "2": "你開始找到自己在這個關係或情境中的定位，發現自己適合扮演輔助和配合的角色。內心逐漸平靜下來，不再急於搶奪主導權，而是學會觀察和配合。外在環境對你這樣的表現給予正面回應，讓你感到被需要和認可。你發現當自己放下主角的執念，專心做好配角時，反而能發揮出意想不到的價值，與他人的協作也變得更加順暢自然。",
      "3": "你內在的潛力正在覺醒，但這個過程充滿了混亂和不確定性。有時你感覺自己找到了正確的方向，有時又覺得完全偏離了軌道。內心在理想與現實之間搖擺，既有突破的興奮，也有迷失的焦慮。外在環境給你的訊號也是模糊不清的，需要你在反覆的嘗試和調整中摸索。這個階段雖然辛苦，但每一次的磨合都在激發你更深層的能力和智慧。",
      "4": "外在環境為你打開了新的機會之門，你感到既驚喜又謹慎。這個機會雖然不是長久之計，但確實為你提供了一個可以施展的平台。你的內心充滿期待，同時也保持著理性的判斷，知道這只是一個臨時的安排。周圍的條件雖然不算完美，但足以讓你開始行動。你學會珍惜眼前的資源，在有限的時間和空間內盡力發揮，為未來累積經驗。",
      "5": "你終於看到了理想的機會窗口，內心充滿希望和期待。雖然你知道自己還不是那個最核心的位置，但這個機會已經足夠讓你施展才華。你的心情複雜，既為能參與其中而興奮，也為無法完全掌控而略感遺憾。外在環境對你展現出善意，但收益的分配仍有其既定的規則。你學會在這種有限的條件下發揮影響力，並且明智地選擇哪些機會值得投入。",
      "6": "你開始感受到這段關係或經歷即將告一段落，內心既有不捨，也有解脫感。經過這一路的歷程，你變得更加成熟和務實，不再執著於完美的結局。外在環境也在悄然變化，回歸到更加平淡和日常的狀態。你學會了放手，也學會了保留，知道哪些經驗和收穫可以帶到下一個階段。這種平靜的接受讓你內心獲得真正的平和，準備迎接人生的下一個篇章。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在誘惑而動搖根本，此時應當順應變化調整自己的底子，重新打造更適合當前情勢的能力基礎。",
        "7": "你的根基與底子正合乎天地運行的節奏，這份基礎能力將成為你前進的最佳助力，應當保持這個方向持續深化自己的核心實力。",
        "8": "你過往累積的基礎能力已成為包袱，舊有的底子難以應對新局面，必須認清現實避開依賴過去經驗的慣性思維模式。",
        "9": "你原本強勁的基礎能力已到轉換期，過度倚重舊有底子反而受限，應當順應時勢讓能力結構自然轉型升級。"
      },
      "2": {
        "6": "你的外在形象容易受情緒波動影響，此時應順應內心真實感受，適時調整表達方式，讓別人看到更authentic的你。",
        "7": "你展現出的穩重氣質正合時宜，繼續保持這種得體的外在表現，讓你的魅力自然流露，贏得他人信任。",
        "8": "你過往塑造的形象已根深蒂固難以改變，與其勉強修飾外表，不如認清現實，專注內在修養的提升。",
        "9": "你強勢的外在表現已到極限，是時候收斂鋒芒，順應情勢轉為低調內斂，讓柔和一面展現出來。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，面對內心的不確定感時，要學會靈活調整自己的發展方向，將這種易變性轉化為適應力的優勢。",
        "7": "你具備穩健的成長動能，此時應該堅持既定的自我提升路徑，持續投入努力，讓天賦潛能在正確軌道上自然展現。",
        "8": "你需要正視自己在某些領域的固化模式已成為成長阻礙，與其強求突破不如暫時迴避，尋找其他更適合發展的方向。",
        "9": "你過往的優勢可能已達高峰，要順應時勢轉變，將累積的經驗智慧轉化為新的成長模式，開創下一階段的發展空間。"
      },
      "4": {
        "6": "你面對的外在環境正在微妙變化，市場條件或合作關係出現不穩定因素，此時應靈活調整策略，順應環境變動而非固執己見。",
        "7": "你所處的外在環境呈現良好態勢，各項條件都朝有利方向發展，應把握這個順勢而為的時機，堅持既定方向持續推進。",
        "8": "你面臨的外在環境已形成不利格局，既有的阻礙和困難已根深蒂固，應認清現實避免硬碰硬，暫時保守以待時機。",
        "9": "你察覺外在環境的優勢條件已達頂點開始轉變，強勢局面即將結束，應順應這個轉折點適時調整布局和期望值。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，雖然目前看似穩定但潛藏變數，應當保持敏銳洞察力，隨時準備因應調整策略方向。",
        "7": "你發現外在大勢正朝有利方向發展，各種條件漸趨成熟，此時應當堅持既定路線，順應天時地利持續推進計畫。",
        "8": "你面對的外在環境已形成固化格局，既有結構根深蒂固難以撼動，應當認清現實限制，避免硬碰硬的無效消耗。",
        "9": "你察覺外在強勢力量已達頂峰開始轉弱，舊有秩序即將面臨變革，應當順應這股轉變趨勢，準備迎接新局面。"
      },
      "6": {
        "6": "你需密切關注外在環境的微妙變化，當發現趨勢出現轉折徵象時，要及時調整自己的策略方向，靈活應對才能把握先機。",
        "7": "你看到的外在趨勢正朝著有利方向發展，此時應該堅定信心持續前進，順應這股天地運行的自然力量不要猶豫。",
        "8": "你面對的外在環境已經形成難以撼動的既定格局，與其硬碰硬不如認清現實，暫時退守等待更好的時機到來。",
        "9": "你觀察到外在的強勢趨勢已接近轉換點，聯合的關係即將面臨新局面，順應這個自然轉變才是明智之舉。"
      }
    }
  },
  "55": {
    "number": 55,
    "name": "豐",
    "code": "101100",
    "卦解": "你現在處在一個內在蓄積能量的階段，就像水庫正在慢慢儲水一樣。外表看起來進展有限，甚至有些停滯的感覺，但你內心其實很充實，想法和資源都在默默累積。這種狀態有點像是在為某個重要時刻做準備，雖然步調不算快，偶爾還會遇到一些阻礙，但你能感受到內在有股穩定的力量在成長。整體氛圍是沉穩而有潛力的，像是暴風雨前的寧靜，蘊含著豐盛的可能性。",
    "六階段": {
      "1": "你正處於能量快速累積的階段，內心充滿期待與興奮，就像久旱逢甘雨般渴望已久的機會終於來臨。各種資訊、人脈、資源開始向你聚攏，你感受到前所未有的充實感。周圍的環境也開始對你的變化有所回應，原本平靜的日常開始變得熱鬧起來。雖然一切都在加速進行，但你內心深處知道這是好的開始，值得全力投入。",
      "2": "你的表現開始展現出真正的實力，內心的自信也隨之提升。你發現自己能夠更流暢地處理各種事務，輸出的品質和效率都明顯提高。身邊的人開始注意到你的改變，給予更多的認同和支持。你感到一種順暢的節奏感，就像找到了最適合自己的步調。這個階段讓你體會到什麼叫做「得心應手」，每一步都走得踏實而有力。",
      "3": "你開始意識到成長並非只有光明面，內心出現了一些複雜的感受。強烈的表現帶來了相對的壓力和陰影，你發現有些地方開始感到吃力，對比之下更凸顯了自己的局限。環境中的反應也變得兩極化，有讚美也有質疑。這讓你開始深思，明白真正的豐盛需要平衡，不能只追求單一面向的極致。內在的潛力正在這種張力中被激發出來。",
      "4": "外在環境開始為你提供更廣闊的舞台，你的影響力開始向外擴散。周圍出現了更多的機會和平台，讓你能接觸到以前難以觸及的圈層。你內心既興奮又有些忐忑，因為這意味著要面對更大的挑戰和責任。環境的支持度很高，各種條件都在朝有利的方向發展。你感受到一種被推向更大舞台的力量，知道是時候準備好迎接更大的考驗了。",
      "5": "你來到了一個前所未有的高峰，內心充滿了成就感和滿足感。視野變得開闊，能夠看到全局的美好，周圍的環境也達到了最佳的狀態。一切都顯得那麼完美協調，你感到自己就像站在山頂上，可以俯瞰整個世界。這種飽滿的感受讓你深深體會到什麼是真正的豐盛。環境對你的回饋也達到了最高點，所有的努力都得到了最好的回報。",
      "6": "高峰過後，你開始感受到一種不同的寧靜，內心變得更加沉穩和智慧。光芒開始轉為溫和，不再那麼刺眼，但更加持久和深邃。你開始整理和沉澱這段時期的收穫，將經驗轉化為更深層的智慧。外在環境也隨之轉換節奏，變得更加平和穩定。你發現這種沉澱並不是結束，而是另一個循環的開始，內心充滿了對未來的從容和期待。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚在變動中，此時應順勢調整學習方向，不要固執於單一技能，而要靈活修正自己的根基建設，為未來的豐盛做好準備。",
        "7": "你的底子正處於穩健成長期，應該堅持當前的能力培養方向，持續精進核心技能，這份紮實的根基將成為你邁向豐碩成果的重要基石。",
        "8": "你過往累積的基礎能力已顯沉重，應認清現實避免過度依賴舊有技能，是時候放下包袱，重新審視什麼才是真正需要的核心能力。",
        "9": "你原有的強項基礎已達極限，應順應時代變化轉換能力重心，將過去的優勢適度轉化，為新階段的豐盛發展開創不同的可能性。"
      },
      "2": {
        "6": "你目前的外在表現容易引起誤解或變化，應該靈活調整自己的展現方式，順應環境需求來修正形象，避免固執於單一的表達模式。",
        "7": "你的外在表現正合乎時宜，應該保持這種良好的展現狀態，繼續以目前的方式與人互動，讓自然真實的一面穩定地呈現出來。",
        "8": "你長期建立的外在形象已經根深蒂固難以改變，必須認清這個現實，避免強行改變他人對你的既定印象，學會與現狀共處。",
        "9": "你過度強勢的外在表現已到極限，應該順應變化趨勢，放下過於強硬的姿態，讓自己的展現方式回歸更加柔和自然的狀態。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應該順應內在變化調整發展方向，不要固執於原有計畫，靈活修正才能開創更大空間。",
        "7": "你具備良好的成長基礎和發展動能，應該堅持既定方向持續努力，順應天時地利的趨勢穩步前進，潛力將逐步實現。",
        "8": "你的成長潛力受到過往包袱拖累，應該認清現實限制避免盲目擴張，先處理積累問題再談發展，量力而為最重要。",
        "9": "你的成長動能已達高峰開始轉變，應該順應自然規律調整步調，從外在擴張轉向內在深化，尋找新的發展可能。"
      },
      "4": {
        "6": "你面對的外在環境正在微妙變化，機會與挑戰並存，應該保持敏銳觀察力，隨時準備調整策略以順應環境的轉向。",
        "7": "你所處的外在條件整體有利，天時地利人和皆備，應該堅持既定方向持續前進，把握這個難得的發展良機。",
        "8": "你面臨的外在環境已經形成固化格局，既有的不利因素難以改變，應該務實評估現況，避開正面衝突尋求迂迴。",
        "9": "你眼前的有利環境已達頂峰即將轉變，盛極必衰的規律不可違逆，應該順應這個自然轉折為下階段做好準備。"
      },
      "5": {
        "6": "你觀察到外在環境正處於變動期，雖然豐盛的表象仍在，但已有不穩定的跡象，此時應順勢調整策略，靈活應對即將到來的變化。",
        "7": "你看見外在環境呈現蓬勃發展的態勢，各種機會與資源都在向好的方向匯聚，應該堅持既定方向繼續前進，把握這波豐收的浪潮。",
        "8": "你發現外在環境雖然表面繁榮，但已經過度膨脹難以為繼，各種問題積累深重，必須認清這個現實，避免被虛假繁華所迷惑。",
        "9": "你察覺到外在環境的豐盛已達巔峰開始轉向，盛極而衰的徵兆已現，應該順應這個自然轉變，為下一個階段做好準備。"
      },
      "6": {
        "6": "你需要敏銳觀察外在環境的微妙變化，當發現趨勢開始轉向時，要及時調整策略方向，避免固守過去的成功模式而錯失新機會。",
        "7": "你應該順應當前外在環境的正向發展趨勢，保持既定的前進步調，這是天時地利人和的時刻，持續推進計畫將獲得豐碩成果。",
        "8": "你必須認清外在環境已形成難以逆轉的不利局面，與其硬碰硬消耗資源，不如暫時避開鋒芒，等待更好的時機再出手。",
        "9": "你要看清外在環境的繁榮已達頂峰開始轉折，主動順應這個自然轉變過程，提前為下一階段的挑戰做好充分準備。"
      }
    }
  },
  "56": {
    "number": 56,
    "name": "旅",
    "code": "001101",
    "卦解": "你現在就像個在路上的旅人，身處一個不算太好也不算太壞的狀況中。你的內心有些不安定，但表面上看起來還算穩當，甚至比內在感受要強一些。整個節奏有點像走走停停，雖然大方向沒有明顯的起伏，但也不是完全順暢。你會發現變化來得很緩慢，就像在陌生的路上小心翼翼地前行，每一步都需要時間去適應和確認。這種狀態讓你既不會感到特別焦慮，也不會太過興奮，就是一種淡淡的、持續的移動感。",
    "六階段": {
      "1": "你正準備踏出舒適圈，心中既興奮又忐忑。行李收拾得很簡單，只帶最必需的東西，因為你知道這趟旅程需要保持靈活。周圍的人可能不太理解你的決定，但你內心有股強烈的渴望想要探索未知。環境還很熟悉，但你已經開始用不同的眼光看待一切，準備隨時調整方向。",
      "2": "你開始適應新的節奏，每天都有小小的收穫讓你感到充實。作息雖然和以前不同，但你逐漸找到屬於自己的步調。內心比初期更安定了，對於未來也有了更清晰的想法。周圍的環境變得友善一些，你開始建立新的日常習慣，也學會欣賞路上的風景。",
      "3": "你發現旅程中總有些計畫趕不上變化，東西會弄丟、會需要更換，但你的心境越來越豁達。內心雖然偶爾會因為這些小狀況感到煩躁，但也學會了隨遇而安。環境變得更加多變，你需要經常做出調整，但這些經歷正在鍛鍊你的適應力，讓你變得更有韌性。",
      "4": "你找到了一個很好的據點，終於可以稍微安頓下來。內心感到踏實許多，因為基本需求都能得到滿足，你開始有餘力思考更長遠的規劃。環境對你更加友好，有了這個穩固的平台，你的行動變得更有效率。這個階段讓你重新充電，為接下來的挑戰做好準備。",
      "5": "你的努力開始被更多人看見和認可，門路變得比以前寬廣許多。內心充滿成就感，也更有信心面對各種挑戰。你發現自己的聲譽在外界逐漸建立，很多事情都變得順利起來。環境對你相當有利，各種資源和機會主動向你靠近，這讓你的旅程進展得特別順暢。",
      "6": "你即將完成這個階段的旅程，開始整理收穫和經驗。內心有種圓滿的感覺，但同時也開始思考下一個目標。你學會了斷捨離，只留下真正重要的東西和經驗。環境正在發生變化，新的機會和挑戰在地平線上出現，你已經準備好迎接下一段精彩的旅程了。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖根本。此時應謙虛學習，順應環境調整自己的能力結構，避免急於展現而暴露不足。",
        "7": "你的根基實力正處於成長期，具備良好的發展潛能。應該持續深耕專業能力，順應天時地利，穩步前進不急躁，讓底子更加厚實。",
        "8": "你長期積累的能力模式已經僵化，難以適應新環境的挑戰。必須認清現實，承認既有根基的局限性，避免固執於過時的技能組合。",
        "9": "你過往累積的優勢能力已達頂峰開始衰退，不宜再依賴舊有專長。應順應時代轉變，主動培養新的核心能力，為下一階段做準備。"
      },
      "2": {
        "6": "你在旅途中的表現還不夠穩定，容易給人留下搖擺不定的印象，此時應該主動調整自己的言行舉止，讓外在形象更加一致可靠。",
        "7": "你目前展現出來的旅者風範正合時宜，這種積極進取又不失謙遜的外在表現，能為你的journey帶來更多機會，繼續保持這個狀態。",
        "8": "你過去累積的某些習慣或形象包袱已經成為旅途阻礙，與其勉強改變根深蒂固的外在表現，不如暫時低調行事，避免不必要的衝突。",
        "9": "你一直以來強勢主導的外在風格已到轉換點，在這個旅程階段，你需要學會收斂鋒芒，以更柔軟謙和的姿態與人互動。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應當靈活調整學習方向和發展策略，不要固執於原有計劃，順應環境變化來修正自己的能力培養重點。",
        "7": "你具備良好的成長基礎和發展動能，應當堅持既定的能力提升路線，持續投入時間精力，讓自己的潛力在穩定前進中逐步開花結果。",
        "8": "你目前的成長模式已經僵化，需要認清自身局限性，避免在錯誤方向上繼續耗費精力，重新審視並尋找更適合的發展突破口。",
        "9": "你過往的成長方式已達極限，應當順應時勢轉換發展思路，放下既有的成功模式，以更開放的心態去探索新的能力增長可能性。"
      },
      "4": {
        "6": "你察覺外在環境變動頻繁，此時應保持敏銳觀察力，隨時根據客觀條件的微妙變化調整策略，避免固執於原有計畫而錯失良機。",
        "7": "你發現外在大勢對你有利，環境基本面呈現穩定向上趨勢，此刻應把握天時地利，堅持既定方向持續推進，不宜輕易改弦更張。",
        "8": "你面對的外在環境已形成不利格局且難以撼動，現實條件限制重重，你需要認清客觀局勢，暫時迴避正面衝突，另謀發展空間。",
        "9": "你觀察到外在環境雖仍有利但已達高峰轉折點，舊有優勢正在消退，你應順應這股轉變趨勢，提前佈局適應新的環境格局。"
      },
      "5": {
        "6": "你觀察到外在環境變化頻繁，機會與風險並存，此時應保持靈活應變的心態，隨時調整策略方向，不要固守原有計畫。",
        "7": "你看見外在趨勢正朝有利方向發展，各種條件逐漸成熟，此時應堅持既定路線繼續前進，把握時機積極行動。",
        "8": "你面對的外在環境已形成固化格局，既有結構難以撼動，此時應認清現實限制，避免硬碰硬的無謂消耗。",
        "9": "你察覺外在強勢力量已達頂峰開始轉弱，變化即將來臨，此時應順應這股轉變趨勢，準備迎接新的局面。"
      },
      "6": {
        "6": "你觀察到外在環境變化多端，趨勢尚不明朗，此時應保持彈性思維，隨時準備調整策略方向，不要固執於既定計畫。",
        "7": "你看見外在大勢正朝有利方向發展，環境趨勢與你的目標一致，應該堅定信心持續前進，順應天時地利。",
        "8": "你面對的外在環境已形成強大阻力，既有趨勢難以扭轉，應該認清現實避其鋒芒，尋找其他突破點。",
        "9": "你察覺外在強勢即將轉折，盛極必衰的時刻來臨，應該順應即將到來的變化，提前做好轉向準備。"
      }
    }
  },
  "57": {
    "number": 57,
    "name": "巽",
    "code": "011011",
    "卦解": "你現在處在一個相當穩定的狀態裡，就像微風輕拂般溫和而持續。你的能量算是充足的，內心和外在環境也達到了不錯的平衡，沒有太大的衝突或阻礙。事情進展得還算順暢，雖然不是大起大落的劇烈變化，但有種柔韌的推進力在默默運作著。你會感覺到一種漸進式的累積，就像春風化雨一樣，變化雖然不明顯，但確實在慢慢發生。整體氛圍是和諧而有序的，帶著一種溫柔的堅持感。",
    "六階段": {
      "1": "你現在處於一個微妙的起始點，就像清晨的第一縷微風悄然而至。內心深處有些細微的變化正在發生，也許是一個新的想法或感受開始萌芽。你能感覺到周遭的氛圍正在轉換，雖然變化很輕柔，但確實有什麼東西開始流動了。這種感覺讓你既好奇又略帶不安，因為你知道這是某個重要時刻的前奏。",
      "2": "你的思緒變得更加清晰，就像風向明確的午後，你知道自己該往哪個方向前進。內心的那份篤定讓你在表達時更有條理，別人也開始注意到你的改變。溝通變得順暢，你的想法能夠準確傳達給周圍的人，他們的回應也讓你感到被理解。這種雙向的流動讓你感到舒暢，彷彿找到了屬於自己的節奏。",
      "3": "你遇到了一些意想不到的阻力，就像風遇到建築物產生的亂流。有時候你感覺很有力量，有時候又覺得被什麼東西牽制住。內心開始產生一些矛盾的情緒，對於之前的判斷也開始懷疑。周遭的情況變得複雜，原本看似簡單的事情現在需要更多的耐心和彈性來處理。這讓你學會在不確定中保持平衡。",
      "4": "外在的阻礙開始消散，你發現通往目標的路徑變得寬闊許多。就像風找到了開闊的通道，你的行動變得更加自由和有效率。周圍的人對你的支持度提高，合作關係也變得更加順利。你感到一種擴展的喜悅，彷彿自己的影響力正在自然地向外延伸，而這一切都顯得那麼順理成章。",
      "5": "你現在處於一個關鍵的核心位置，就像風暴中心的指揮者。你的話語和決定開始對周圍產生重要影響，別人會主動來尋求你的意見和協調。內心感到一種責任感和成就感，同時也意識到自己肩負的重量。環境給了你展現領導能力的舞台，你發現自己能夠在複雜的人際關係中找到平衡點。",
      "6": "喧囂漸漸平息，你進入了一個更加寧靜和諧的狀態。就像暴風雨後的清風，一切都變得清澈而有序。內心感到深度的滿足和智慧的沉澱，你不再需要刻意去推動什麼，事情自然會朝著好的方向發展。周圍的環境也呈現出一種新的穩定格局，你知道這是經過洗練後的成熟與完整。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力還在摸索階段，容易搖擺不定，此時應該靈活調整學習方向，不要固執於單一技能，多方嘗試找到最適合的根基。",
        "7": "你的基本功底正在穩健發展，順應當前的學習軌道繼續深耕，保持這種向上的勢頭，讓根基在正確的方向上持續茁壯。",
        "8": "你長期積累的舊有能力已經僵化，難以適應新局面，應該認清現實放下包袱，避免用過時的技能硬撐，重新建立基礎。",
        "9": "你的核心能力已達巔峰但開始疲態，不要再強求突破，順應轉換的時機，讓經驗成為新能力發展的養分而非束縛。"
      },
      "2": {
        "6": "你的外在表現容易搖擺不定，此時應順應情勢調整自己的展現方式，不要固執於既定形象，靈活修正才能贏得他人認同。",
        "7": "你的外在表現正符合時勢所需，應該維持目前的展現風格繼續前進，這種一致性的形象會為你帶來更多機會與信任。",
        "8": "你的外在形象已經固化難以改變，與其勉強塑造新形象，不如認清現實接受既有的外在定位，避免不必要的形象包裝。",
        "9": "你過度強勢的外在表現已達極限，應該順應變化展現更柔和謙遜的一面，讓他人看到你適應轉變的智慧與彈性。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，此時最適合順應環境調整發展方向，不要固執於原有計畫，靈活修正才能開創更大空間。",
        "7": "你的成長勢頭正順應天時地利，應該堅持現有的努力方向持續前進，這是積累實力、穩步提升能力的最佳時機。",
        "8": "你需要認清當前成長受到既有包袱拖累的現實，與其勉強突破不如暫時避開阻礙，重新審視哪些習慣該放下。",
        "9": "你過往的成長模式已達極限，必須順應轉變接受新的挑戰方式，放下舊有優勢才能開啟下一階段的潛能發展。"
      },
      "4": {
        "6": "你需要密切關注外在環境的細微變化，當發現不利因素出現時要及時調整策略，保持靈活應變的態度來化解潛在風險。",
        "7": "你應該把握當前有利的外在條件，順應天時地利的趨勢持續前進，這是環境基本面支持你發展的黃金時期。",
        "8": "你必須認清外在環境已經形成不利局面，積極避開那些難以改變的負面因素，將注意力轉向尋找新的突破口。",
        "9": "你要順應外在環境即將轉變的趨勢，不要固守過去的優勢條件，準備迎接新一輪的機遇與挑戰。"
      },
      "5": {
        "6": "你觀察到外在環境正處於變動期，各種訊號混雜不明，此時應保持彈性思維，隨時準備根據新的發展調整策略方向。",
        "7": "你看見外在大勢正朝有利方向發展，各項條件逐漸成熟，應該堅定信心持續推進，順應這股正面的環境趨勢。",
        "8": "你面對的外在環境已形成固化格局，既有的阻礙根深蒂固難以撼動，應該務實認清現狀，避開正面衝突尋找迂迴路徑。",
        "9": "你察覺外在環境的強勢狀態即將轉換，過往的優勢條件正在消退，應該順應這個轉變趨勢，提前做好應對準備。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，這些新興趨勢雖然還不穩定，但值得你及時調整策略來順應，把握住這些變動中的機會。",
        "7": "你看見外在大勢正朝著有利方向發展，天時地利都在支持你的方向，現在應該堅定信心持續前進，不要輕易改變既定路線。",
        "8": "你面對的外在環境已經形成強大慣性，既有的趨勢積重難返，你需要認清這個現實，避開正面衝突，尋找其他突破點。",
        "9": "你觀察到原本強勢的外在趨勢已達高峰開始轉向，舊勢力雖強但已是強弩之末，你要順應這個轉變，準備迎接新的局面。"
      }
    }
  },
  "58": {
    "number": 58,
    "name": "兌",
    "code": "110110",
    "卦解": "你現在處在一個相對穩定但節奏有點緩慢的狀態裡。雖然你手上的資源和條件都還不錯，算是偏強的，但事情推進起來總是遇到一些小阻礙，讓你感覺步調時快時慢，不太順暢。好在你的內在狀態和外在環境是平衡的，不會有太大的衝突或落差。整體來說，這是個需要耐心的階段，變化不會太劇烈，但隨著時間推移，各種條件會慢慢整合，進展也會逐漸累積起來。",
    "六階段": {
      "1": "你內心深處有著天然的親和力，像春天的第一縷暖風，輕輕吹過就能讓人感到溫暖。即使是最簡單的問候或微笑，都能在別人心中激起漣漪。你發現自己具備這種神奇的能力——不需要刻意表演，只要真誠地展現自己，就能讓周圍的氣氛變得輕鬆愉快。這是你與生俱來的根基，一種讓人願意靠近的磁場。",
      "2": "你在人際互動中找到了舒適的節奏，像是學會了一首熟悉的歌。對話變得自然流暢，你能感受到彼此之間逐漸建立的默契。內心感到踏實安穩，不再需要過度思考每一句話。周圍的人也回應著你的真誠，形成一種良性循環。你發現，最好的溝通其實就是做自己，讓真實的情感自然流露。",
      "3": "你感受到內在能量的波動，有時候熱情過頭，有時候又突然冷靜下來。這種起伏讓你既興奮又困惑，像是在學習如何掌控一種強大的力量。外在環境變得複雜多變，訊息紛雜，你需要在各種聲音中找到自己的位置。這個階段充滿挑戰，但也是你學習平衡與節制的重要時刻，潛力正在這種磨練中慢慢顯現。",
      "4": "你發現影響力開始向外擴散，就像投入池塘的石子，漣漪一圈圈擴展開來。原本只是小範圍的互動，現在連外圍的人也開始關注並回應。環境變得更加活躍，資訊傳播的速度明顯加快。你能感受到這種連鎖反應帶來的力量，同時也意識到自己的責任更重了。周圍的能量場正在重新組合，為更大的影響力創造條件。",
      "5": "你站在了最佳的位置上，擁有了真正的號召力。當你開口說話時，周圍的人都願意聆聽，你的話語能夠凝聚共識，帶動整體氛圍。內心感到充實而穩定，既有熱情又不失理智。環境完全配合你的節奏，形成了理想的互動狀態。這是一個黃金時刻，你的影響力達到高峰，卻能保持優雅與從容。",
      "6": "熱烈的時光漸漸沉澱下來，你感受到一種深層的滿足感。表面的喧嘩雖然減少了，但那些真正重要的連結卻留了下來，變成了珍貴的底蘊。你的內心變得更加沉靜智慧，明白了什麼是真正持久的價值。環境也回歸平靜，但氣氛中仍保留著溫暖的餘韻。這個階段讓你學會了收斂與內化，為下一個循環做好準備。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力還不夠穩固，容易因外在變化而動搖，此時應該謙虛學習，及時調整自己的知識結構和技能配置，為未來發展打下更堅實的根基。",
        "7": "你的基本功底扎實且符合時代需求，這是你最大的優勢，繼續深耕專業領域，保持學習熱忱，讓核心能力成為你行走江湖的不敗資本。",
        "8": "你過往累積的基礎能力已經僵化，難以適應新環境的挑戰，與其固守舊有技能，不如承認現實差距，重新定位自己的發展方向。",
        "9": "你引以為傲的專業能力已達巔峰但開始走下坡，不要執著於過去的成就，主動擁抱變化，將經驗智慧轉化為指導他人的新價值。"
      },
      "2": {
        "6": "你在人際互動中容易情緒波動，表現出的態度時好時壞。此時應該順勢調整自己的表達方式，學會在不同場合展現適當的一面，避免給人不穩定的印象。",
        "7": "你目前展現出的親和力和溝通能力正符合環境需求，這是順應天地趨勢的表現。維持這種積極正面的外在形象，繼續以真誠的態度與人交往，必能獲得更多認同。",
        "8": "你長期養成的外在表現模式已經根深蒂固，積習難改。認清現實接受這個事實，不要勉強改變已定型的個人風格，而是避開不適合的場合和人群。",
        "9": "你過度熱情的表現方式已經到了強弩之末，容易給人壓迫感。順應這個轉變的時機，適度收斂你的外在表達，以更內斂穩重的方式與人互動會更好。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，此時最適合順應內心真實感受，主動調整學習方向與能力培養重點，把握這個轉變機會來重新定位自己的發展路徑。",
        "7": "你的成長動能正與天時地利同步，應該堅持當前的能力提升計畫，持續在既定方向上深耕，這股順勢而為的力量將帶來穩健而持久的進步。",
        "8": "你需要認清某些固化的思維模式已成為成長阻礙，與其強求突破不如暫時避開這些僵化領域，轉而開發其他潛在能力，為未來蓄積新的成長動力。",
        "9": "你過往引以為傲的能力優勢已達巔峰，現在需要順應時勢轉變，主動學習新技能或轉換成長方向，讓經驗智慧成為下一階段發展的基石。"
      },
      "4": {
        "6": "你需要密切關注外在環境的微妙變化，當發現條件不如預期時，要有彈性地調整策略，不要固執於原本的計畫。",
        "7": "你面對的外在環境正處於有利的發展趨勢，應該把握這個良好時機，堅定地推進既定目標，順勢而為。",
        "8": "你所處的外在環境已經形成不利的固化局面，要理性認清現實限制，暫時避開正面衝突，尋找其他出路。",
        "9": "你察覺到外在環境的優勢已達頂峰開始轉變，應該順應這個轉折趨勢，適時調整方向以因應新局面。"
      },
      "5": {
        "6": "你觀察到外在環境正處於變動期，人心浮躁不定，此時應保持彈性思維，隨時準備調整策略以適應環境的快速變化。",
        "7": "你看見外在大勢明朗向好，各方資源配合度高，正是乘勢而上的良機，應堅定信心持續推進既定方向。",
        "8": "你面對的外在環境已形成固化格局，既得利益者盤根錯節，應認清現實避免硬碰硬，另尋突破口或暫時觀望。",
        "9": "你察覺外在強勢力量已達頂峰開始衰退，舊秩序即將轉換，應順應這股轉變潮流，準備迎接新的機會。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，這些變化雖然還不穩定，但正是調整策略的好時機，順應這些新興趨勢來修正你的方向。",
        "7": "你看見外在大勢正朝著有利方向發展，這股向上的環境趨勢與你的目標一致，堅持既定路線繼續前進就是最佳選擇。",
        "8": "你面對的外在環境已經固化成型，既有的不利格局短期內難以改變，認清這個現實並避開正面衝突是明智之舉。",
        "9": "你察覺外在環境的強勢已到達頂點，即將出現轉折，主動順應這個即將到來的變化，才能在新局面中站穩腳跟。"
      }
    }
  },
  "59": {
    "number": 59,
    "name": "渙",
    "code": "010011",
    "卦解": "你現在就像站在一條緩緩流動的河邊，水流不急不緊，但方向很明確。你的內心可能還有些猶豫或困頓，但外在的環境和機會正在悄悄為你鋪路。這種狀態有點像春天的融雪，雖然變化不劇烈，但你能感受到僵局正在慢慢鬆動。周圍的人事物似乎比你自己更有動能，推著你往前走。整個氛圍是溫和的轉機，不會有突然的大變化，但能感覺到阻礙正在一點一滴地消散。",
    "六階段": {
      "1": "你的根基目前處於調整期，就像水流需要重新找到方向一樣。內心感到有些焦躁，因為你發現周圍的人對你的想法反應總是慢半拍，讓你覺得溝通不太順暢。原本安排好的計劃被各種突發狀況打亂，時間變得緊迫。環境給你的回饋不如預期，但這正是重新檢視自己基礎是否穩固的時機。",
      "2": "你在表現上遇到了阻力，推動事情進展時總覺得力不從心。內心有種游泳逆流的感受，明明很努力卻前進緩慢，還經常需要停下來重新整理思緒。周圍的資源或支援不太充足，你發現自己需要更多時間來回頭補強之前沒做好的部分。這種起起停停的狀態讓你有些挫折感。",
      "3": "你的潛力雖然存在，但發揮起來相當吃力，像是在淺水區努力划船前進。內心知道自己有能力做得更好，卻感到被某些限制束縛住了。可運用的條件不夠理想，你需要頻繁地調整策略和做法。雖然過程辛苦，但每一次的回頭補強都在為未來的突破做準備，只是現在還看不到明顯的成效。",
      "4": "環境條件讓你需要比平常更有耐心，很多事情的進展都比預期慢。你發現自己花更多時間在等待和協調上，而不是直接的行動。周圍的節奏似乎都比你想的要慢，但你學會調整自己的步調，專注在維持重要的人際連結上。雖然推進緩慢，但關係網絡正在慢慢建立穩固的基礎。",
      "5": "現在的環境雖然有些緊繃，但核心的支撐還算穩定。你感到責任重大，需要在有限的資源下維持重要的運作。雖然不是最理想的狀態，但你發現自己有能力守住關鍵的底線和原則。周圍的人對你有所期待，而你也正努力在現有條件下發揮最大效用，保持事情不至於失控。",
      "6": "未來的趨勢顯示你需要做好間歇調整的心理準備。前進的路不會太順暢，但這不代表沒有進展的可能。你會發現自己需要經常停下來重新評估和補強，這種節奏雖然不快，但每次的調整都讓你更加穩健。環境會持續考驗你的耐性和適應力，但只要把握住每個補位的機會，最終還是能達到目標。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外在變化而動搖根基。此時應謙虛學習，順應環境調整自己的能力結構，避免急躁求成而損傷根本。",
        "7": "你的基礎能力正處於穩健成長期，應持續深耕專業技能。保持學習的節奏和方向，讓根基在天地正道中自然茁壯，為未來發展積蓄實力。",
        "8": "你長期累積的舊有能力模式已難適應現況，強求維持反而消耗更多能量。認清時勢變遷的現實，暫緩依賴過往經驗，重新審視能力重點。",
        "9": "你過往建立的強大能力優勢已達極限，繼續硬撐只會適得其反。順應時代轉換的趨勢，將既有根基轉化為新的發展基礎，迎接下一個階段。"
      },
      "2": {
        "6": "你的外在形象容易給人搖擺不定的印象，此時應順應情勢調整展現方式，不必堅持固定的表現模式，靈活變通反而能贏得更多信任。",
        "7": "你展現出的穩定形象正符合當下需求，繼續保持這種可靠的外在表現，讓他人看見你的一致性和原則性，這是建立威信的最佳時機。",
        "8": "你長期累積的負面印象已難以快速扭轉，與其勉強改變外在形象，不如先認清現實狀況，暫時收斂鋒芒，避免進一步惡化關係。",
        "9": "你過於強勢的外在表現已達極限，繼續維持這種姿態只會適得其反，此時應順應變化展現更柔和謙遜的一面，才能化解僵局。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，應當順應內心的直覺調整方向，不要固執於原有的發展路徑，靈活修正才能開拓更廣闊的未來空間。",
        "7": "你的成長動能正值上升趨勢，應當堅持現有的努力方向持續前進，保持積極主動的學習態度，順應天時地利必能大幅提升實力。",
        "8": "你的成長受到過往包袱拖累，應當認清現實放下不必要的執著，避免在無效的領域浪費精力，重新聚焦於真正有價值的發展方向。",
        "9": "你的成長已達高峰轉折點，應當順應時勢轉變發展策略，從過度積極轉為深耕內化，讓既有的能力沉澱昇華為更深層的智慧。"
      },
      "4": {
        "6": "你需要密切關注外在環境的細微變化，當發現不利苗頭時要及時調整策略，靈活應變才能化解潛在危機。",
        "7": "你應該把握當前有利的外在條件，順應大環境的正面趨勢，堅定地朝既定目標持續推進。",
        "8": "你必須正視外在環境已經惡化的現實，不要抱持僥倖心理，應該暫時避開不利因素等待時機。",
        "9": "你要認知到外在的有利條件即將轉變，主動順應這個轉換過程，為下一階段做好準備。"
      },
      "5": {
        "6": "你觀察到外在環境正處於變動期，各種信號時有矛盾，此時應保持敏銳觀察力，隨時準備根據最新狀況調整自己的策略方向。",
        "7": "你看到外在大環境的發展趨勢正朝有利方向推進，各項指標都顯示積極信號，應該堅定信心繼續按既定計畫前行。",
        "8": "你面對的外在現況已形成難以撼動的格局，各種阻力盤根錯節，你需要務實認清當前局限，避免硬碰硬的無謂消耗。",
        "9": "你察覺外在環境的強勢態勢已接近轉折點，原有的推動力正在減弱，你應該順應這個轉變趨勢做好新的準備。"
      },
      "6": {
        "6": "你觀察到外在環境正在快速變化，雖然趨勢尚未明朗，但這正是調整策略的最佳時機，保持靈活應變的心態來順應這些變動。",
        "7": "你看見外在大勢正朝有利方向發展，天時地利皆在你這一邊，此時應該堅定信念繼續推進既定計畫，順應天地自然趨勢前行。",
        "8": "你面對的外在環境已經僵化固結，積累的問題太過沉重難以扭轉，與其硬碰硬不如暫時退避，等待更好的時機再出手。",
        "9": "你察覺外在的強勢趨勢已達頂峰開始轉向，舊有的力量即將衰退，現在需要順應這個轉變調整自己的方向和策略。"
      }
    }
  },
  "60": {
    "number": 60,
    "name": "節",
    "code": "110010",
    "卦解": "你現在處於一種穩定而內斂的狀態，就像水流在固定河道中平穩前進。外在環境沒有太大起伏，但你內心的力量其實比表面看起來更充實。這段時間你的步調不疾不徐，雖然進展不算快速，卻很踏實。你會感覺到一種安靜的專注感，像是在為某個目標默默積蓄能量。整體氛圍是平和而有序的，有種內在充實但不張揚的感覺，就像暗流涌動但表面平靜的深水。",
    "六階段": {
      "1": "你已經建立了良好的生活節奏和習慣，內心感到踏實安定。每天的作息規律讓你更有效率地處理各種事務，不再像以前那樣手忙腳亂。周圍的人開始注意到你的改變，你的穩定表現讓他們對你更有信心。這種規律化的根基讓你在面對挑戰時更有底氣，也讓你的能量得到更好的運用。",
      "2": "你正在檢視自己的不足之處，內心有些焦慮但也充滿改善的動力。偶爾會發現某些地方需要緊急修補或調整，讓你感到有點措手不及。環境中的一些變化要求你更加細心和靈活，你發現自己需要在某些方面臨時頂替或加強。這個修復過程雖然辛苦，但讓你更清楚自己的能力邊界。",
      "3": "你感受到壓力接近臨界點，內心既想突破又擔心超載。目前的狀況讓你沒有太多迴旋空間，每個決定都需要謹慎考慮。周遭環境的需求很高，你必須在有限的資源下做出最佳配置。雖然感到緊繃，但這也讓你更專注於重要的事情，學會在約束中發揮最大效能。",
      "4": "外在環境開始重視基礎建設的重要性，你發現穩定的供應和管道變得至關重要。周圍的資源流動更加順暢，讓你感到安心和支持。環境條件正朝著更有序、更可靠的方向發展，這為你的計劃提供了堅實的基礎。你能感受到整體系統運作得更加流暢，為未來的擴展創造了良好條件。",
      "5": "外在環境中的基礎設施正展現其價值，你看到供應系統穩定運作、各種管道暢通無阻。這讓你內心充滿希望和信心，感受到環境對你的支持。服務範圍正在擴展，更多的可能性向你開放。整個外在條件都在向好的方向發展，讓你對未來充滿期待，也更有勇氣去嘗試新的領域。",
      "6": "外在環境呈現高度有序的狀態，各種維護保養工作都發揮了效果。你內心感到平靜和滿足，看到所有努力都得到了回報。周圍的一切都運行在最佳狀態，沒有突發的問題或意外。這種穩定的環境趨勢讓你可以安心規劃長遠目標，不必擔心基礎會出現動搖，是個適合穩步前進的時期。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚未穩固，容易因外界變化而動搖，此時應順應現況靈活調整學習方向，重新檢視自己的根基，修正不足之處。",
        "7": "你的基本功底正處於上升期，順應天地自然規律持續精進，保持當前的學習節奏和方向，穩步建立更深厚的能力基礎。",
        "8": "你長期累積的舊習慣已成包袱，認清現實中那些阻礙成長的根深蒂固模式，避免繼續強化已經過時的基礎能力。",
        "9": "你過往引以為傲的基礎能力已達極限，順應時代轉變的需求，放下執著轉向培養新的核心能力，迎接下一個成長階段。"
      },
      "2": {
        "6": "你現在展現的節制態度還不夠穩定，容易讓人看出猶豫不決，應該順勢調整表現方式，讓外在的自律更加自然而有說服力。",
        "7": "你展現出來的節制與自律正符合當下趨勢，這種穩健的外在表現值得維持，繼續以這樣的姿態面對外界會帶來好結果。",
        "8": "你長期養成的外在表現模式已經過於僵化，認清現實中這種刻板印象難以改變，暫時避免在這方面做出太大調整為宜。",
        "9": "你過去強勢的節制表現已到極限，現在需要順應情況轉變，讓外在展現更加柔和靈活，才能重新獲得他人的認同與信任。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，需要靈活調整自己的節制方式，不要固守舊有的限制模式，順應內在變化來重新定義成長的邊界。",
        "7": "你具備穩定向上的成長動能，應該堅持現有的自我約束原則，持續在既定的節制框架內深化能力，讓潛力自然展現。",
        "8": "你過度的自我限制已成為成長阻礙，必須認清這些僵化束縛的現實，避免繼續用過嚴的標準壓抑自己的發展空間。",
        "9": "你過往的成長模式已達極限，需要順應轉變放下執著的控制慾，讓成長潛力在更寬鬆自然的節制中重新煥發活力。"
      },
      "4": {
        "6": "你面對的外在環境正在微妙變化，市場條件尚未穩定，此時應靈活調整策略，順應環境波動來修正你的節制方針。",
        "7": "你所處的外在條件正值有利時機，大環境支持你的節制計畫，應該堅持既定方向，維持當前的節約策略持續前進。",
        "8": "你面臨的外在環境已形成不利格局，過度消耗的現實難以逆轉，必須認清形勢嚴峻性，避免在惡劣條件下強行推進。",
        "9": "你依賴的外在優勢已達高峰開始轉弱，環境紅利即將消失，應順應這個轉變趨勢，及時調整節制的重點和方式。"
      },
      "5": {
        "6": "你觀察到外在環境正處於變動期，節制的標準也在調整中，此時應靈活修正你的應對策略，不要固守原有的節制方式。",
        "7": "你看見外在大勢正朝著有序節制的方向發展，這正是你持續推進節制計畫的最佳時機，順應這股正向趨勢前進。",
        "8": "你面對的外在環境已經過度失衡，積累的問題難以短期內透過節制來改善，現在應該認清現實，暫時避開正面衝突。",
        "9": "你發現外在的極度節制已到達臨界點，過猛的控制即將反轉，此時應順應即將到來的鬆動變化，準備調整策略。"
      },
      "6": {
        "6": "你觀察到外在環境的節制標準正在鬆動變化，應當靈活調整自己的行為準則，不要固守過時的規範，順應新趨勢修正策略方向。",
        "7": "你看見外在環境正朝著更嚴謹節制的方向發展，這是天地運行的自然趨勢，你應該堅持當前的節約方針，持續推進既定計畫。",
        "8": "你面對的外在環境已陷入過度節制的僵化狀態，積習難改且阻力重重，你需要認清現實，暫時避開正面衝突，等待時機。",
        "9": "你發現外在的嚴苛節制已達極限開始反轉，強制管控即將鬆綁，你要順應這個轉變趨勢，準備迎接更寬鬆的新環境。"
      }
    }
  },
  "61": {
    "number": 61,
    "name": "中孚",
    "code": "110011",
    "卦解": "你現在處在一個相當穩定的狀態中，內心的想法和外在的表現基本上是一致的，沒有太大的內外衝突。你的條件其實不錯，有一定的實力和資源，雖然事情推進的節奏不算特別快，但整體方向是通順的。\n\n你會感受到一種踏實的氛圍，就像是在平穩的河流中緩緩前行，雖然沒有激流般的快速，但每一步都很紮實。短期內可能不會有太戲劇性的變化，但隨著時間推移，各種條件會逐漸整合得更好，讓你的前進更加順暢。",
    "六階段": {
      "1": "你正在建立最初的信任基礎，雖然只是小小的承諾和約定，但這些看似微不足道的互動正在悄悄發揮作用。你內心可能還有些不確定，但已經開始感受到與他人連結的可能性。周圍的環境還算單純，人們願意給彼此機會，你發現即使是簡單的誠意表達，也能換來意想不到的配合和回應。",
      "2": "你的真誠開始顯現出來，與人對話時變得更加坦白直率，不再刻意包裝或隱藏什麼。內心感到一種輕鬆感，因為你發現真實的自己更容易被接納。人際關係中的距離感自然消解，你和重要的人之間建立了更深層的理解。這種真實的互動讓你感到溫暖，也讓周圍的氣氛變得更加開放融洽。",
      "3": "你開始遇到一些考驗，傳言和誤解在你周圍流傳，讓你感到困惑和不安。內心出現了波動，有時懷疑自己的判斷，有時質疑他人的動機。外在環境變得複雜，資訊容易失真，你發現原本清晰的關係變得模糊。這個階段讓你感到焦慮，但也是檢視真正信任的重要時刻，需要更多耐心來釐清真相。",
      "4": "好消息開始從外界傳來，你的名聲和信譽正在更廣的範圍內傳播。環境條件變得有利，新的機會和人脈開始向你靠攏。你內心感到振奮，因為過去的努力終於獲得認可。周圍出現了更多支持的聲音，人們開始主動尋求與你合作或建立關係。這種正向的循環讓你充滿信心，也為未來的發展奠定了良好基礎。",
      "5": "你現在處於核心位置，說出的話具有分量和影響力，人們都在關注你的態度和決定。內心感到一種責任感，同時也有被信賴的滿足感。環境呈現高度的協調性，大家朝著共同的目標努力，形成了強大的集體力量。你的領導能力得到充分發揮，周圍的人都願意跟隨你的步調，整個局面呈現和諧統一的狀態。",
      "6": "激烈的階段已經過去，一切回歸平靜。你內心感到深深的安定感，不再需要刻意維護什麼，信任已經內化成自然的默契。外在環境也趨於穩定，人際關係變得成熟而深厚，不需要太多言語就能互相理解。這種寧靜並非冷漠，而是經歷風雨後的沉澱。你享受這份得來不易的平和，知道真正的信任就是這樣無聲而堅固。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力雖有不穩之處，但正因如此具有可塑性，應主動檢視自己的根基，順應變化調整學習方向，將不確定轉化為成長動力。",
        "7": "你的底子扎實且符合時勢所需，應持續深耕現有的核心能力，維持學習節奏穩步前進，讓根基成為你最可靠的競爭優勢。",
        "8": "你過往累積的基礎已顯僵化難以適應新局，應認清現實放下包袱，避免固守舊有模式，重新審視什麼才是真正需要的能力。",
        "9": "你的既有能力已達高峰但面臨轉型關鍵，應順應時代變遷主動轉換跑道，將豐富經驗化為新領域的起步優勢，迎接下個階段。"
      },
      "2": {
        "6": "你的外在表現容易搖擺不定，此時應順勢調整自己的言行舉止，不必勉強維持固定形象，適度的變通反而能贏得他人更多信任。",
        "7": "你展現出來的誠信正合天時地利，應該堅持這份真誠的表現方式，持續以一致的態度面對眾人，這是建立長久信譽的最佳時機。",
        "8": "你長期以來的外在形象已經固化難改，與其勉強扭轉不如認清現實，暫時收斂鋒芒，避免在公眾場合做出承諾或重大表態。",
        "9": "你過度強勢的外在表現已到極限，應該順應情勢轉為低調內斂，放下強者姿態，以更柔軟謙遜的方式與人互動才能化解危機。"
      },
      "3": {
        "6": "你的成長路上充滿變數，但這正是機會所在。當發現方向不對時，要勇於修正調整，靈活應變才能找到真正適合的發展道路。",
        "7": "你正處在穩定成長的黃金期，應該堅持既定的發展方向。保持初心，持續精進，順應自然規律前進，成長潛力將逐步實現。",
        "8": "你過往的習慣模式已成包袱，限制了成長空間。必須認清現實，避開舊有的慣性思維，才能為未來發展開闢新的可能性。",
        "9": "你曾經的優勢已到轉換期，不要固執於過去的成功模式。順應時勢變化，謙遜學習新事物，反而能開啟另一波成長契機。"
      },
      "4": {
        "6": "你需要密切關注外在環境的微妙變化，當發現不利信號時要及時調整策略，靈活應變才能避免因環境轉變而帶來的損失。",
        "7": "你應該把握當前有利的外在條件，順應天時地利的大趨勢持續前進，這是環境支持你發展的黃金時機。",
        "8": "你必須認清外在環境已經形成不利局面，積極尋找退路或轉換跑道，避免在惡劣條件中硬撐而消耗實力。",
        "9": "你要察覺外在環境的鼎盛期即將結束，主動順應即將到來的轉變，提前布局新的發展方向才能持續成功。"
      },
      "5": {
        "6": "你觀察到外在環境正處於微妙變化中，此時應保持敏銳觸覺，適時調整自己的立場與策略，順應這些初現的轉機與挑戰。",
        "7": "你看見外在趨勢正朝著有利方向發展，這是天時地利的好機會，你應該堅定信念，維持現有的前進步調與方向不變。",
        "8": "你面對的外在環境已然僵化固著，積累的問題難以逆轉，你需要認清現實的限制，避免硬碰硬的無謂消耗與衝突。",
        "9": "你發現外在強勢已呈現疲態，盛極將衰的徵象明顯，你應該順應這個自然轉變的時機，準備迎接新的局面與可能。"
      },
      "6": {
        "6": "你需要密切關注外在環境的細微變化，當發現趨勢出現波動時，要靈活調整自己的策略方向，避免固守既定計畫而錯失良機。",
        "7": "你應該認清當前外在環境正朝著有利方向發展，順應這股天地大勢持續前進，保持既定路線不要輕易改變或猶豫不決。",
        "8": "你必須正視外在環境已經形成難以逆轉的負面趨勢，理性評估現實狀況後選擇暫時避讓，等待更合適的時機再行動。",
        "9": "你要察覺外在環境的強勢已達頂峰開始轉弱，主動順應這個轉變趨勢調整自己的立場，準備迎接即將到來的新局面。"
      }
    }
  },
  "62": {
    "number": 62,
    "name": "小過",
    "code": "001100",
    "卦解": "你現在處在一個略顯吃力的階段，就像在泥濘路上慢慢前行，每一步都需要更多努力。雖然你的內在狀態和外在環境保持著微妙的平衡，但推進任何事情都感覺格外費勁，阻力比預期來得多。這種狀況讓你有種「使不上勁」的感覺，明明在努力，進展卻很有限。不過這種緩慢的節奏並非完全停滯，而是在為後續的突破默默積蓄能量，每個小小的堅持都在為未來的順暢鋪路。",
    "六階段": {
      "1": "你現在處於謹慎起步的階段，內心充滿警覺性，知道自己需要保持低調。你刻意避開那些可能帶來麻煩的人事物，選擇從邊緣小心翼翼地開始行動。周圍的環境充滿不確定性，高調行事容易碰壁，所以你學會了貼地飛行的智慧。這種小心翼翼雖然讓你感到有些束縛，但內心深處知道這是必要的保護策略，讓你能在複雜的局勢中找到安全的立足點。",
      "2": "你開始感受到細微調整帶來的正面回饋，內心逐漸建立起信心。那些看似微不足道的小改變，竟然讓整個狀況變得順暢許多。你發現自己越來越懂得在細節上下功夫，這種精準的操作讓你感到滿足。周圍的環境開始對你的努力有所回應，就像原本崎嶇的路面漸漸平整，你走起來也更加輕鬆自在，內心升起一種「原來如此」的恍然大悟。",
      "3": "你發現自己陷入了過度追求完美的循環中，內心有些焦躁不安。明明想要前進，卻總是在同樣的細節上打轉，效率明顯下降。你感到有些挫折，因為每一步都變得小心謹慎，進展緩慢。周圍的環境似乎也變得複雜多變，需要你不斷地微調和適應。雖然這種狀態讓你感到疲憊，但內心深處明白，這個階段的磨練正在培養你更深層的耐心和精確度。",
      "4": "你開始將注意力轉向外在環境的調整，發現透過小幅度的修補和改善，整體運作能夠維持穩定。內心有種踏實的感覺，知道自己正在做有意義的事情。雖然這些努力看起來不起眼，無法創造爆發性的成長，但你漸漸接受這樣的節奏。周圍的條件雖然有限，卻也提供了穩定的基礎。你學會在既有框架內發揮創意，內心反而獲得一種安定感，不再急於求成。",
      "5": "你來到了關鍵的轉折點，內心感受到一種微妙的成就感。你發現在重要時刻，適度的表現和恰到好處的分寸掌握，反而能帶來意想不到的成效。周圍的環境對你的這種「恰如其分」給予正面回應，你不需要過度用力就能看見成果。內心充滿智慧的喜悅，明白真正的成功不在於轟轟烈烈，而在於精準的時機把握和適切的力度運用，這讓你感到深深的滿足。",
      "6": "你感受到一個階段即將結束，內心有種既疲憊又釋然的複雜情緒。長時間的精細操作讓你的能量消耗殆盡，是時候回歸簡單自然的狀態了。周圍的環境也在提醒你，過度的追求完美和控制已經到了極限。你開始嚮往樸素平凡的日常節奏，內心渴望放下那些精密的計算和操控。這種回歸讓你感到解脫，明白有時候平凡就是最好的狀態，不需要一直保持高度的警覺和精準。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚有不足之處，此時應謙虛學習，針對弱點主動調整改善，不要急於展現，先把根基打穩才能走得長遠。",
        "7": "你的基本功底紮實穩固，正是持續精進的好時機，保持現有的學習節奏和努力方向，讓能力在穩定中持續成長茁壯。",
        "8": "你過往累積的基礎已成包袱，舊有的能力模式難以突破，應認清現實限制，避免固執己見，重新思考能力發展的方向。",
        "9": "你的基礎能力已達極限，繼續硬撐反而傷身，應順應時勢轉變，將豐富經驗轉化為指導智慧，走向新的發展階段。"
      },
      "2": {
        "6": "你目前展現出的形象容易讓人產生誤解，趁著局面還能調整的時候，主動修正自己的表達方式和外在行為，讓真實的你更好地被看見。",
        "7": "你現在展現出的狀態正符合時勢所需，繼續保持這樣的外在表現，穩健地向前推進，這份一致性將為你帶來更多機會。",
        "8": "你長期以來的外在形象已經固化，很難在短時間內改變他人的既定印象，不如接受現實，在既有框架內發揮你的實力。",
        "9": "你過於強勢的外在表現已經到了臨界點，是時候放下堅持，順應環境的變化，讓自己展現更柔軟包容的一面。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，保持開放心態隨時調整學習方向，不要固執於既定計畫，靈活修正才能把握住真正適合的發展機會。",
        "7": "你具備良好的成長基礎，應該堅持當前的努力方向持續精進，順應自然發展規律穩步前行，耐心積累實力必有所成。",
        "8": "你需要認清自身能力的現實限制，避免好高騖遠的不切實際想法，專注於基本功的扎實訓練，從根本處重新建立成長基礎。",
        "9": "你過往的成長模式已到轉換點，主動順應新的發展趨勢調整策略，放下舊有的成功經驗，以謙遜態度迎接下一階段的蛻變。"
      },
      "4": {
        "6": "你需要密切觀察外在環境的細微變化，當發現條件不如預期時，要勇於調整策略方向，靈活應變才能化解不利局面。",
        "7": "你所處的外在環境正呈現有利趨勢，此時應該保持既定方針穩步前進，順應天時地利的推動力量持續發展。",
        "8": "你必須正視外在環境已經形成的不利格局，承認現實限制的存在，選擇暫時迴避或降低期望值是明智之舉。",
        "9": "你察覺到外在有利條件已達頂峰開始轉弱，應順應這個轉變趨勢調整步調，避免過度依賴即將消失的優勢。"
      },
      "5": {
        "6": "你觀察到外在環境正處於變動期，各種跡象顯示情況尚未穩定，此時應保持彈性思維，隨時準備根據新的發展調整你的策略和應對方式。",
        "7": "你看見外在趨勢正朝有利方向發展，各項條件逐漸成熟，現在正是保持既定方針的時機，穩健前進而不需要大幅改變現有的行動計畫。",
        "8": "你面對的外在環境已形成固化格局，既定的結構和阻力難以撼動，與其強行突破不如重新評估現實，尋找其他更可行的發展路徑。",
        "9": "你察覺外在的強勢局面已達高峰開始轉弱，原本的優勢條件正在消退，順應這個轉折點的來臨，適時調整你的期望和行動方向。"
      },
      "6": {
        "6": "你觀察到外在環境正在微妙變化，這些變化雖然不穩定但充滿機會，你應該保持敏銳洞察力，隨時準備根據趨勢調整自己的策略方向。",
        "7": "你看見外在大勢正朝著有利方向發展，天時地利皆備，你要堅定信心繼續推進既定計畫，順應這股正向的環境趨勢前行。",
        "8": "你發現外在環境已形成難以撼動的固化格局，既有的趨勢積重難返，你需要認清現實，避免與大勢對抗，尋找其他突破口。",
        "9": "你察覺外在強勢趨勢已達高峰開始轉折，舊有格局即將變化，你要順應這個轉變的時機，提前布局迎接新的環境週期。"
      }
    }
  },
  "63": {
    "number": 63,
    "name": "既濟",
    "code": "101010",
    "卦解": "你現在處在一個相對穩定但略顯沉悶的狀態中。事情進展得很有節奏，各個環節都配合得不錯，但整體推進速度比較緩慢，像是在濃稠的液體中前行。你內心的力量比外在環境更充沛，有種想要突破卻被現實條件約束的感覺。雖然短期內看不到什麼大的變化，但你能感受到一種暗流在涌動，每一個小小的努力都在默默累積能量，為未來的突破做準備。",
    "六階段": {
      "1": "你的基礎非常紮實，就像一台剛啟動的精密機器，每個環節都能準確到位。你內心有種踏實的安全感，因為知道自己已經做好充分準備，不需要慌張或急躁。周圍的條件也很配合，該有的資源都已就緒，流程設計得很完善。這種狀態讓你感到自信，彷彿一切都在掌控之中，按部就班地進行就能達到預期效果。",
      "2": "你的表現相當穩定，各方面都保持著良好的平衡狀態。你內心感到滿足和諧調，沒有太大的波動或焦慮，就像找到了最適合的節奏。外在環境也很支持你的發揮，你的努力能夠產出品質穩定的成果。這個階段讓你覺得自己真的找對了方向，做事有章法，成效也能持續維持在理想的水準上。",
      "3": "你的潛力開始顯現，但偶爾會感受到一些內在的複雜情緒和起伏。你心中可能有些不安定的感覺，像是預感到什麼變化即將發生。外在環境出現了一些小小的波動，雖然不至於造成大問題，但確實讓節奏變得不那麼順暢。這個階段考驗著你的應變能力，需要更靈活地調整步調來應對這些微妙的變化。",
      "4": "外在條件已經相當成熟，你與外界的互動變得更加順暢自然。你內心感到擴展的喜悅，因為發現自己的影響力正在穩定地向外延伸。周圍的人事物都能很好地配合你的節奏，合作關係建立得很順利。這個階段讓你體會到真正的協調之美，不需要過度努力就能讓事情自然而然地朝好的方向發展。",
      "5": "環境現況達到最佳狀態，一切都井然有序地運行著。你內心充滿了掌控全局的成就感，感覺自己真的坐在了最適合的位置上。周圍的秩序感非常強烈，每個人都知道自己該做什麼，整個系統運作得近乎完美。這是你最有權威感的時刻，調度指揮都很到位，讓你深深體會到什麼叫做「一切盡在掌握」的感覺。",
      "6": "環境趨勢顯示事情已經接近完成，熱度開始自然冷卻。你內心有種功成身退的平靜感，知道該是轉向維護和保養的時候了。外在環境也變得比較平淡，不再有那麼多激烈的變化和挑戰。這個階段讓你學會珍惜已有的成果，專注於細緻的維護工作，為下一個循環做好準備。雖然刺激感降低了，但穩定感卻更加深厚。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力雖有起伏不定之處，但這正是成長的契機，應當順勢調整學習方向，修補知識與技能的薄弱環節，為未來發展奠定更穩固的根基。",
        "7": "你的基礎能力正值上升趨勢，應當堅持當前的學習與修練方向，持續精進核心技能，讓這份根基成為你在既濟局面中穩步前進的堅實支撐。",
        "8": "你過往累積的基礎已形成固定模式難以改變，應當認清現實中的能力限制，避免勉強突破既有框架，在現有根基上發揮所長即可。",
        "9": "你長期建立的基礎能力已達巔峰狀態，應當順應時勢變化，將深厚根基轉化為指導他人的智慧，從個人修練轉向傳承與分享的新階段。"
      },
      "2": {
        "6": "你的外在形象容易因小事而動搖，此時應該順應環境變化，適時調整自己的表現方式，不要固執於既定的形象包袱。",
        "7": "你的外在表現正符合天時地利，應該繼續維持現在的姿態和作風，穩定前進，讓別人看到你的一貫性和可靠度。",
        "8": "你長期建立的外在形象已經根深蒂固難以改變，必須認清這個現實，避免強求突破既有的框架和他人的既定印象。",
        "9": "你過去強勢的外在表現已達極限，現在需要順應時勢轉變，放下強硬姿態，以更柔和的方式與外界互動。"
      },
      "3": {
        "6": "你的成長潛力正處於變動期，適時調整學習方向和發展策略，不要固執於既定計畫，靈活修正才能開拓更大的提升空間。",
        "7": "你具備穩定的成長動能，持續在既定軌道上精進技能，保持學習的節奏和方向，順應自然發展趨勢必能穩步提升。",
        "8": "你需要認清當前成長模式的局限性，避免在已經飽和的領域繼續投入，重新審視自己的發展瓶頸並尋找突破點。",
        "9": "你過往的成長模式已達高峰，順應時勢轉換發展重點，將經驗智慧轉化為新的成長動力，接受角色的自然轉變。"
      },
      "4": {
        "6": "你觀察到外在環境出現微妙變化，這些波動正是調整策略的良機，及時修正方向能讓你在變動中保持優勢地位。",
        "7": "你所處的外在條件正值順暢期，天時地利人和齊備，堅持既定路線繼續前進，必能乘勢而上創造佳績。",
        "8": "你面對的外在環境已形成難以撼動的僵局，與其硬碰硬耗損實力，不如暫時避開鋒芒另尋突破機會。",
        "9": "你察覺外在優勢已達頂峰開始轉弱，明智的做法是順應這股轉變趨勢，提早佈局迎接下一個循環。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，雖然整體局面看似穩定，但細節處已現鬆動跡象，及時順應這些變化調整策略，可避免後續的重大波動。",
        "7": "你看見外在形勢正朝著有利方向發展，各項條件都在配合你的計畫推進，繼續保持現有步調前進，順應這股天時地利的良好趨勢。",
        "8": "你面對的外在環境已形成難以撼動的既定格局，各種因素盤根錯節，與其強行改變不如認清現實，尋找在既有框架內運作的空間。",
        "9": "你察覺外在的繁華盛況已達頂點，表面風光背後暗藏轉折信號，主動順應即將到來的變化，比固守當前的優勢地位更為明智。"
      },
      "6": {
        "6": "你需密切關注外在環境的細微變化，當察覺趨勢有轉向跡象時，應及時調整策略方向，避免固守既有模式而錯失適應良機。",
        "7": "你可觀察到外在環境正朝著有利方向發展，此時應保持現有步調持續前進，順應這股正向趨勢來擴展既有成果。",
        "8": "你會發現外在環境已形成難以撼動的既定格局，與其強行對抗這股龐大趨勢，不如認清現實並尋找其他發展路徑。",
        "9": "你應察覺外在環境的強勢發展已達頂峰，即將面臨轉折點，此時需順應這個自然循環，準備迎接下一階段的變化。"
      }
    }
  },
  "64": {
    "number": 64,
    "name": "未濟",
    "code": "010101",
    "卦解": "你現在就像站在一條半開通的河流邊，水勢不急不緩地往前流著，偶爾會遇到一些小石頭讓流水轉個彎，但整體還是在往前進的。你手邊的資源和能力算是中等水準，不算豐厚但也不匱乏。有趣的是，外在環境給你的支持比內在的動力還要強一些，就像有股溫和的風在背後推著你前進。雖然進展的速度不快，但你能感覺到事情正在慢慢串連起來，一步一步地往目標靠近。",
    "六階段": {
      "1": "你正站在一個全新的起點，心中既興奮又忐忑。許多條件還沒到位，你只能邊做邊學，每一步都像在試水溫。內心充滿不確定感，但也有種探險的刺激。周圍的人事物似乎都還在觀望，沒有給出明確的信號。你知道這是必經的摸索期，只能憑直覺前進，為後續的發展打下基礎。",
      "2": "經過初期的摸索，你開始找到節奏了。工作或計劃有了穩定的產出，方向也越來越清晰。內心的焦慮減少，取而代之的是踏實的成就感。你能感受到自己的能力正在穩步提升，每天都有具體的進展。外在環境開始給予正面回饋，讓你更有信心繼續前進。這種穩定的狀態讓你覺得一切都在掌控之中。",
      "3": "你來到了一個關鍵的轉折點，卻發現許多小細節開始出問題。明明大方向沒錯，但總有些地方需要來回修補，進度因此放慢。內心有些煩躁，覺得為什麼總是差那麼一點點。周圍環境變得複雜，需要更多耐心和細心來處理。雖然挫折感增加，但你也意識到這些調整是為了讓後續發展更穩固。",
      "4": "外在世界變得難以預測，有時機會之門大開，有時卻緊緊關閉。你學會了等待的藝術，但內心仍難免焦急。別人的回應時快時慢，讓你無法掌握準確的時機點。環境中充滿變數，你只能保持彈性，隨時準備抓住稍縱即逝的機會。這種不確定性讓你更加珍惜每一個可能的窗口期。",
      "5": "大局已定，你能清楚看到整個輪廓。主要架構穩固，讓你內心更加篤定。雖然還有一些零星的不確定因素，但已不足以撼動整體方向。環境氛圍趨於穩定，大部分的阻礙都已排除。你感到一種即將成功的踏實感，同時也保持警覺，知道最後階段仍需謹慎對待那些細節問題。",
      "6": "你已經走到最後一哩路，卻發現臨門一腳就是踢不進去。所有該做的都做了，成果暫時收在手中，但總覺得少了什麼。內心五味雜陳，既有完成大部分工作的滿足，也有功虧一簣的遺憾。外在時機尚未完全成熟，你需要耐心等待下一個合適的窗口。這不是結束，而是為下一次更完美的開始做準備。"
    },
    "6789建議": {
      "1": {
        "6": "你的基礎能力尚在變動中，此時應該順應內心的直覺，主動調整學習方向和技能重點，不要執著於既定的能力框架，靈活修正才能建立更穩固的根基。",
        "7": "你的基本功底正處於上升期，應該持續專精核心技能，順著天時地利的趨勢深耕基礎能力，保持學習的節奏和方向，穩步累積實力為未來奠基。",
        "8": "你過去累積的基礎能力已經僵化，必須認清現實中的不足之處，暫時避開需要高技術要求的挑戰，重新檢視和重建你的核心競爭力與專業根基。",
        "9": "你的基礎能力雖然深厚但已到達瓶頸，應該順應時代變遷主動轉型，將過往的經驗智慧轉化為新領域的基石，以老帶新開創第二專業曲線。"
      },
      "2": {
        "6": "你的外在表現容易給人不穩定的印象，此時應該主動調整自己的言行舉止，讓他人看到你更加成熟穩重的一面。",
        "7": "你展現出來的形象正符合當前趨勢，繼續保持這種積極向上的外在表現，持續向目標前進就對了。",
        "8": "你長期累積的負面形象已經根深蒂固，必須認清這個現實，暫時避免過度曝光，等待時機再重新塑造。",
        "9": "你過往強勢的外在形象已到轉折點，主動順應變化調整自己的表現方式，展現更柔軟包容的一面。"
      },
      "3": {
        "6": "你的成長潛力仍在萌芽階段，容易受外界影響而搖擺不定，此時應該靈活調整學習方向，順應內心真實需求來修正發展路徑。",
        "7": "你的成長動能正值上升期，天時地利皆備，應該保持現有的努力方向持續前進，穩定投入將為未來奠定堅實基礎。",
        "8": "你過去的成長模式已經固化難改，必須認清現實局限，避免再用舊方法強求突破，轉而尋找更適合的發展空間。",
        "9": "你的成長勢頭已達高峰開始轉折，應該順應這個轉變時機，將過往累積的能量轉化為新的發展方向和可能性。"
      },
      "4": {
        "6": "你需要密切觀察外在環境的細微變化，當發現不利信號時要及時調整策略，靈活應變才能避免因環境突變而陷入困境。",
        "7": "你應該把握當前有利的外在條件，順應大環境的發展趋勢持續前進，這是推動事業突破的最佳時機。",
        "8": "你必須認清外在環境已經積累太多不利因素，與其勉強對抗不如暫時避開鋒芒，等待更好的時機再出手。",
        "9": "你要察覺到外在環境的強勢已接近尾聲，順應即將到來的轉變調整方向，才能在新局面中佔得先機。"
      },
      "5": {
        "6": "你觀察到外在環境正在微妙變化，這些變動雖然還不明顯，但已經露出端倪。順應這些初始的變化趨勢，及時調整你的策略和方向，將能把握住轉機。",
        "7": "你看見外在環境正朝著有利的方向發展，各種條件逐漸成熟。保持現有的前進步調，堅定地沿著既定路線繼續努力，成功就在不遠處等著你。",
        "8": "你面對的外在環境已經固化僵硬，舊有的模式根深蒂固難以撼動。認清這個現實狀況，避免硬碰硬的對抗，尋找其他突破口或暫時保存實力。",
        "9": "你察覺外在環境的舊勢力已達頂峰開始衰退，新的轉變即將來臨。順應這個大勢所趨的變化，放下對過去的執著，準備迎接新局面的到來。"
      },
      "6": {
        "6": "你觀察到外在環境正處於變動期，各種趨勢尚未明朗，此時應保持彈性思維，隨時準備根據新出現的訊號調整你的策略方向。",
        "7": "你看見外在大勢正朝著有利方向發展，天時地利皆在你這一邊，應該堅定信心持續推進，不要因小波折而改變既定路線。",
        "8": "你面對的外在環境已形成難以撼動的既定格局，強行對抗只會徒勞無功，應該認清現實選擇暫時退守或另尋出路。",
        "9": "你察覺外在強勢已達頂點開始轉弱，舊有格局即將瓦解，應該順應這個轉換時機，準備迎接新局面的到來。"
      }
    }
  }
}